name: "GoogleNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 16
    th_layer_out: 151.0
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1/7x7_s2"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1/7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 151.0
    th_layer_out: 2166.46826172
    th_params: 0.39420607686
    th_params: 0.361872911453
    th_params: 0.372940480709
    th_params: 1.00147616863
    th_params: 0.900288105011
    th_params: 0.768954277039
    th_params: 0.802300453186
    th_params: 0.63660389185
    th_params: 0.37376704812
    th_params: 0.594033837318
    th_params: 0.400175541639
    th_params: 0.852022051811
    th_params: 0.2657956779
    th_params: 0.751048326492
    th_params: 0.624548614025
    th_params: 0.568832278252
    th_params: 0.800433397293
    th_params: 1.07546007633
    th_params: 0.418145626783
    th_params: 1.11294126511
    th_params: 0.623790025711
    th_params: 0.622985303402
    th_params: 0.676411628723
    th_params: 0.859438717365
    th_params: 0.938401341438
    th_params: 0.301705777645
    th_params: 0.194630801678
    th_params: 0.743691921234
    th_params: 0.471544593573
    th_params: 0.391512989998
    th_params: 0.764568448067
    th_params: 0.855012893677
    th_params: 1.14460527897
    th_params: 0.631073117256
    th_params: 0.497550457716
    th_params: 0.933280169964
    th_params: 0.43652305007
    th_params: 0.478020727634
    th_params: 1.00567066669
    th_params: 0.485037088394
    th_params: 0.635193645954
    th_params: 0.263274729252
    th_params: 0.941906929016
    th_params: 0.50284153223
    th_params: 1.01627826691
    th_params: 1.02539634705
    th_params: 0.427014827728
    th_params: 0.791639387608
    th_params: 0.948344886303
    th_params: 0.978034436703
    th_params: 0.834177672863
    th_params: 0.627662539482
    th_params: 0.264060586691
    th_params: 0.383581995964
    th_params: 0.656222760677
    th_params: 0.439656883478
    th_params: 1.05087256432
    th_params: 0.770942151546
    th_params: 0.362357616425
    th_params: 1.04766058922
    th_params: 0.549808859825
    th_params: 0.708961248398
    th_params: 0.272575736046
    th_params: 0.49119758606
  }
}
layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1/7x7_s2"
  top: "conv1/7x7_s2"
}
layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2166.46826172
    th_layer_out: 2166.46826172
  }
}
layer {
  name: "conv2/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool1/3x3_s2"
  top: "conv2/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2166.46826172
    th_layer_out: 2917.76977539
    th_params: 0.66389632225
    th_params: 1.47931408882
    th_params: 0.629735291004
    th_params: 0.642287135124
    th_params: 0.637602567673
    th_params: 1.06296980381
    th_params: 0.570226848125
    th_params: 0.687679290771
    th_params: 1.24292385578
    th_params: 0.6697717309
    th_params: 0.988911926746
    th_params: 0.72679322958
    th_params: 0.797414839268
    th_params: 0.482701718807
    th_params: 0.556438982487
    th_params: 0.479470878839
    th_params: 0.603136062622
    th_params: 0.606939375401
    th_params: 0.767149865627
    th_params: 0.407326519489
    th_params: 0.520838916302
    th_params: 0.819478809834
    th_params: 0.769498705864
    th_params: 0.559401810169
    th_params: 0.451716512442
    th_params: 0.904613256454
    th_params: 0.495812147856
    th_params: 0.515575945377
    th_params: 0.728005230427
    th_params: 1.1719096899
    th_params: 0.823567569256
    th_params: 0.709503531456
    th_params: 0.908760368824
    th_params: 0.586892902851
    th_params: 0.559150159359
    th_params: 0.465955704451
    th_params: 0.761943697929
    th_params: 0.769787728786
    th_params: 0.52054977417
    th_params: 0.435692489147
    th_params: 0.787078082561
    th_params: 0.481594592333
    th_params: 0.454535126686
    th_params: 0.372402727604
    th_params: 0.50971776247
    th_params: 1.14605522156
    th_params: 0.310766100883
    th_params: 0.607384860516
    th_params: 0.621383368969
    th_params: 1.00640201569
    th_params: 0.661240816116
    th_params: 0.629041016102
    th_params: 0.638299405575
    th_params: 0.441394835711
    th_params: 0.620625793934
    th_params: 0.798550605774
    th_params: 0.470672875643
    th_params: 0.91276204586
    th_params: 1.40786135197
    th_params: 0.456629097462
    th_params: 0.810493052006
    th_params: 0.531959712505
    th_params: 0.46270570159
    th_params: 0.740687131882
  }
}
layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_reduce"
}
layer {
  name: "conv2/3x3"
  type: "ConvolutionRistretto"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2917.76977539
    th_layer_out: 2940.21386719
    th_params: 0.202122926712
    th_params: 0.256367564201
    th_params: 0.206591337919
    th_params: 0.446901798248
    th_params: 0.176685467362
    th_params: 0.297308743
    th_params: 0.344201952219
    th_params: 0.296079576015
    th_params: 0.293238937855
    th_params: 0.328550040722
    th_params: 0.512226223946
    th_params: 0.364690601826
    th_params: 0.245658934116
    th_params: 0.305955201387
    th_params: 0.51839953661
    th_params: 0.34560546279
    th_params: 0.316681593657
    th_params: 0.403030872345
    th_params: 0.210670977831
    th_params: 0.249931648374
    th_params: 0.199927598238
    th_params: 0.310922533274
    th_params: 0.313070297241
    th_params: 0.152891650796
    th_params: 0.25384759903
    th_params: 0.259782165289
    th_params: 0.230820402503
    th_params: 0.326251357794
    th_params: 0.326589614153
    th_params: 0.197324603796
    th_params: 0.51628524065
    th_params: 0.348631113768
    th_params: 0.228389874101
    th_params: 0.17248223722
    th_params: 0.389592200518
    th_params: 0.262399703264
    th_params: 0.254067033529
    th_params: 0.275803506374
    th_params: 0.348434209824
    th_params: 0.161559447646
    th_params: 0.365476667881
    th_params: 0.927654802799
    th_params: 0.337657213211
    th_params: 0.244601890445
    th_params: 0.33477050066
    th_params: 0.169817775488
    th_params: 0.229788959026
    th_params: 0.363959789276
    th_params: 0.211482182145
    th_params: 0.263586133718
    th_params: 0.149915486574
    th_params: 0.822415113449
    th_params: 0.292847424746
    th_params: 0.233033180237
    th_params: 0.276573896408
    th_params: 0.331766188145
    th_params: 0.378407537937
    th_params: 0.408632397652
    th_params: 0.240685358644
    th_params: 0.369221895933
    th_params: 0.295842319727
    th_params: 0.333311915398
    th_params: 0.201393514872
    th_params: 0.509383678436
    th_params: 0.349876970053
    th_params: 1.17478561401
    th_params: 0.359508723021
    th_params: 0.366934090853
    th_params: 0.620513737202
    th_params: 0.799804925919
    th_params: 0.300781697035
    th_params: 0.295306175947
    th_params: 0.239940464497
    th_params: 0.217503353953
    th_params: 0.514098227024
    th_params: 0.434486627579
    th_params: 0.451042979956
    th_params: 0.211346834898
    th_params: 0.203844115138
    th_params: 0.308055281639
    th_params: 0.216958910227
    th_params: 0.339510023594
    th_params: 0.350508660078
    th_params: 0.702672064304
    th_params: 0.409767717123
    th_params: 0.37654620409
    th_params: 0.301916539669
    th_params: 0.682579517365
    th_params: 0.391982793808
    th_params: 0.383583456278
    th_params: 0.270111948252
    th_params: 0.286064863205
    th_params: 0.30340757966
    th_params: 0.287023693323
    th_params: 0.227449268103
    th_params: 0.51568800211
    th_params: 0.161817356944
    th_params: 0.686574459076
    th_params: 0.416152209044
    th_params: 0.323287457228
    th_params: 0.232380598783
    th_params: 0.213203400373
    th_params: 0.142035529017
    th_params: 0.360515624285
    th_params: 0.419938623905
    th_params: 0.564780652523
    th_params: 0.21921440959
    th_params: 0.342580974102
    th_params: 0.327494621277
    th_params: 0.275242954493
    th_params: 0.221290662885
    th_params: 0.410317271948
    th_params: 0.24489825964
    th_params: 0.179321542382
    th_params: 0.266089230776
    th_params: 0.740370094776
    th_params: 0.342341125011
    th_params: 0.203956887126
    th_params: 0.469439387321
    th_params: 0.2411878407
    th_params: 0.404224842787
    th_params: 0.257389038801
    th_params: 0.446820914745
    th_params: 0.277760624886
    th_params: 0.192175760865
    th_params: 0.638775467873
    th_params: 0.315948754549
    th_params: 0.223937705159
    th_params: 0.436400473118
    th_params: 0.253374755383
    th_params: 0.413521021605
    th_params: 0.309284120798
    th_params: 0.26333579421
    th_params: 0.337944507599
    th_params: 0.138163596392
    th_params: 0.256784081459
    th_params: 0.238629579544
    th_params: 0.326612651348
    th_params: 0.846774876118
    th_params: 0.200213447213
    th_params: 0.49650657177
    th_params: 0.396643936634
    th_params: 1.17999768257
    th_params: 0.3087695539
    th_params: 0.258485049009
    th_params: 0.30721193552
    th_params: 0.275563001633
    th_params: 0.304829955101
    th_params: 0.273147553205
    th_params: 0.194754883647
    th_params: 0.405164480209
    th_params: 0.352215886116
    th_params: 0.268521726131
    th_params: 0.366107195616
    th_params: 0.381423383951
    th_params: 0.284101337194
    th_params: 0.480925768614
    th_params: 0.235794976354
    th_params: 0.507527530193
    th_params: 0.237902686
    th_params: 0.358153045177
    th_params: 0.287352561951
    th_params: 0.211572661996
    th_params: 0.224077761173
    th_params: 0.348976194859
    th_params: 0.416345149279
    th_params: 0.229813575745
    th_params: 0.314450860023
    th_params: 0.325999736786
    th_params: 0.211127027869
    th_params: 0.32883182168
    th_params: 0.28549182415
    th_params: 0.268197834492
    th_params: 0.278118044138
    th_params: 0.245482668281
    th_params: 0.24744053185
    th_params: 0.288693070412
    th_params: 0.138558268547
    th_params: 0.20289939642
    th_params: 0.17726059258
    th_params: 0.264595597982
    th_params: 0.452011942863
    th_params: 0.967771887779
    th_params: 0.364607334137
    th_params: 0.29554772377
    th_params: 0.492647200823
    th_params: 0.195768848062
    th_params: 0.305736541748
    th_params: 0.312938392162
    th_params: 0.249435797334
    th_params: 0.168185174465
    th_params: 0.268071532249
  }
}
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3"
  top: "conv2/3x3"
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/3x3"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2940.21386719
    th_layer_out: 2940.21386719
  }
}
layer {
  name: "inception_3a/1x1"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2940.21386719
    th_layer_out: 3652.62109375
    th_params: 0.36008104682
    th_params: 0.298954427242
    th_params: 0.35999211669
    th_params: 0.347296327353
    th_params: 0.375005841255
    th_params: 0.429547458887
    th_params: 0.30703291297
    th_params: 0.34604460001
    th_params: 0.296987295151
    th_params: 0.359451055527
    th_params: 0.350641280413
    th_params: 0.368704199791
    th_params: 0.448104292154
    th_params: 0.269856005907
    th_params: 0.22628852725
    th_params: 0.293387711048
    th_params: 0.31959977746
    th_params: 0.352217137814
    th_params: 0.323546975851
    th_params: 0.255257725716
    th_params: 0.446070432663
    th_params: 0.464222371578
    th_params: 0.301099598408
    th_params: 0.40499958396
    th_params: 0.444173663855
    th_params: 0.319885909557
    th_params: 0.513411700726
    th_params: 0.267352074385
    th_params: 0.238824546337
    th_params: 0.325944066048
    th_params: 0.248294591904
    th_params: 0.283113539219
    th_params: 0.33554404974
    th_params: 0.49418336153
    th_params: 0.31061026454
    th_params: 0.209497496486
    th_params: 0.270051956177
    th_params: 0.367562621832
    th_params: 0.329142391682
    th_params: 0.582564473152
    th_params: 0.387260526419
    th_params: 0.320504009724
    th_params: 0.302246063948
    th_params: 0.314811140299
    th_params: 0.254538655281
    th_params: 0.324971020222
    th_params: 0.454341441393
    th_params: 0.408371150494
    th_params: 0.4938762784
    th_params: 0.290283441544
    th_params: 0.359249770641
    th_params: 0.343219250441
    th_params: 0.288941472769
    th_params: 0.244398131967
    th_params: 0.323337525129
    th_params: 0.310773968697
    th_params: 0.29978454113
    th_params: 0.312862873077
    th_params: 0.339072734118
    th_params: 0.333648353815
    th_params: 0.233222588897
    th_params: 0.453231304884
    th_params: 0.440573304892
    th_params: 0.297583818436
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1"
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2940.21386719
    th_layer_out: 3645.77392578
    th_params: 0.336385667324
    th_params: 0.391912609339
    th_params: 0.35301220417
    th_params: 0.330466061831
    th_params: 0.202566206455
    th_params: 0.189520969987
    th_params: 0.320109844208
    th_params: 0.252577245235
    th_params: 0.207545980811
    th_params: 0.298481017351
    th_params: 0.223174437881
    th_params: 0.277649819851
    th_params: 0.300002157688
    th_params: 0.284317225218
    th_params: 0.52019649744
    th_params: 0.523713767529
    th_params: 0.396646618843
    th_params: 0.204223483801
    th_params: 0.469424724579
    th_params: 0.22641351819
    th_params: 0.473676770926
    th_params: 0.444287955761
    th_params: 0.443519055843
    th_params: 0.448968023062
    th_params: 0.676915287971
    th_params: 0.290697842836
    th_params: 0.379278808832
    th_params: 0.206143185496
    th_params: 0.212431907654
    th_params: 0.310826927423
    th_params: 0.300993263721
    th_params: 0.304007947445
    th_params: 0.261126190424
    th_params: 0.236684322357
    th_params: 0.27391704917
    th_params: 0.33737513423
    th_params: 0.485677540302
    th_params: 0.311087936163
    th_params: 0.224408954382
    th_params: 0.388708084822
    th_params: 0.263812482357
    th_params: 0.402045637369
    th_params: 0.334427177906
    th_params: 0.268084675074
    th_params: 0.231438487768
    th_params: 0.228087902069
    th_params: 0.265821009874
    th_params: 0.313068211079
    th_params: 0.238058760762
    th_params: 0.314454615116
    th_params: 0.280853748322
    th_params: 0.228274434805
    th_params: 0.290131896734
    th_params: 0.175333797932
    th_params: 0.302683115005
    th_params: 0.455516427755
    th_params: 0.338716030121
    th_params: 0.334948003292
    th_params: 0.293013125658
    th_params: 0.446445196867
    th_params: 0.314766705036
    th_params: 0.224457979202
    th_params: 0.267585575581
    th_params: 0.344717234373
    th_params: 0.262722998857
    th_params: 0.433297634125
    th_params: 0.182376161218
    th_params: 0.353770703077
    th_params: 0.34092181921
    th_params: 0.201346918941
    th_params: 0.406791210175
    th_params: 0.371974736452
    th_params: 0.306011378765
    th_params: 0.222323298454
    th_params: 0.408129394054
    th_params: 0.409281224012
    th_params: 0.409283638
    th_params: 0.453826844692
    th_params: 0.346769809723
    th_params: 0.339588463306
    th_params: 0.584313094616
    th_params: 0.236389935017
    th_params: 0.297569513321
    th_params: 0.198241829872
    th_params: 0.473456680775
    th_params: 0.240119367838
    th_params: 0.336818754673
    th_params: 0.312816768885
    th_params: 0.330045074224
    th_params: 0.530734837055
    th_params: 0.359488070011
    th_params: 0.300742954016
    th_params: 0.542373001575
    th_params: 0.447372585535
    th_params: 0.465565234423
    th_params: 1.36850512028
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce"
}
layer {
  name: "inception_3a/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 3645.77392578
    th_layer_out: 3652.62109375
    th_params: 0.220163673162
    th_params: 0.0404358915985
    th_params: 0.261304557323
    th_params: 0.290146648884
    th_params: 0.417349606752
    th_params: 0.379976570606
    th_params: 0.227289527655
    th_params: 0.251739889383
    th_params: 0.290374845266
    th_params: 0.203090727329
    th_params: 0.257474184036
    th_params: 0.227949991822
    th_params: 0.267763793468
    th_params: 0.229006022215
    th_params: 0.218145191669
    th_params: 0.289281189442
    th_params: 0.0872660055757
    th_params: 0.221357643604
    th_params: 0.132253304124
    th_params: 0.214406952262
    th_params: 0.152333423495
    th_params: 0.270107448101
    th_params: 0.196348503232
    th_params: 0.175833657384
    th_params: 0.137130185962
    th_params: 0.169966131449
    th_params: 0.191950380802
    th_params: 0.267193585634
    th_params: 0.334102988243
    th_params: 0.278390407562
    th_params: 0.348537534475
    th_params: 0.15914618969
    th_params: 0.224229514599
    th_params: 0.222802966833
    th_params: 0.157186344266
    th_params: 0.484896540642
    th_params: 0.14439201355
    th_params: 0.310819149017
    th_params: 0.23302847147
    th_params: 0.301970481873
    th_params: 0.164017945528
    th_params: 0.191077962518
    th_params: 0.42934191227
    th_params: 0.180028542876
    th_params: 0.243650823832
    th_params: 0.208955317736
    th_params: 0.20738941431
    th_params: 0.170804604888
    th_params: 0.227856695652
    th_params: 0.210916668177
    th_params: 0.286522358656
    th_params: 0.265620440245
    th_params: 0.192242532969
    th_params: 0.281287670135
    th_params: 0.231170132756
    th_params: 0.211104422808
    th_params: 0.371319621801
    th_params: 0.139247462153
    th_params: 0.187901973724
    th_params: 0.178009480238
    th_params: 0.244225129485
    th_params: 0.157167688012
    th_params: 0.271757900715
    th_params: 0.178376421332
    th_params: 0.333670854568
    th_params: 0.323006480932
    th_params: 0.23002974689
    th_params: 0.166929423809
    th_params: 0.194323599339
    th_params: 0.252206802368
    th_params: 0.376574248075
    th_params: 0.223182827234
    th_params: 0.183613300323
    th_params: 0.335084110498
    th_params: 0.165759325027
    th_params: 0.203857779503
    th_params: 0.214209958911
    th_params: 0.364133834839
    th_params: 0.364202171564
    th_params: 0.192066594958
    th_params: 0.2405821383
    th_params: 0.241644084454
    th_params: 0.242925614119
    th_params: 0.21786467731
    th_params: 0.330324947834
    th_params: 0.224675327539
    th_params: 0.184028863907
    th_params: 0.166956976056
    th_params: 0.248123571277
    th_params: 0.276730269194
    th_params: 0.172281593084
    th_params: 0.2104280442
    th_params: 0.258774667978
    th_params: 0.22870439291
    th_params: 0.300064057112
    th_params: 0.324731200933
    th_params: 0.181854099035
    th_params: 0.188476145267
    th_params: 0.155587226152
    th_params: 0.289931237698
    th_params: 0.220538005233
    th_params: 0.274088770151
    th_params: 0.176823958755
    th_params: 0.204764038324
    th_params: 0.218170061707
    th_params: 0.253664076328
    th_params: 0.154446408153
    th_params: 0.382668197155
    th_params: 0.155242353678
    th_params: 0.35375019908
    th_params: 0.21934774518
    th_params: 0.355907678604
    th_params: 0.311281472445
    th_params: 0.178370937705
    th_params: 0.135062262416
    th_params: 0.192582860589
    th_params: 0.22903740406
    th_params: 0.167498499155
    th_params: 0.171975925565
    th_params: 0.166448801756
    th_params: 0.231478229165
    th_params: 0.16723190248
    th_params: 0.196288898587
    th_params: 0.139688059688
    th_params: 0.234485700727
    th_params: 0.198956876993
    th_params: 0.153141528368
    th_params: 0.224391877651
  }
}
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3"
}
layer {
  name: "inception_3a/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2940.21386719
    th_layer_out: 1978.86340332
    th_params: 0.171085625887
    th_params: 0.361715704203
    th_params: 0.231027528644
    th_params: 0.477995246649
    th_params: 0.221563071012
    th_params: 0.156635448337
    th_params: 0.249813646078
    th_params: 0.230663195252
    th_params: 0.309966623783
    th_params: 0.267306685448
    th_params: 0.156955987215
    th_params: 0.431728363037
    th_params: 0.360411763191
    th_params: 0.43102607131
    th_params: 0.32376408577
    th_params: 0.455375283957
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5_reduce"
}
layer {
  name: "inception_3a/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 1978.86340332
    th_layer_out: 3652.62109375
    th_params: 0.408877015114
    th_params: 0.249057635665
    th_params: 0.294004023075
    th_params: 0.191649362445
    th_params: 0.37828591466
    th_params: 0.288917005062
    th_params: 0.153016895056
    th_params: 0.474085569382
    th_params: 0.306566238403
    th_params: 0.247906118631
    th_params: 0.163102939725
    th_params: 0.220219507813
    th_params: 0.274411231279
    th_params: 0.622235894203
    th_params: 0.267282098532
    th_params: 0.379194051027
    th_params: 0.211128339171
    th_params: 0.276160210371
    th_params: 0.300500959158
    th_params: 0.266656607389
    th_params: 0.243961796165
    th_params: 0.265531301498
    th_params: 0.248662024736
    th_params: 0.220268622041
    th_params: 0.155669808388
    th_params: 0.196202129126
    th_params: 0.139328673482
    th_params: 0.577973842621
    th_params: 0.354084193707
    th_params: 0.293541163206
    th_params: 0.175617069006
    th_params: 0.295573830605
  }
}
layer {
  name: "inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inception_3a/5x5"
  top: "inception_3a/5x5"
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2940.21386719
    th_layer_out: 2940.21386719
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2940.21386719
    th_layer_out: 3652.62109375
    th_params: 0.349084109068
    th_params: 0.279494345188
    th_params: 0.386277645826
    th_params: 0.264625757933
    th_params: 0.3913154006
    th_params: 0.338109284639
    th_params: 0.410281181335
    th_params: 0.494084089994
    th_params: 0.540229201317
    th_params: 0.575267136097
    th_params: 0.338645190001
    th_params: 0.290765821934
    th_params: 0.271395921707
    th_params: 0.220699429512
    th_params: 0.612936377525
    th_params: 0.379901528358
    th_params: 0.266352146864
    th_params: 0.440703421831
    th_params: 0.283665269613
    th_params: 0.330486118793
    th_params: 0.36442604661
    th_params: 0.441711485386
    th_params: 0.291822046041
    th_params: 0.250740945339
    th_params: 0.362794786692
    th_params: 0.522375404835
    th_params: 0.248169824481
    th_params: 0.382877975702
    th_params: 0.300769656897
    th_params: 0.326369583607
    th_params: 0.271250724792
    th_params: 0.36629396677
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj"
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1"
  bottom: "inception_3a/3x3"
  bottom: "inception_3a/5x5"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/output"
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 3652.62109375
    th_layer_out: 3652.62109375
  }
}
layer {
  name: "inception_3b/1x1"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 3652.62109375
    th_layer_out: 1933.40246582
    th_params: 0.156840652227
    th_params: 0.353076130152
    th_params: 0.37842169404
    th_params: 0.420968979597
    th_params: 0.238688468933
    th_params: 0.300187915564
    th_params: 0.208500221372
    th_params: 0.288119077682
    th_params: 0.224560245872
    th_params: 0.419825047255
    th_params: 0.270119935274
    th_params: 0.162688076496
    th_params: 0.218774482608
    th_params: 0.255028218031
    th_params: 0.249045863748
    th_params: 0.354996353388
    th_params: 0.197221070528
    th_params: 0.306107521057
    th_params: 0.261155575514
    th_params: 0.217167600989
    th_params: 0.224888429046
    th_params: 0.231470137835
    th_params: 0.441802710295
    th_params: 0.291212528944
    th_params: 0.266596615314
    th_params: 0.235760167241
    th_params: 0.277411192656
    th_params: 0.441014438868
    th_params: 0.189427152276
    th_params: 0.27795240283
    th_params: 0.2030531317
    th_params: 0.236009910703
    th_params: 0.188994854689
    th_params: 0.314392000437
    th_params: 0.166265383363
    th_params: 0.401032060385
    th_params: 0.293904721737
    th_params: 0.235748976469
    th_params: 0.197996109724
    th_params: 0.220509901643
    th_params: 0.357425391674
    th_params: 0.36949685216
    th_params: 0.175158709288
    th_params: 0.224743142724
    th_params: 0.198919549584
    th_params: 0.31093788147
    th_params: 0.207903593779
    th_params: 0.295366108418
    th_params: 0.247916981578
    th_params: 0.203054860234
    th_params: 0.260784983635
    th_params: 0.181207537651
    th_params: 0.521220862865
    th_params: 0.233438700438
    th_params: 0.287391632795
    th_params: 0.182647332549
    th_params: 0.277490764856
    th_params: 0.253062784672
    th_params: 0.289603680372
    th_params: 0.427878767252
    th_params: 0.23148791492
    th_params: 0.210608392954
    th_params: 0.231841027737
    th_params: 0.260874122381
    th_params: 0.303903251886
    th_params: 0.304144710302
    th_params: 0.265047609806
    th_params: 0.34353274107
    th_params: 0.256413072348
    th_params: 0.341327905655
    th_params: 0.24165289104
    th_params: 0.304593890905
    th_params: 0.248345732689
    th_params: 0.201754942536
    th_params: 0.219589918852
    th_params: 0.214343339205
    th_params: 0.337464094162
    th_params: 0.250100433826
    th_params: 0.544577360153
    th_params: 0.192474782467
    th_params: 0.273846954107
    th_params: 0.230654671788
    th_params: 0.255957961082
    th_params: 0.190167143941
    th_params: 0.262376487255
    th_params: 0.2247518152
    th_params: 0.30691370368
    th_params: 0.187413394451
    th_params: 0.273243933916
    th_params: 0.335813343525
    th_params: 0.200193464756
    th_params: 0.249935850501
    th_params: 0.25668412447
    th_params: 0.159242123365
    th_params: 0.321527242661
    th_params: 0.306914925575
    th_params: 0.268396347761
    th_params: 0.264794170856
    th_params: 0.223707303405
    th_params: 0.346177279949
    th_params: 0.27370724082
    th_params: 0.284030288458
    th_params: 0.273545950651
    th_params: 0.169325277209
    th_params: 0.358918398619
    th_params: 0.274203807116
    th_params: 0.333107084036
    th_params: 0.216517448425
    th_params: 0.172722309828
    th_params: 0.237164482474
    th_params: 0.298118084669
    th_params: 0.243636235595
    th_params: 0.274067163467
    th_params: 0.229916796088
    th_params: 0.206096306443
    th_params: 0.242159932852
    th_params: 0.405139118433
    th_params: 0.254025310278
    th_params: 0.251811057329
    th_params: 0.16601549089
    th_params: 0.188806802034
    th_params: 0.335453093052
    th_params: 0.152137890458
    th_params: 0.293386280537
    th_params: 0.275030463934
    th_params: 0.219840168953
    th_params: 0.211503282189
    th_params: 0.268041461706
  }
}
layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1"
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 3652.62109375
    th_layer_out: 2286.56933594
    th_params: 0.281183868647
    th_params: 0.287993371487
    th_params: 0.207688838243
    th_params: 0.323058485985
    th_params: 0.243634939194
    th_params: 0.281643211842
    th_params: 0.252467185259
    th_params: 0.213594585657
    th_params: 0.575659036636
    th_params: 0.242274001241
    th_params: 0.374975770712
    th_params: 0.286767482758
    th_params: 0.282293349504
    th_params: 0.281350106001
    th_params: 0.226116254926
    th_params: 0.204595252872
    th_params: 0.408946156502
    th_params: 0.185580685735
    th_params: 0.242684423923
    th_params: 0.314431816339
    th_params: 0.395669817924
    th_params: 0.236227542162
    th_params: 0.313259571791
    th_params: 0.324883371592
    th_params: 0.206403374672
    th_params: 0.211063161492
    th_params: 0.291014611721
    th_params: 0.433406233788
    th_params: 0.217152670026
    th_params: 0.258208304644
    th_params: 0.28630644083
    th_params: 0.245964795351
    th_params: 0.236189320683
    th_params: 0.25244936347
    th_params: 0.198737800121
    th_params: 0.234585464001
    th_params: 0.358893036842
    th_params: 0.222372919321
    th_params: 0.34335282445
    th_params: 0.219916850328
    th_params: 0.222617000341
    th_params: 0.219034612179
    th_params: 0.184600219131
    th_params: 0.331514775753
    th_params: 0.331917136908
    th_params: 0.190998762846
    th_params: 0.210167780519
    th_params: 0.305928230286
    th_params: 0.386493504047
    th_params: 0.176801592112
    th_params: 0.2844427526
    th_params: 0.18517306447
    th_params: 0.234195768833
    th_params: 0.320717304945
    th_params: 0.198265388608
    th_params: 0.183998867869
    th_params: 0.309725642204
    th_params: 0.216252297163
    th_params: 0.285536140203
    th_params: 0.305807292461
    th_params: 0.256416678429
    th_params: 0.218202278018
    th_params: 0.301809608936
    th_params: 0.232253566384
    th_params: 0.21339699626
    th_params: 0.184580504894
    th_params: 0.209862619638
    th_params: 0.256480932236
    th_params: 0.260928988457
    th_params: 0.16850553453
    th_params: 0.322293609381
    th_params: 0.331668496132
    th_params: 0.253231436014
    th_params: 0.235557541251
    th_params: 0.23513610661
    th_params: 0.209818676114
    th_params: 0.239096090198
    th_params: 0.270540684462
    th_params: 0.184917747974
    th_params: 0.253851145506
    th_params: 0.332381784916
    th_params: 0.202243238688
    th_params: 0.216974392533
    th_params: 0.33528009057
    th_params: 0.320595741272
    th_params: 0.224448889494
    th_params: 0.201003044844
    th_params: 0.210263669491
    th_params: 0.215946018696
    th_params: 0.741250991821
    th_params: 0.177632823586
    th_params: 0.291015267372
    th_params: 0.255287051201
    th_params: 0.239782646298
    th_params: 0.21179009974
    th_params: 0.254064440727
    th_params: 0.238308504224
    th_params: 0.227238789201
    th_params: 0.202482700348
    th_params: 0.337021172047
    th_params: 0.266793221235
    th_params: 0.288058757782
    th_params: 0.245202198625
    th_params: 0.308074563742
    th_params: 0.28257599473
    th_params: 0.288121134043
    th_params: 0.265965819359
    th_params: 0.208522737026
    th_params: 0.456717759371
    th_params: 0.325302064419
    th_params: 0.195033088326
    th_params: 0.18907661736
    th_params: 0.273174971342
    th_params: 0.261822849512
    th_params: 0.2156329602
    th_params: 0.212928265333
    th_params: 0.24348859489
    th_params: 0.27918985486
    th_params: 0.224076911807
    th_params: 0.32536482811
    th_params: 0.227909371257
    th_params: 0.290639221668
    th_params: 0.225341752172
    th_params: 0.234972327948
    th_params: 0.219077020884
    th_params: 0.225481063128
    th_params: 0.249895200133
    th_params: 0.271194517612
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce"
}
layer {
  name: "inception_3b/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2286.56933594
    th_layer_out: 1933.40246582
    th_params: 0.123693615198
    th_params: 0.14002892375
    th_params: 0.125354200602
    th_params: 0.122174367309
    th_params: 0.163959830999
    th_params: 0.185036867857
    th_params: 0.118640005589
    th_params: 0.210610508919
    th_params: 0.150854691863
    th_params: 0.140244543552
    th_params: 0.123968116939
    th_params: 0.152228295803
    th_params: 0.230622291565
    th_params: 0.129664033651
    th_params: 0.233949795365
    th_params: 0.133504152298
    th_params: 0.33217549324
    th_params: 0.131892472506
    th_params: 0.172755256295
    th_params: 0.132492959499
    th_params: 0.194921284914
    th_params: 0.181391477585
    th_params: 0.126116171479
    th_params: 0.19402064383
    th_params: 0.17264303565
    th_params: 0.111739911139
    th_params: 0.175535514951
    th_params: 0.115817762911
    th_params: 0.156310454011
    th_params: 0.136395335197
    th_params: 0.130040019751
    th_params: 0.157243385911
    th_params: 0.119193404913
    th_params: 0.127602100372
    th_params: 0.117806941271
    th_params: 0.15858027339
    th_params: 0.149124994874
    th_params: 0.14554451406
    th_params: 0.233529850841
    th_params: 0.167686894536
    th_params: 0.28910946846
    th_params: 0.137119576335
    th_params: 0.188150078058
    th_params: 0.128687664866
    th_params: 0.146987885237
    th_params: 0.122430406511
    th_params: 0.124233707786
    th_params: 0.129196614027
    th_params: 0.173669487238
    th_params: 0.160860925913
    th_params: 0.117780946195
    th_params: 0.118658065796
    th_params: 0.133288517594
    th_params: 0.148884534836
    th_params: 0.14082467556
    th_params: 0.140890300274
    th_params: 0.148989900947
    th_params: 0.162456646562
    th_params: 0.161987513304
    th_params: 0.144857987761
    th_params: 0.242334023118
    th_params: 0.11614600569
    th_params: 0.161144554615
    th_params: 0.132501468062
    th_params: 0.143074885011
    th_params: 0.144631594419
    th_params: 0.129368633032
    th_params: 0.124803155661
    th_params: 0.353812038898
    th_params: 0.117817915976
    th_params: 0.142214477062
    th_params: 0.144588321447
    th_params: 0.164226636291
    th_params: 0.220396071672
    th_params: 0.208932116628
    th_params: 0.147962450981
    th_params: 0.116540573537
    th_params: 0.150350943208
    th_params: 0.131419673562
    th_params: 0.131374955177
    th_params: 0.155511915684
    th_params: 0.141239091754
    th_params: 0.142287716269
    th_params: 0.181903406978
    th_params: 0.150683745742
    th_params: 0.123212486506
    th_params: 0.0235940478742
    th_params: 0.173194721341
    th_params: 0.1680598557
    th_params: 0.134234338999
    th_params: 0.164141625166
    th_params: 0.203400373459
    th_params: 0.203416183591
    th_params: 0.159516096115
    th_params: 0.126590579748
    th_params: 0.11336876452
    th_params: 0.218224436045
    th_params: 0.128613948822
    th_params: 0.131135895848
    th_params: 0.135781779885
    th_params: 0.170336395502
    th_params: 0.25028988719
    th_params: 0.268191188574
    th_params: 0.152290806174
    th_params: 0.160037755966
    th_params: 0.126293256879
    th_params: 0.27385571599
    th_params: 0.124431282282
    th_params: 0.211801707745
    th_params: 0.131322771311
    th_params: 0.162523776293
    th_params: 0.115048587322
    th_params: 0.158615320921
    th_params: 0.174671903253
    th_params: 0.14799760282
    th_params: 0.127202004194
    th_params: 0.136175140738
    th_params: 0.148724153638
    th_params: 0.203487470746
    th_params: 0.221825093031
    th_params: 0.160822376609
    th_params: 0.238111391664
    th_params: 0.160899922252
    th_params: 0.1474673599
    th_params: 0.115972258151
    th_params: 0.129585266113
    th_params: 0.14591383934
    th_params: 0.143044516444
    th_params: 0.209309354424
    th_params: 0.206336721778
    th_params: 0.128499224782
    th_params: 0.126866012812
    th_params: 0.165403470397
    th_params: 0.136416181922
    th_params: 0.141225427389
    th_params: 0.179134711623
    th_params: 0.131316840649
    th_params: 0.142332285643
    th_params: 0.12038666755
    th_params: 0.135527834296
    th_params: 0.15515910089
    th_params: 0.124706678092
    th_params: 0.241434276104
    th_params: 0.155954509974
    th_params: 0.122658915818
    th_params: 0.139965832233
    th_params: 0.165197908878
    th_params: 0.136088341475
    th_params: 0.159691736102
    th_params: 0.130489826202
    th_params: 0.185919865966
    th_params: 0.113021574914
    th_params: 0.277253180742
    th_params: 0.127992361784
    th_params: 0.132857248187
    th_params: 0.165579333901
    th_params: 0.15635278821
    th_params: 0.151937931776
    th_params: 0.137911468744
    th_params: 0.128483846784
    th_params: 0.138574942946
    th_params: 0.307284682989
    th_params: 0.125703305006
    th_params: 0.221020489931
    th_params: 0.143180757761
    th_params: 0.140378534794
    th_params: 0.13660158217
    th_params: 0.150144010782
    th_params: 0.129049226642
    th_params: 0.249055087566
    th_params: 0.157664582133
    th_params: 0.165671691298
    th_params: 0.226463213563
    th_params: 0.202418848872
    th_params: 0.0819251611829
    th_params: 0.163572743535
    th_params: 0.182424202561
    th_params: 0.128651455045
    th_params: 0.279729545116
    th_params: 0.119934983552
    th_params: 0.10118625313
    th_params: 0.136598005891
    th_params: 0.190000683069
    th_params: 0.211582675576
    th_params: 0.159131273627
    th_params: 0.15687006712
    th_params: 0.154888242483
    th_params: 0.170277908444
    th_params: 0.1385307163
    th_params: 0.173118904233
    th_params: 0.135316938162
    th_params: 0.13184030354
  }
}
layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3"
}
layer {
  name: "inception_3b/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 3652.62109375
    th_layer_out: 1808.62402344
    th_params: 0.217407926917
    th_params: 0.307353943586
    th_params: 0.203113183379
    th_params: 0.24829672277
    th_params: 0.430320292711
    th_params: 0.381077975035
    th_params: 0.355952203274
    th_params: 0.433732748032
    th_params: 0.267687857151
    th_params: 0.462043702602
    th_params: 0.278357863426
    th_params: 0.325673818588
    th_params: 0.304241627455
    th_params: 0.289801061153
    th_params: 0.374486297369
    th_params: 0.259197384119
    th_params: 0.406603306532
    th_params: 0.269289731979
    th_params: 0.308190494776
    th_params: 0.20331916213
    th_params: 0.266327232122
    th_params: 0.338191449642
    th_params: 0.396743893623
    th_params: 0.293844938278
    th_params: 0.589496314526
    th_params: 0.333949446678
    th_params: 0.410607993603
    th_params: 0.338452607393
    th_params: 0.470353633165
    th_params: 0.44776442647
    th_params: 0.226404905319
    th_params: 0.383818596601
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5_reduce"
}
layer {
  name: "inception_3b/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 1808.62402344
    th_layer_out: 1933.40246582
    th_params: 0.0972209647298
    th_params: 0.139112174511
    th_params: 0.198312774301
    th_params: 0.158156841993
    th_params: 0.161929696798
    th_params: 0.163638144732
    th_params: 0.137105718255
    th_params: 0.168566510081
    th_params: 0.202709585428
    th_params: 0.151264354587
    th_params: 0.0923956111073
    th_params: 0.139310374856
    th_params: 0.235741168261
    th_params: 0.149448797107
    th_params: 0.183466598392
    th_params: 0.208662346005
    th_params: 0.129349291325
    th_params: 0.152602806687
    th_params: 0.19901829958
    th_params: 0.181080281734
    th_params: 0.215115338564
    th_params: 0.166071906686
    th_params: 0.155890733004
    th_params: 0.124465510249
    th_params: 0.196412399411
    th_params: 0.17903329432
    th_params: 0.186493009329
    th_params: 0.121039532125
    th_params: 0.15923961997
    th_params: 0.206784203649
    th_params: 0.172540307045
    th_params: 0.162727728486
    th_params: 0.207167237997
    th_params: 0.1411152035
    th_params: 0.22836959362
    th_params: 0.135603249073
    th_params: 0.287272155285
    th_params: 0.121981605887
    th_params: 0.107567645609
    th_params: 0.11399435252
    th_params: 0.150541618466
    th_params: 0.141825959086
    th_params: 0.142869204283
    th_params: 0.200743019581
    th_params: 0.283302754164
    th_params: 0.176659986377
    th_params: 0.186550632119
    th_params: 0.199524492025
    th_params: 0.091182269156
    th_params: 0.145266368985
    th_params: 0.198183909059
    th_params: 0.131749466062
    th_params: 0.192672356963
    th_params: 0.107224613428
    th_params: 0.155866995454
    th_params: 0.3319003582
    th_params: 0.20360994339
    th_params: 0.178782105446
    th_params: 0.120865352452
    th_params: 0.12252740562
    th_params: 0.168106675148
    th_params: 0.160746410489
    th_params: 0.191016584635
    th_params: 0.11694548279
    th_params: 0.194314196706
    th_params: 0.158094376326
    th_params: 0.131184250116
    th_params: 0.11102540791
    th_params: 0.144066333771
    th_params: 0.176785483956
    th_params: 0.106894083321
    th_params: 0.149314150214
    th_params: 0.174475640059
    th_params: 0.136556372046
    th_params: 0.122785486281
    th_params: 0.131290435791
    th_params: 0.136571019888
    th_params: 0.126146242023
    th_params: 0.117874920368
    th_params: 0.191967323422
    th_params: 0.1688926965
    th_params: 0.137978956103
    th_params: 0.119723491371
    th_params: 0.253345310688
    th_params: 0.183349251747
    th_params: 0.128684818745
    th_params: 0.152240782976
    th_params: 0.143570527434
    th_params: 0.198942348361
    th_params: 0.0951244905591
    th_params: 0.142451897264
    th_params: 0.149840816855
    th_params: 0.120442390442
    th_params: 0.182463228703
    th_params: 0.197049632668
    th_params: 0.180828943849
  }
}
layer {
  name: "inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inception_3b/5x5"
  top: "inception_3b/5x5"
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 3652.62109375
    th_layer_out: 3652.62109375
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
