name: "GoogleNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/flowers102/flowers102_train_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 8
    th_layer_out: 150.768920898
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/flowers102/flowers102_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1/7x7_s2"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1/7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 150.768920898
    th_layer_out: 1102.86181641
    th_params: 0.459329068661
    th_params: 0.356215029955
    th_params: 0.723859429359
    th_params: 0.433509975672
    th_params: 0.44082352519
    th_params: 0.620970726013
    th_params: 0.892854571342
    th_params: 0.816993534565
    th_params: 0.564257323742
    th_params: 0.396364212036
    th_params: 0.375040948391
    th_params: 0.521567940712
    th_params: 0.518595039845
    th_params: 0.75418561697
    th_params: 1.01253151894
    th_params: 0.675251960754
    th_params: 0.39669290185
    th_params: 0.932351648808
    th_params: 0.718306839466
    th_params: 0.930295407772
    th_params: 0.34011310339
    th_params: 0.93374568224
    th_params: 0.539655983448
    th_params: 1.08027768135
    th_params: 0.40534606576
    th_params: 0.598076045513
    th_params: 0.455457031727
    th_params: 0.652795791626
    th_params: 0.751915693283
    th_params: 0.809788703918
    th_params: 0.459644109011
    th_params: 0.567557692528
    th_params: 0.612848043442
    th_params: 0.417819499969
    th_params: 0.537928938866
    th_params: 0.779301166534
    th_params: 0.610992431641
    th_params: 0.487962305546
    th_params: 0.675528347492
    th_params: 0.881687045097
    th_params: 0.312426000834
    th_params: 0.387536525726
    th_params: 0.326217353344
    th_params: 0.786510705948
    th_params: 0.55366396904
    th_params: 0.800514578819
    th_params: 0.347880095243
    th_params: 0.391617000103
    th_params: 0.368920743465
    th_params: 0.586854040623
    th_params: 0.358025997877
    th_params: 0.330239593983
    th_params: 0.419878184795
    th_params: 0.532276630402
    th_params: 0.634844005108
    th_params: 0.365978091955
    th_params: 0.490961760283
    th_params: 0.922282338142
    th_params: 0.831529200077
    th_params: 0.295328348875
    th_params: 0.311239898205
    th_params: 0.634228825569
    th_params: 0.414426803589
    th_params: 0.500525593758
  }
}
layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1/7x7_s2"
  top: "conv1/7x7_s2"
}
layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 1102.86181641
    th_layer_out: 1102.86181641
  }
}
layer {
  name: "conv2/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool1/3x3_s2"
  top: "conv2/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1102.86181641
    th_layer_out: 1231.5592041
    th_params: 0.600445747375
    th_params: 0.560438871384
    th_params: 0.700850784779
    th_params: 0.774303853512
    th_params: 0.584550261497
    th_params: 0.478604257107
    th_params: 0.385704189539
    th_params: 0.766400456429
    th_params: 0.722719430923
    th_params: 0.628178775311
    th_params: 0.34606179595
    th_params: 0.557738780975
    th_params: 0.759770989418
    th_params: 0.447446644306
    th_params: 0.486947596073
    th_params: 0.501291036606
    th_params: 0.683877170086
    th_params: 0.509807050228
    th_params: 0.520771145821
    th_params: 0.346542805433
    th_params: 0.507158100605
    th_params: 0.78146892786
    th_params: 0.547750234604
    th_params: 0.461312294006
    th_params: 0.594139873981
    th_params: 0.624761223793
    th_params: 0.382092773914
    th_params: 0.475660473108
    th_params: 0.462637126446
    th_params: 0.989171087742
    th_params: 0.463673532009
    th_params: 0.667627811432
    th_params: 0.622922241688
    th_params: 0.522570371628
    th_params: 0.344208598137
    th_params: 0.639573931694
    th_params: 0.457635521889
    th_params: 0.805595040321
    th_params: 0.405744075775
    th_params: 0.526220262051
    th_params: 0.460988163948
    th_params: 0.487469613552
    th_params: 0.557132422924
    th_params: 0.427889227867
    th_params: 0.731642723083
    th_params: 0.453436225653
    th_params: 0.599627315998
    th_params: 0.666680753231
    th_params: 0.803353667259
    th_params: 0.762704789639
    th_params: 0.46484079957
    th_params: 0.396552979946
    th_params: 0.387347340584
    th_params: 0.676438748837
    th_params: 0.765744328499
    th_params: 0.531513273716
    th_params: 0.484666973352
    th_params: 0.4412573874
    th_params: 0.877951204777
    th_params: 0.474721610546
    th_params: 0.528134465218
    th_params: 0.381582379341
    th_params: 0.399269282818
    th_params: 0.505719423294
  }
}
layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_reduce"
}
layer {
  name: "conv2/3x3"
  type: "ConvolutionRistretto"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1231.5592041
    th_layer_out: 1545.32531738
    th_params: 0.262454837561
    th_params: 0.343043237925
    th_params: 0.196767419577
    th_params: 0.24130359292
    th_params: 0.264921873808
    th_params: 0.185390219092
    th_params: 0.273725479841
    th_params: 0.205207258463
    th_params: 0.322239935398
    th_params: 0.206743821502
    th_params: 0.395490795374
    th_params: 0.161985561252
    th_params: 0.168537423015
    th_params: 0.673671722412
    th_params: 0.228974089026
    th_params: 0.20409616828
    th_params: 0.273901224136
    th_params: 0.22433654964
    th_params: 0.1839851439
    th_params: 0.228116199374
    th_params: 0.316996604204
    th_params: 0.228509753942
    th_params: 0.203970998526
    th_params: 0.172011002898
    th_params: 0.214684665203
    th_params: 0.167808994651
    th_params: 0.698868632317
    th_params: 0.169119656086
    th_params: 0.166799128056
    th_params: 0.565754294395
    th_params: 0.16742631793
    th_params: 0.158341467381
    th_params: 0.180734798312
    th_params: 0.473803132772
    th_params: 0.309688985348
    th_params: 0.675923764706
    th_params: 0.213937327266
    th_params: 0.457842260599
    th_params: 0.315873354673
    th_params: 0.177061721683
    th_params: 0.240676447749
    th_params: 0.190506026149
    th_params: 0.164992257953
    th_params: 0.194248333573
    th_params: 0.169763892889
    th_params: 0.186093389988
    th_params: 0.435554236174
    th_params: 0.387647867203
    th_params: 0.473294138908
    th_params: 0.228480905294
    th_params: 0.289220482111
    th_params: 0.356466621161
    th_params: 0.220343649387
    th_params: 0.26759237051
    th_params: 0.252684623003
    th_params: 0.2528193295
    th_params: 0.270383924246
    th_params: 0.169720619917
    th_params: 0.176126524806
    th_params: 0.211820095778
    th_params: 0.186954304576
    th_params: 0.359065651894
    th_params: 0.129870638251
    th_params: 0.211233720183
    th_params: 0.228306591511
    th_params: 0.280320227146
    th_params: 0.196757361293
    th_params: 0.171890556812
    th_params: 0.240403920412
    th_params: 0.181704878807
    th_params: 0.321950763464
    th_params: 0.279193848372
    th_params: 0.258340418339
    th_params: 0.3809273839
    th_params: 0.196534320712
    th_params: 0.200209155679
    th_params: 0.218982949853
    th_params: 0.248586714268
    th_params: 0.209727481008
    th_params: 0.170577526093
    th_params: 0.28036916256
    th_params: 0.167197331786
    th_params: 0.28127259016
    th_params: 0.293544441462
    th_params: 0.247248634696
    th_params: 0.264684319496
    th_params: 0.171515718102
    th_params: 0.245247781277
    th_params: 0.309690803289
    th_params: 0.160325467587
    th_params: 0.185923069715
    th_params: 0.189050972462
    th_params: 0.463218301535
    th_params: 0.161217451096
    th_params: 0.192418366671
    th_params: 0.187056258321
    th_params: 0.250527858734
    th_params: 0.21539388597
    th_params: 0.337687641382
    th_params: 0.244644284248
    th_params: 0.303114324808
    th_params: 0.236590445042
    th_params: 0.309626311064
    th_params: 0.304819762707
    th_params: 0.255931168795
    th_params: 0.270018011332
    th_params: 0.244606226683
    th_params: 0.171897113323
    th_params: 0.324790000916
    th_params: 0.225195482373
    th_params: 0.427459716797
    th_params: 0.232676908374
    th_params: 0.209115475416
    th_params: 0.131176531315
    th_params: 0.164073050022
    th_params: 0.209327578545
    th_params: 0.234015345573
    th_params: 0.230354622006
    th_params: 0.351059317589
    th_params: 0.338822603226
    th_params: 0.188650131226
    th_params: 0.265989363194
    th_params: 0.287765055895
    th_params: 0.201984286308
    th_params: 0.257256001234
    th_params: 0.29764777422
    th_params: 0.185279637575
    th_params: 0.189957752824
    th_params: 0.155670255423
    th_params: 0.315999567509
    th_params: 0.64391887188
    th_params: 0.250446766615
    th_params: 0.332862347364
    th_params: 0.207431554794
    th_params: 0.323766320944
    th_params: 0.224912881851
    th_params: 0.177672713995
    th_params: 0.315533101559
    th_params: 0.240127265453
    th_params: 0.149872496724
    th_params: 0.41452807188
    th_params: 0.297490596771
    th_params: 0.276403129101
    th_params: 0.283714950085
    th_params: 0.184553384781
    th_params: 0.250857919455
    th_params: 0.292140454054
    th_params: 0.299352407455
    th_params: 0.200856611133
    th_params: 0.15332134068
    th_params: 0.32563444972
    th_params: 0.226148247719
    th_params: 0.180371463299
    th_params: 0.189342796803
    th_params: 0.22104793787
    th_params: 0.301845371723
    th_params: 0.234316915274
    th_params: 0.157754167914
    th_params: 0.201303288341
    th_params: 0.17142598331
    th_params: 0.358542054892
    th_params: 0.412336289883
    th_params: 0.187554314733
    th_params: 0.25781801343
    th_params: 0.197075501084
    th_params: 0.174325227737
    th_params: 0.168771922588
    th_params: 0.211666300893
    th_params: 0.267799019814
    th_params: 0.188618183136
    th_params: 0.183062314987
    th_params: 0.46422675252
    th_params: 0.30148422718
    th_params: 0.40775975585
    th_params: 0.23713222146
    th_params: 0.238027065992
    th_params: 0.201369717717
    th_params: 0.262466013432
    th_params: 0.196751281619
    th_params: 0.472232967615
    th_params: 0.198245286942
    th_params: 0.207425102592
    th_params: 0.18082267046
    th_params: 0.19716578722
    th_params: 0.279993951321
    th_params: 0.276382446289
    th_params: 0.213675662875
    th_params: 0.200559049845
    th_params: 0.229326069355
    th_params: 0.244142279029
    th_params: 0.198361098766
    th_params: 0.361122369766
  }
}
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3"
  top: "conv2/3x3"
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/3x3"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 1545.32531738
    th_layer_out: 1545.32531738
  }
}
layer {
  name: "inception_3a/1x1"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1545.32531738
    th_layer_out: 2391.07519531
    th_params: 0.408767461777
    th_params: 0.552505612373
    th_params: 0.386278808117
    th_params: 0.356426000595
    th_params: 0.286581903696
    th_params: 0.617882668972
    th_params: 0.437124252319
    th_params: 0.673938751221
    th_params: 0.4311606884
    th_params: 0.537004888058
    th_params: 0.716390907764
    th_params: 0.327754914761
    th_params: 0.733287751675
    th_params: 0.464314460754
    th_params: 0.309387177229
    th_params: 0.27892562747
    th_params: 0.283362358809
    th_params: 0.309779316187
    th_params: 0.29992967844
    th_params: 0.48068100214
    th_params: 0.404225736856
    th_params: 0.523157477379
    th_params: 0.616201400757
    th_params: 0.703012943268
    th_params: 0.351233690977
    th_params: 0.412243694067
    th_params: 0.298462003469
    th_params: 0.600976526737
    th_params: 0.374659657478
    th_params: 0.671589076519
    th_params: 0.696096241474
    th_params: 0.430522948503
    th_params: 0.308243483305
    th_params: 0.338102579117
    th_params: 0.358913987875
    th_params: 0.400507360697
    th_params: 0.391710788012
    th_params: 0.409228771925
    th_params: 0.417221456766
    th_params: 0.287199378014
    th_params: 0.956826210022
    th_params: 0.437881976366
    th_params: 0.393775731325
    th_params: 0.262476831675
    th_params: 0.843051552773
    th_params: 0.332678616047
    th_params: 0.376901805401
    th_params: 0.26619374752
    th_params: 0.653691530228
    th_params: 0.795251309872
    th_params: 0.496338278055
    th_params: 0.620057761669
    th_params: 0.280304431915
    th_params: 0.361509621143
    th_params: 0.439900845289
    th_params: 0.692701935768
    th_params: 0.812389492989
    th_params: 0.81139934063
    th_params: 0.319785833359
    th_params: 0.657487869263
    th_params: 0.328296840191
    th_params: 0.754214882851
    th_params: 0.332979440689
    th_params: 0.995936572552
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1"
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1545.32531738
    th_layer_out: 1693.26953125
    th_params: 0.28844538331
    th_params: 0.432389467955
    th_params: 0.353068113327
    th_params: 0.270794928074
    th_params: 0.382576465607
    th_params: 0.551835238934
    th_params: 0.349474549294
    th_params: 0.654843330383
    th_params: 0.313395023346
    th_params: 0.220560610294
    th_params: 0.685444116592
    th_params: 0.412402123213
    th_params: 0.761442601681
    th_params: 0.254864037037
    th_params: 0.467308044434
    th_params: 0.272863030434
    th_params: 0.488521814346
    th_params: 0.48635700345
    th_params: 0.323256611824
    th_params: 0.35180196166
    th_params: 0.303694665432
    th_params: 0.19447787106
    th_params: 0.227644503117
    th_params: 0.38852545619
    th_params: 0.438935518265
    th_params: 0.292865991592
    th_params: 0.372427135706
    th_params: 0.266985356808
    th_params: 0.285246998072
    th_params: 0.292999744415
    th_params: 0.301680505276
    th_params: 0.39869388938
    th_params: 0.42549186945
    th_params: 0.370892554522
    th_params: 0.505081951618
    th_params: 0.307006090879
    th_params: 0.421977043152
    th_params: 0.25808596611
    th_params: 0.334823966026
    th_params: 0.468278825283
    th_params: 0.415632635355
    th_params: 0.729382991791
    th_params: 0.301912039518
    th_params: 0.417197346687
    th_params: 0.326700776815
    th_params: 0.321362555027
    th_params: 0.27464145422
    th_params: 0.409222066402
    th_params: 0.531792104244
    th_params: 0.304533272982
    th_params: 0.339468479156
    th_params: 0.286283373833
    th_params: 0.360729306936
    th_params: 0.23417429626
    th_params: 0.309714406729
    th_params: 0.247698143125
    th_params: 0.227510526776
    th_params: 0.222263261676
    th_params: 0.37580126524
    th_params: 0.40384349227
    th_params: 0.250535160303
    th_params: 0.332752108574
    th_params: 0.366175413132
    th_params: 0.241994470358
    th_params: 0.561407327652
    th_params: 0.31822681427
    th_params: 0.61786365509
    th_params: 0.360084831715
    th_params: 0.256140172482
    th_params: 0.291577458382
    th_params: 0.345774173737
    th_params: 0.604726493359
    th_params: 0.407938629389
    th_params: 0.367227166891
    th_params: 0.420988827944
    th_params: 0.409167379141
    th_params: 0.357023447752
    th_params: 0.528413176537
    th_params: 0.43694871664
    th_params: 0.474892765284
    th_params: 0.369026839733
    th_params: 0.485489457846
    th_params: 0.442223131657
    th_params: 0.37632727623
    th_params: 0.211746528745
    th_params: 0.357054829597
    th_params: 0.43944093585
    th_params: 0.235117077827
    th_params: 1.43211245537
    th_params: 0.316337376833
    th_params: 0.416662752628
    th_params: 0.319027274847
    th_params: 0.63272690773
    th_params: 0.441739022732
    th_params: 0.339876919985
    th_params: 0.349122643471
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce"
}
layer {
  name: "inception_3a/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1693.26953125
    th_layer_out: 2391.07519531
    th_params: 0.361458599567
    th_params: 0.186273157597
    th_params: 0.187348023057
    th_params: 0.160666644573
    th_params: 0.281682103872
    th_params: 0.344660639763
    th_params: 0.131827697158
    th_params: 0.189053803682
    th_params: 0.187739446759
    th_params: 0.170966044068
    th_params: 0.137417688966
    th_params: 0.175605401397
    th_params: 0.288228183985
    th_params: 0.153789699078
    th_params: 0.171771511436
    th_params: 0.186121255159
    th_params: 0.194284796715
    th_params: 0.16437959671
    th_params: 0.418728470802
    th_params: 0.473365813494
    th_params: 0.222768291831
    th_params: 0.261533081532
    th_params: 0.143993794918
    th_params: 0.226614788175
    th_params: 0.39848408103
    th_params: 0.243039771914
    th_params: 0.255644053221
    th_params: 0.174265578389
    th_params: 0.259628117085
    th_params: 0.155700579286
    th_params: 0.362113326788
    th_params: 0.164972126484
    th_params: 0.19090923667
    th_params: 0.18971966207
    th_params: 0.253234684467
    th_params: 0.181282967329
    th_params: 0.130377814174
    th_params: 0.146254554391
    th_params: 0.240093931556
    th_params: 0.206837132573
    th_params: 0.209916472435
    th_params: 0.21947953105
    th_params: 0.22611284256
    th_params: 0.480382233858
    th_params: 0.247482657433
    th_params: 0.298953980207
    th_params: 0.242345750332
    th_params: 0.150697737932
    th_params: 0.285000473261
    th_params: 0.271595329046
    th_params: 0.308543771505
    th_params: 0.28708922863
    th_params: 0.25842872262
    th_params: 0.193776786327
    th_params: 0.229440808296
    th_params: 0.172097057104
    th_params: 0.145379900932
    th_params: 0.222302526236
    th_params: 0.183319970965
    th_params: 0.207960814238
    th_params: 0.15679359436
    th_params: 0.197245255113
    th_params: 0.17298334837
    th_params: 0.1531278193
    th_params: 0.205762699246
    th_params: 0.1602024436
    th_params: 0.26777908206
    th_params: 0.210163250566
    th_params: 0.155703112483
    th_params: 0.150773212314
    th_params: 0.317056655884
    th_params: 0.231851443648
    th_params: 0.160846859217
    th_params: 0.210559219122
    th_params: 0.302515864372
    th_params: 0.137793809175
    th_params: 0.342353850603
    th_params: 0.155306890607
    th_params: 0.180100545287
    th_params: 0.230893492699
    th_params: 0.158115103841
    th_params: 0.151335626841
    th_params: 0.149105086923
    th_params: 0.305183649063
    th_params: 0.311120420694
    th_params: 0.256657093763
    th_params: 0.337662667036
    th_params: 0.148537531495
    th_params: 0.214492976665
    th_params: 0.146847099066
    th_params: 0.206561401486
    th_params: 0.170760214329
    th_params: 0.171857520938
    th_params: 0.50017118454
    th_params: 0.217586576939
    th_params: 0.30509018898
    th_params: 0.157708272338
    th_params: 0.152747839689
    th_params: 0.167026147246
    th_params: 0.230013296008
    th_params: 0.317602515221
    th_params: 0.183701053262
    th_params: 0.286735981703
    th_params: 0.299549013376
    th_params: 0.198019400239
    th_params: 0.203188583255
    th_params: 0.114942103624
    th_params: 0.303251892328
    th_params: 0.301984131336
    th_params: 0.38736140728
    th_params: 0.201343253255
    th_params: 0.148902833462
    th_params: 0.183271348476
    th_params: 0.162945821881
    th_params: 0.271339833736
    th_params: 0.154328927398
    th_params: 0.25096976757
    th_params: 0.217908248305
    th_params: 0.179615318775
    th_params: 0.23596714437
    th_params: 0.210510492325
    th_params: 0.165452331305
    th_params: 0.401892244816
    th_params: 0.155045151711
    th_params: 0.311447054148
    th_params: 0.246824935079
    th_params: 0.155601426959
    th_params: 0.201144367456
  }
}
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3"
}
layer {
  name: "inception_3a/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1545.32531738
    th_layer_out: 2088.34912109
    th_params: 0.498234957457
    th_params: 0.275636523962
    th_params: 0.482384324074
    th_params: 0.309786170721
    th_params: 0.449893832207
    th_params: 0.372141957283
    th_params: 0.36210912466
    th_params: 0.635084450245
    th_params: 0.603427052498
    th_params: 0.262215107679
    th_params: 0.308094829321
    th_params: 0.501849532127
    th_params: 0.479129821062
    th_params: 0.382155179977
    th_params: 0.713500082493
    th_params: 0.37992554903
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5_reduce"
}
layer {
  name: "inception_3a/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2088.34912109
    th_layer_out: 2391.07519531
    th_params: 0.169041544199
    th_params: 0.183674782515
    th_params: 0.201771274209
    th_params: 0.29038348794
    th_params: 0.207355469465
    th_params: 0.315539479256
    th_params: 0.394615530968
    th_params: 0.302892684937
    th_params: 0.262074351311
    th_params: 0.193377122283
    th_params: 0.380163341761
    th_params: 0.166042014956
    th_params: 0.198765680194
    th_params: 0.387660294771
    th_params: 0.14159463346
    th_params: 0.338053286076
    th_params: 0.255958229303
    th_params: 0.315559953451
    th_params: 0.306458950043
    th_params: 0.257217437029
    th_params: 0.273672550917
    th_params: 0.306969583035
    th_params: 0.214192330837
    th_params: 0.145733505487
    th_params: 0.277223914862
    th_params: 0.163010120392
    th_params: 0.249037459493
    th_params: 0.474975168705
    th_params: 0.241588905454
    th_params: 0.328697770834
    th_params: 0.299465924501
    th_params: 0.402515202761
  }
}
layer {
  name: "inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inception_3a/5x5"
  top: "inception_3a/5x5"
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 1545.32531738
    th_layer_out: 1545.32531738
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1545.32531738
    th_layer_out: 2391.07519531
    th_params: 0.363136559725
    th_params: 0.269080132246
    th_params: 0.326464563608
    th_params: 0.302817463875
    th_params: 0.285834163427
    th_params: 0.23243150115
    th_params: 0.304460048676
    th_params: 0.38261026144
    th_params: 0.315096914768
    th_params: 0.260799974203
    th_params: 0.397740095854
    th_params: 0.324962973595
    th_params: 0.295128822327
    th_params: 0.302996218204
    th_params: 0.380235165358
    th_params: 0.298258841038
    th_params: 0.343935936689
    th_params: 0.22242064774
    th_params: 0.384916931391
    th_params: 0.316119223833
    th_params: 0.250820606947
    th_params: 0.247546434402
    th_params: 0.551721572876
    th_params: 0.30016592145
    th_params: 0.34115216136
    th_params: 0.353884965181
    th_params: 0.332301467657
    th_params: 0.800598919392
    th_params: 0.32188475132
    th_params: 0.493677049875
    th_params: 0.258100181818
    th_params: 0.315700918436
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj"
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1"
  bottom: "inception_3a/3x3"
  bottom: "inception_3a/5x5"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/output"
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 2391.07519531
    th_layer_out: 2391.07519531
  }
}
layer {
  name: "inception_3b/1x1"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2391.07519531
    th_layer_out: 1845.82885742
    th_params: 0.261385113001
    th_params: 0.228424891829
    th_params: 0.231344521046
    th_params: 0.386945933104
    th_params: 0.546705126762
    th_params: 0.201488986611
    th_params: 0.457188248634
    th_params: 0.234263896942
    th_params: 0.534166932106
    th_params: 0.467712104321
    th_params: 0.245402112603
    th_params: 0.230311736465
    th_params: 0.595594227314
    th_params: 0.466436505318
    th_params: 0.219283282757
    th_params: 0.343857169151
    th_params: 0.488220393658
    th_params: 0.283790051937
    th_params: 0.195783615112
    th_params: 0.308151453733
    th_params: 0.382343053818
    th_params: 0.507192313671
    th_params: 0.174502328038
    th_params: 0.25161242485
    th_params: 0.476721048355
    th_params: 0.265115886927
    th_params: 0.342453569174
    th_params: 0.256908893585
    th_params: 0.246997952461
    th_params: 0.281337350607
    th_params: 0.408839553595
    th_params: 0.314520359039
    th_params: 0.203910425305
    th_params: 0.567362904549
    th_params: 0.278903126717
    th_params: 0.278855651617
    th_params: 0.193066716194
    th_params: 0.296946614981
    th_params: 0.375334739685
    th_params: 0.212623640895
    th_params: 0.525454819202
    th_params: 0.224290415645
    th_params: 0.349141061306
    th_params: 0.222994998097
    th_params: 0.314089238644
    th_params: 0.170713022351
    th_params: 0.462731987238
    th_params: 0.535218536854
    th_params: 0.245807334781
    th_params: 0.325199902058
    th_params: 0.245608687401
    th_params: 0.436490029097
    th_params: 0.20389790833
    th_params: 0.318523526192
    th_params: 0.578949034214
    th_params: 0.600228369236
    th_params: 0.440120637417
    th_params: 0.42131537199
    th_params: 0.375075399876
    th_params: 0.416590720415
    th_params: 0.387055277824
    th_params: 0.404724508524
    th_params: 0.371106296778
    th_params: 0.451055854559
    th_params: 0.197112485766
    th_params: 0.26846987009
    th_params: 0.368082106113
    th_params: 0.318328499794
    th_params: 0.387372851372
    th_params: 0.492399722338
    th_params: 0.264109700918
    th_params: 0.3381267488
    th_params: 0.203988075256
    th_params: 0.316591620445
    th_params: 0.327550202608
    th_params: 0.44750392437
    th_params: 0.259024113417
    th_params: 0.458844155073
    th_params: 0.270206212997
    th_params: 0.576398789883
    th_params: 0.195851281285
    th_params: 0.529827833176
    th_params: 0.231379315257
    th_params: 0.431013792753
    th_params: 0.310343176126
    th_params: 0.606450438499
    th_params: 0.276475101709
    th_params: 0.258665680885
    th_params: 0.239368975163
    th_params: 0.402721881866
    th_params: 0.376096665859
    th_params: 0.201522827148
    th_params: 0.309034466743
    th_params: 0.618379294872
    th_params: 0.360067605972
    th_params: 0.210228964686
    th_params: 0.224297583103
    th_params: 0.258130908012
    th_params: 0.351370036602
    th_params: 0.240372568369
    th_params: 0.252212703228
    th_params: 0.299961179495
    th_params: 0.474733740091
    th_params: 0.305259853601
    th_params: 0.581980168819
    th_params: 0.280661821365
    th_params: 0.195298269391
    th_params: 0.298953831196
    th_params: 0.191025853157
    th_params: 0.39527758956
    th_params: 0.1955768466
    th_params: 0.334408640862
    th_params: 0.325417965651
    th_params: 0.614491343498
    th_params: 0.433395951986
    th_params: 0.250504165888
    th_params: 0.379556715488
    th_params: 0.342685848475
    th_params: 0.220752075315
    th_params: 0.245029300451
    th_params: 0.317203611135
    th_params: 0.407392531633
    th_params: 0.401766061783
    th_params: 0.192604705691
    th_params: 0.273672193289
    th_params: 0.543598413467
    th_params: 0.17128033936
    th_params: 0.537821650505
  }
}
layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1"
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2391.07519531
    th_layer_out: 1724.21691895
    th_params: 0.375770449638
    th_params: 0.279652297497
    th_params: 0.39841362834
    th_params: 0.253504514694
    th_params: 0.239639446139
    th_params: 0.210940793157
    th_params: 0.256486088037
    th_params: 0.196505561471
    th_params: 0.454909384251
    th_params: 0.247659593821
    th_params: 0.353767514229
    th_params: 0.352928757668
    th_params: 0.432813555002
    th_params: 0.300383776426
    th_params: 0.221869334579
    th_params: 0.208891302347
    th_params: 0.224588811398
    th_params: 0.259856194258
    th_params: 0.237105295062
    th_params: 0.48444750905
    th_params: 0.311429440975
    th_params: 0.336519539356
    th_params: 0.243533447385
    th_params: 0.349784165621
    th_params: 0.183673620224
    th_params: 0.218649014831
    th_params: 0.218921273947
    th_params: 0.290481597185
    th_params: 0.370207756758
    th_params: 0.206548973918
    th_params: 0.223797261715
    th_params: 0.386669278145
    th_params: 0.248786449432
    th_params: 0.22120372951
    th_params: 0.370703071356
    th_params: 0.383179485798
    th_params: 0.224884346128
    th_params: 0.217303067446
    th_params: 0.254449814558
    th_params: 0.175861939788
    th_params: 0.453501075506
    th_params: 0.339251190424
    th_params: 0.20776695013
    th_params: 0.161292269826
    th_params: 0.260347872972
    th_params: 0.287912458181
    th_params: 0.542040407658
    th_params: 0.225356176496
    th_params: 0.514187097549
    th_params: 0.223907992244
    th_params: 0.584586560726
    th_params: 0.297898679972
    th_params: 0.511464655399
    th_params: 0.395537108183
    th_params: 0.23705726862
    th_params: 0.295952171087
    th_params: 0.223808720708
    th_params: 0.276728689671
    th_params: 0.266823112965
    th_params: 0.287052750587
    th_params: 0.466321974993
    th_params: 0.30332544446
    th_params: 0.298697203398
    th_params: 0.216389611363
    th_params: 0.200940921903
    th_params: 0.250459849834
    th_params: 0.208001255989
    th_params: 0.227611660957
    th_params: 0.326075583696
    th_params: 0.262576520443
    th_params: 0.324445426464
    th_params: 0.26761212945
    th_params: 0.308639794588
    th_params: 0.320925503969
    th_params: 0.188002377748
    th_params: 0.326045811176
    th_params: 0.213888838887
    th_params: 0.39229953289
    th_params: 0.201029345393
    th_params: 0.217565461993
    th_params: 0.361826002598
    th_params: 0.191416993737
    th_params: 0.603335499763
    th_params: 0.244143947959
    th_params: 0.443642050028
    th_params: 0.215466499329
    th_params: 0.326269507408
    th_params: 0.21345102787
    th_params: 0.256357342005
    th_params: 0.222577497363
    th_params: 0.231350928545
    th_params: 0.264228492975
    th_params: 0.234068706632
    th_params: 0.191078647971
    th_params: 0.240334883332
    th_params: 0.369393587112
    th_params: 0.178132072091
    th_params: 0.281520575285
    th_params: 0.233898177743
    th_params: 0.497521787882
    th_params: 0.245338141918
    th_params: 0.329986512661
    th_params: 0.244512811303
    th_params: 0.255455225706
    th_params: 0.290277451277
    th_params: 0.287821561098
    th_params: 0.218099802732
    th_params: 0.329619526863
    th_params: 0.253547668457
    th_params: 0.247781947255
    th_params: 0.390478044748
    th_params: 0.276219397783
    th_params: 0.24911788106
    th_params: 0.234849840403
    th_params: 0.38154348731
    th_params: 0.419526785612
    th_params: 0.34814119339
    th_params: 0.192656978965
    th_params: 0.191409066319
    th_params: 0.285769164562
    th_params: 0.28191909194
    th_params: 0.181250959635
    th_params: 0.206368640065
    th_params: 0.293628424406
    th_params: 0.321775257587
    th_params: 0.220772117376
    th_params: 0.408273845911
    th_params: 0.260866701603
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce"
}
layer {
  name: "inception_3b/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1724.21691895
    th_layer_out: 1845.82885742
    th_params: 0.254802852869
    th_params: 0.201205119491
    th_params: 0.134734258056
    th_params: 0.194514632225
    th_params: 0.18279722333
    th_params: 0.242578402162
    th_params: 0.130246058106
    th_params: 0.1146081388
    th_params: 0.159815788269
    th_params: 0.133970037103
    th_params: 0.136773467064
    th_params: 0.22280664742
    th_params: 0.157252937555
    th_params: 0.16896353662
    th_params: 0.114229165018
    th_params: 0.161017939448
    th_params: 0.153355702758
    th_params: 0.109924636781
    th_params: 0.0968658700585
    th_params: 0.188394069672
    th_params: 0.148915693164
    th_params: 0.130267158151
    th_params: 0.143159925938
    th_params: 0.141630962491
    th_params: 0.207717746496
    th_params: 0.125402450562
    th_params: 0.328026682138
    th_params: 0.120852947235
    th_params: 0.549924612045
    th_params: 0.151097670197
    th_params: 0.123340837657
    th_params: 0.15045812726
    th_params: 0.14546084404
    th_params: 0.171719774604
    th_params: 0.141011431813
    th_params: 0.125678747892
    th_params: 0.119598150253
    th_params: 0.210985869169
    th_params: 0.119665563107
    th_params: 0.170336320996
    th_params: 0.259551078081
    th_params: 0.11665237695
    th_params: 0.129997447133
    th_params: 0.220631301403
    th_params: 0.149722978473
    th_params: 0.0912069305778
    th_params: 0.201401725411
    th_params: 0.128978148103
    th_params: 0.156749203801
    th_params: 0.204181015491
    th_params: 0.11088848114
    th_params: 0.341511845589
    th_params: 0.107597962022
    th_params: 0.102778501809
    th_params: 0.122009314597
    th_params: 0.103833779693
    th_params: 0.119964040816
    th_params: 0.212983459234
    th_params: 0.0989326387644
    th_params: 0.140044376254
    th_params: 0.121177919209
    th_params: 0.132770344615
    th_params: 0.217481896281
    th_params: 0.109032534063
    th_params: 0.150283187628
    th_params: 0.102848231792
    th_params: 0.109458521008
    th_params: 0.203902795911
    th_params: 0.134736761451
    th_params: 0.119899153709
    th_params: 0.117717377841
    th_params: 0.124327152967
    th_params: 0.122368052602
    th_params: 0.167800351977
    th_params: 0.164619401097
    th_params: 0.216611564159
    th_params: 0.138790532947
    th_params: 0.214986741543
    th_params: 0.129353448749
    th_params: 0.177356243134
    th_params: 0.114778615534
    th_params: 0.148774206638
    th_params: 0.142468169332
    th_params: 0.157207459211
    th_params: 0.166734412313
    th_params: 0.110837429762
    th_params: 0.114173591137
    th_params: 0.149202078581
    th_params: 0.270249545574
    th_params: 0.165798872709
    th_params: 0.13373875618
    th_params: 0.141714930534
    th_params: 0.118247322738
    th_params: 0.300150871277
    th_params: 0.151637360454
    th_params: 0.13011136651
    th_params: 0.129409149289
    th_params: 0.185812368989
    th_params: 0.112952925265
    th_params: 0.177605390549
    th_params: 0.153015479445
    th_params: 0.197219923139
    th_params: 0.12748926878
    th_params: 0.126300856471
    th_params: 0.213928461075
    th_params: 0.14317548275
    th_params: 0.172094479203
    th_params: 0.204979985952
    th_params: 0.140530660748
    th_params: 0.294360071421
    th_params: 0.156081572175
    th_params: 0.123447693884
    th_params: 0.139765962958
    th_params: 0.150034606457
    th_params: 0.233275100589
    th_params: 0.146514102817
    th_params: 0.111458681524
    th_params: 0.0960205122828
    th_params: 0.179173395038
    th_params: 0.143101930618
    th_params: 0.120811097324
    th_params: 0.208826139569
    th_params: 0.098472699523
    th_params: 0.11834154278
    th_params: 0.129308983684
    th_params: 0.18916657567
    th_params: 0.129796221852
    th_params: 0.146326303482
    th_params: 0.252355337143
    th_params: 0.218797445297
    th_params: 0.122452840209
    th_params: 0.190067827702
    th_params: 0.124433547258
    th_params: 0.0921451076865
    th_params: 0.169181898236
    th_params: 0.108436241746
    th_params: 0.115861527622
    th_params: 0.108900681138
    th_params: 0.21543571353
    th_params: 0.172922804952
    th_params: 0.183159694076
    th_params: 0.265691518784
    th_params: 0.120299875736
    th_params: 0.158861324191
    th_params: 0.147636443377
    th_params: 0.155678614974
    th_params: 0.111055716872
    th_params: 0.136220693588
    th_params: 0.116298854351
    th_params: 0.158841818571
    th_params: 0.135000064969
    th_params: 0.181407421827
    th_params: 0.168295279145
    th_params: 0.141655161977
    th_params: 0.103955924511
    th_params: 0.120607949793
    th_params: 0.158891484141
    th_params: 0.213036775589
    th_params: 0.113040313125
    th_params: 0.161207556725
    th_params: 0.155646666884
    th_params: 0.187246114016
    th_params: 0.151809513569
    th_params: 0.110977180302
    th_params: 0.119285151362
    th_params: 0.129761278629
    th_params: 0.125219076872
    th_params: 0.31510040164
    th_params: 0.124457754195
    th_params: 0.104578122497
    th_params: 0.127563998103
    th_params: 0.140510126948
    th_params: 0.16157656908
    th_params: 0.191676095128
    th_params: 0.146545171738
    th_params: 0.111982613802
    th_params: 0.1113364622
    th_params: 0.137518659234
    th_params: 0.115425378084
    th_params: 0.155970826745
    th_params: 0.170769050717
    th_params: 0.110539600253
    th_params: 0.159913748503
    th_params: 0.126405283809
    th_params: 0.134743601084
    th_params: 0.223051816225
    th_params: 0.101052246988
    th_params: 0.106739014387
    th_params: 0.115560643375
    th_params: 0.298627793789
    th_params: 0.167716637254
    th_params: 0.193397894502
  }
}
layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3"
}
layer {
  name: "inception_3b/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2391.07519531
    th_layer_out: 1961.97436523
    th_params: 0.354899287224
    th_params: 0.347647130489
    th_params: 0.262882083654
    th_params: 0.328799545765
    th_params: 0.239774152637
    th_params: 0.229435727
    th_params: 0.37174808979
    th_params: 0.333271950483
    th_params: 0.272227853537
    th_params: 0.254038929939
    th_params: 0.531784415245
    th_params: 0.447277337313
    th_params: 0.452574849129
    th_params: 0.513331711292
    th_params: 0.270126223564
    th_params: 0.282481819391
    th_params: 0.451007723808
    th_params: 0.370786398649
    th_params: 0.37055182457
    th_params: 0.38535913825
    th_params: 0.450925797224
    th_params: 0.250845551491
    th_params: 0.227387025952
    th_params: 0.31359282136
    th_params: 0.36451241374
    th_params: 0.245253056288
    th_params: 0.242304205894
    th_params: 0.40992423892
    th_params: 0.492253005505
    th_params: 0.586332559586
    th_params: 0.406669557095
    th_params: 0.228031858802
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5_reduce"
}
layer {
  name: "inception_3b/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1961.97436523
    th_layer_out: 1845.82885742
    th_params: 0.160275056958
    th_params: 0.204788938165
    th_params: 0.282701730728
    th_params: 0.133216410875
    th_params: 0.254946500063
    th_params: 0.112008333206
    th_params: 0.254068017006
    th_params: 0.178059175611
    th_params: 0.13207963109
    th_params: 0.324612230062
    th_params: 0.257393181324
    th_params: 0.110471360385
    th_params: 0.112320356071
    th_params: 0.181137517095
    th_params: 0.236992001534
    th_params: 0.201685518026
    th_params: 0.164507970214
    th_params: 0.217716947198
    th_params: 0.139604300261
    th_params: 0.183120250702
    th_params: 0.13600692153
    th_params: 0.113232791424
    th_params: 0.215732350945
    th_params: 0.1078209728
    th_params: 0.133273884654
    th_params: 0.121324501932
    th_params: 0.190637260675
    th_params: 0.215618476272
    th_params: 0.139654994011
    th_params: 0.1137862131
    th_params: 0.0873972997069
    th_params: 0.118556112051
    th_params: 0.178253054619
    th_params: 0.105070799589
    th_params: 0.211642533541
    th_params: 0.215079471469
    th_params: 0.090209312737
    th_params: 0.159733310342
    th_params: 0.204825460911
    th_params: 0.093124859035
    th_params: 0.135158732533
    th_params: 0.160002812743
    th_params: 0.109827615321
    th_params: 0.154803410172
    th_params: 0.152462020516
    th_params: 0.191668987274
    th_params: 0.220470815897
    th_params: 0.200024366379
    th_params: 0.245622217655
    th_params: 0.240862756968
    th_params: 0.135097876191
    th_params: 0.176496654749
    th_params: 0.119362272322
    th_params: 0.119719736278
    th_params: 0.122369989753
    th_params: 0.14361859858
    th_params: 0.111606836319
    th_params: 0.142608061433
    th_params: 0.101309709251
    th_params: 0.135814622045
    th_params: 0.125497207046
    th_params: 0.218120053411
    th_params: 0.244464457035
    th_params: 0.191036954522
    th_params: 0.20541600883
    th_params: 0.127142116427
    th_params: 0.212498381734
    th_params: 0.151325568557
    th_params: 0.108986325562
    th_params: 0.140897095203
    th_params: 0.119998969138
    th_params: 0.141926184297
    th_params: 0.103738836944
    th_params: 0.26068097353
    th_params: 0.147847428918
    th_params: 0.112649999559
    th_params: 0.151631310582
    th_params: 0.206185117364
    th_params: 0.273482859135
    th_params: 0.164708778262
    th_params: 0.100898742676
    th_params: 0.200983017683
    th_params: 0.125265717506
    th_params: 0.230202525854
    th_params: 0.176334127784
    th_params: 0.129321619868
    th_params: 0.141530990601
    th_params: 0.191717028618
    th_params: 0.191011428833
    th_params: 0.13531409204
    th_params: 0.0935426205397
    th_params: 0.280173301697
    th_params: 0.142681255937
    th_params: 0.189516827464
    th_params: 0.138488784432
    th_params: 0.126851260662
  }
}
layer {
  name: "inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inception_3b/5x5"
  top: "inception_3b/5x5"
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 2391.07519531
    th_layer_out: 2391.07519531
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
