name: "GoogleNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/places365/places365_train_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 16
    th_layer_out: 151.0
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/places365/places365_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1/7x7_s2"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1/7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 151.0
    th_layer_out: 1733.64086914
    th_params: 0.28026920557
    th_params: 0.508612155914
    th_params: 0.36529430747
    th_params: 0.373331069946
    th_params: 0.60653680563
    th_params: 0.476894974709
    th_params: 0.724651694298
    th_params: 0.30219784379
    th_params: 0.579081714153
    th_params: 0.518355131149
    th_params: 0.315347522497
    th_params: 0.28492602706
    th_params: 0.543717682362
    th_params: 0.209911853075
    th_params: 0.387095600367
    th_params: 0.475447624922
    th_params: 0.374797850847
    th_params: 0.311860471964
    th_params: 0.418166875839
    th_params: 0.483210235834
    th_params: 0.449716359377
    th_params: 0.266543388367
    th_params: 0.440871924162
    th_params: 0.279688060284
    th_params: 0.604710996151
    th_params: 0.607847213745
    th_params: 0.247846618295
    th_params: 0.778443336487
    th_params: 0.675834417343
    th_params: 0.575180590153
    th_params: 0.37952670455
    th_params: 0.35288760066
    th_params: 0.689367711544
    th_params: 0.499861717224
    th_params: 0.445920199156
    th_params: 0.534343004227
    th_params: 0.430265545845
    th_params: 0.540301382542
    th_params: 0.433446705341
    th_params: 0.282510668039
    th_params: 0.206982210279
    th_params: 0.491366237402
    th_params: 0.521001517773
    th_params: 0.352174311876
    th_params: 0.743481338024
    th_params: 0.42093655467
    th_params: 0.262143552303
    th_params: 0.573460817337
    th_params: 0.623928189278
    th_params: 0.270389288664
    th_params: 0.604952871799
    th_params: 0.373067677021
    th_params: 0.281351923943
    th_params: 0.286520808935
    th_params: 0.497325927019
    th_params: 0.34356674552
    th_params: 0.577170610428
    th_params: 0.335104972124
    th_params: 0.631805598736
    th_params: 0.676052570343
    th_params: 0.454179406166
    th_params: 0.340534836054
    th_params: 0.281319826841
    th_params: 0.216161698103
  }
}
layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1/7x7_s2"
  top: "conv1/7x7_s2"
}
layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 1733.64086914
    th_layer_out: 1733.64086914
  }
}
layer {
  name: "conv2/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool1/3x3_s2"
  top: "conv2/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 1733.64086914
    th_layer_out: 2578.91723633
    th_params: 0.385356754065
    th_params: 0.47315299511
    th_params: 0.533914387226
    th_params: 0.392597407103
    th_params: 0.00330591457896
    th_params: 0.476183205843
    th_params: 0.467486679554
    th_params: 0.619548857212
    th_params: 0.575888037682
    th_params: 0.460108786821
    th_params: 0.558796107769
    th_params: 0.393829405308
    th_params: 0.448392510414
    th_params: 0.00429439172149
    th_params: 0.67538946867
    th_params: 0.448638021946
    th_params: 1.09463775158
    th_params: 0.00428326753899
    th_params: 0.395080506802
    th_params: 0.00546087790281
    th_params: 0.622487425804
    th_params: 0.532090425491
    th_params: 0.403150886297
    th_params: 0.693466484547
    th_params: 0.528804063797
    th_params: 0.466680467129
    th_params: 0.54647153616
    th_params: 1.03558242321
    th_params: 0.857906877995
    th_params: 0.441635966301
    th_params: 0.538815140724
    th_params: 1.07489204407
    th_params: 0.459142178297
    th_params: 0.74952173233
    th_params: 0.560221195221
    th_params: 0.724177718163
    th_params: 0.792694568634
    th_params: 0.878989398479
    th_params: 0.570077419281
    th_params: 0.64184743166
    th_params: 0.813847541809
    th_params: 0.0569318346679
    th_params: 0.738289654255
    th_params: 0.443642318249
    th_params: 1.0005095005
    th_params: 0.45654052496
    th_params: 0.709767401218
    th_params: 0.00531328655779
    th_params: 0.430298924446
    th_params: 0.720517039299
    th_params: 0.705377161503
    th_params: 0.582934260368
    th_params: 0.484072476625
    th_params: 0.790570497513
    th_params: 0.6378428936
    th_params: 0.511184871197
    th_params: 0.497612208128
    th_params: 0.47648537159
    th_params: 0.231300920248
    th_params: 0.708636045456
    th_params: 0.426797837019
    th_params: 0.629754602909
    th_params: 0.706714272499
    th_params: 0.798801422119
  }
}
layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_reduce"
}
layer {
  name: "conv2/3x3"
  type: "ConvolutionRistretto"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2578.91723633
    th_layer_out: 2871.73828125
    th_params: 0.317712605
    th_params: 0.246356129646
    th_params: 0.524065494537
    th_params: 0.595253705978
    th_params: 0.219326272607
    th_params: 0.251564621925
    th_params: 0.174683749676
    th_params: 0.831937730312
    th_params: 0.414852261543
    th_params: 0.177952885628
    th_params: 0.25764721632
    th_params: 0.2178645432
    th_params: 0.5723554492
    th_params: 0.768784880638
    th_params: 0.947439849377
    th_params: 0.297863215208
    th_params: 0.225438788533
    th_params: 0.211269110441
    th_params: 0.918548822403
    th_params: 0.243143066764
    th_params: 0.462530076504
    th_params: 0.169065892696
    th_params: 0.395963579416
    th_params: 0.287529677153
    th_params: 0.21073448658
    th_params: 0.192291617393
    th_params: 0.306379467249
    th_params: 0.374994456768
    th_params: 0.175308555365
    th_params: 0.317460924387
    th_params: 0.315029770136
    th_params: 0.163836628199
    th_params: 0.18742749095
    th_params: 0.276882439852
    th_params: 0.23248514533
    th_params: 0.390911757946
    th_params: 0.224899366498
    th_params: 0.451629191637
    th_params: 0.187458530068
    th_params: 0.21157091856
    th_params: 0.795571804047
    th_params: 0.192668288946
    th_params: 0.252350449562
    th_params: 0.320902019739
    th_params: 0.305052518845
    th_params: 0.279606282711
    th_params: 0.259263515472
    th_params: 0.477852523327
    th_params: 0.206633552909
    th_params: 0.253428578377
    th_params: 0.407948762178
    th_params: 0.559989511967
    th_params: 0.265314757824
    th_params: 0.49394479394
    th_params: 0.329376488924
    th_params: 0.167906343937
    th_params: 0.270636171103
    th_params: 0.806568980217
    th_params: 0.173404797912
    th_params: 0.183175444603
    th_params: 0.682561278343
    th_params: 0.558438956738
    th_params: 0.329043596983
    th_params: 0.263557851315
    th_params: 0.355289638042
    th_params: 0.257947742939
    th_params: 0.26296749711
    th_params: 0.57534891367
    th_params: 0.325760960579
    th_params: 0.248688399792
    th_params: 0.818460285664
    th_params: 0.233677893877
    th_params: 0.793876588345
    th_params: 0.374351888895
    th_params: 0.163124516606
    th_params: 0.358816206455
    th_params: 0.215122163296
    th_params: 0.364005506039
    th_params: 0.288011491299
    th_params: 0.206465497613
    th_params: 0.40317723155
    th_params: 0.282535552979
    th_params: 0.246380478144
    th_params: 0.184028714895
    th_params: 0.200604453683
    th_params: 1.01746618748
    th_params: 0.28975725174
    th_params: 0.184408158064
    th_params: 0.362623125315
    th_params: 0.186812028289
    th_params: 0.17578586936
    th_params: 0.225245475769
    th_params: 0.185540616512
    th_params: 0.236460596323
    th_params: 0.248038336635
    th_params: 0.651818037033
    th_params: 0.232984483242
    th_params: 0.25387597084
    th_params: 0.259944349527
    th_params: 0.315881967545
    th_params: 0.168186634779
    th_params: 0.191621497273
    th_params: 0.208389088511
    th_params: 0.316661655903
    th_params: 0.291094332933
    th_params: 0.342744290829
    th_params: 0.526157438755
    th_params: 0.276254087687
    th_params: 0.286479830742
    th_params: 0.453833281994
    th_params: 0.182791277766
    th_params: 0.282335042953
    th_params: 0.178471624851
    th_params: 0.193469509482
    th_params: 0.209455654025
    th_params: 0.298999190331
    th_params: 0.306686133146
    th_params: 0.28462511301
    th_params: 0.364639431238
    th_params: 0.332175552845
    th_params: 0.295475691557
    th_params: 0.245465561748
    th_params: 0.196365207434
    th_params: 0.320271462202
    th_params: 0.270737975836
    th_params: 0.30652230978
    th_params: 0.319831371307
    th_params: 0.197241693735
    th_params: 0.389705985785
    th_params: 0.267210066319
    th_params: 0.270274251699
    th_params: 0.266556322575
    th_params: 0.19465084374
    th_params: 0.237176209688
    th_params: 1.26835036278
    th_params: 0.318436712027
    th_params: 0.35786101222
    th_params: 0.213282719254
    th_params: 0.267382413149
    th_params: 0.144313767552
    th_params: 0.178509011865
    th_params: 0.407381206751
    th_params: 0.250412106514
    th_params: 0.257100224495
    th_params: 0.184622570872
    th_params: 0.285349220037
    th_params: 0.313080668449
    th_params: 0.286412149668
    th_params: 0.214744612575
    th_params: 0.567928433418
    th_params: 0.252367675304
    th_params: 1.09853672981
    th_params: 0.403599202633
    th_params: 1.00331771374
    th_params: 0.291746139526
    th_params: 0.558807015419
    th_params: 0.326393246651
    th_params: 0.62536406517
    th_params: 0.172834798694
    th_params: 0.404376000166
    th_params: 0.478569597006
    th_params: 0.321739256382
    th_params: 0.42910066247
    th_params: 0.409956097603
    th_params: 0.281436502934
    th_params: 0.240138351917
    th_params: 0.331794351339
    th_params: 0.26710832119
    th_params: 0.330301523209
    th_params: 0.52216809988
    th_params: 0.321365296841
    th_params: 0.192468881607
    th_params: 0.683940470219
    th_params: 0.703714370728
    th_params: 0.364297777414
    th_params: 0.33808478713
    th_params: 0.262035936117
    th_params: 1.04086565971
    th_params: 0.893909931183
    th_params: 0.897999227047
    th_params: 0.173382267356
    th_params: 0.29359832406
    th_params: 0.470989257097
    th_params: 0.389824062586
    th_params: 0.310496240854
    th_params: 0.21990673244
    th_params: 0.350315928459
    th_params: 0.288865953684
    th_params: 0.212668597698
    th_params: 0.274439454079
    th_params: 0.427847296
    th_params: 0.399608701468
  }
}
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3"
  top: "conv2/3x3"
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/3x3"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2871.73828125
    th_layer_out: 2871.73828125
  }
}
layer {
  name: "inception_3a/1x1"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2871.73828125
    th_layer_out: 2312.09326172
    th_params: 0.332292884588
    th_params: 0.267158925533
    th_params: 0.31320643425
    th_params: 0.231572404504
    th_params: 0.256314426661
    th_params: 0.344916582108
    th_params: 0.241743475199
    th_params: 0.314108937979
    th_params: 0.388254314661
    th_params: 0.247377589345
    th_params: 0.296573609114
    th_params: 0.273460328579
    th_params: 0.453594446182
    th_params: 0.300888001919
    th_params: 0.270753055811
    th_params: 0.306327521801
    th_params: 0.293884187937
    th_params: 0.307882219553
    th_params: 0.208622395992
    th_params: 0.349123001099
    th_params: 0.248433738947
    th_params: 0.325230121613
    th_params: 0.219869598746
    th_params: 0.271599888802
    th_params: 0.2353310287
    th_params: 0.299171566963
    th_params: 0.239720955491
    th_params: 0.24359074235
    th_params: 0.27329775691
    th_params: 0.256799012423
    th_params: 0.268876522779
    th_params: 0.284851193428
    th_params: 0.285294979811
    th_params: 0.201330319047
    th_params: 0.323564261198
    th_params: 0.326860278845
    th_params: 0.249208927155
    th_params: 0.385561674833
    th_params: 0.251908034086
    th_params: 0.244412750006
    th_params: 0.244714170694
    th_params: 0.22128482163
    th_params: 0.217580586672
    th_params: 0.233122587204
    th_params: 0.28739386797
    th_params: 0.329515278339
    th_params: 0.302973866463
    th_params: 0.281228065491
    th_params: 0.327387928963
    th_params: 0.23486174643
    th_params: 0.224062889814
    th_params: 0.237364113331
    th_params: 0.266249597073
    th_params: 0.316311985254
    th_params: 0.215431794524
    th_params: 0.228622362018
    th_params: 0.306307464838
    th_params: 0.230060875416
    th_params: 0.235488563776
    th_params: 0.200571805239
    th_params: 0.359030932188
    th_params: 0.331634521484
    th_params: 0.273403912783
    th_params: 0.284715145826
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1"
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2871.73828125
    th_layer_out: 2314.35693359
    th_params: 0.256585329771
    th_params: 0.347733438015
    th_params: 0.214389324188
    th_params: 0.220450669527
    th_params: 0.248997017741
    th_params: 0.302515655756
    th_params: 0.272034168243
    th_params: 0.256796866655
    th_params: 0.195008695126
    th_params: 0.20580495894
    th_params: 0.174546524882
    th_params: 0.223057612777
    th_params: 0.417218118906
    th_params: 0.233291253448
    th_params: 0.275599241257
    th_params: 0.274705022573
    th_params: 0.294731020927
    th_params: 0.61601626873
    th_params: 0.17458075285
    th_params: 0.199053943157
    th_params: 0.238922670484
    th_params: 0.256413012743
    th_params: 0.291827768087
    th_params: 0.267314136028
    th_params: 0.277337104082
    th_params: 0.254313707352
    th_params: 0.233492031693
    th_params: 0.221460178494
    th_params: 0.234760984778
    th_params: 0.328608900309
    th_params: 0.283753544092
    th_params: 0.240057170391
    th_params: 0.209320560098
    th_params: 0.249479576945
    th_params: 0.249342143536
    th_params: 0.360087782145
    th_params: 0.212455749512
    th_params: 0.287264883518
    th_params: 0.376715421677
    th_params: 0.309014409781
    th_params: 0.243149325252
    th_params: 0.235879793763
    th_params: 0.522551894188
    th_params: 0.331468462944
    th_params: 0.225441813469
    th_params: 0.210809245706
    th_params: 0.296427518129
    th_params: 0.186855837703
    th_params: 0.195703685284
    th_params: 0.277268648148
    th_params: 0.483271867037
    th_params: 0.304656684399
    th_params: 0.246000692248
    th_params: 0.218883693218
    th_params: 0.202118992805
    th_params: 0.19574674964
    th_params: 0.300894618034
    th_params: 0.354127794504
    th_params: 0.330598980188
    th_params: 0.269415408373
    th_params: 0.221775621176
    th_params: 0.309112042189
    th_params: 0.345282167196
    th_params: 0.306793898344
    th_params: 0.335254192352
    th_params: 0.240536421537
    th_params: 0.195386826992
    th_params: 0.550789833069
    th_params: 0.336855590343
    th_params: 0.224134162068
    th_params: 0.183223187923
    th_params: 0.200150847435
    th_params: 0.266132235527
    th_params: 0.537141025066
    th_params: 0.234257057309
    th_params: 0.452867686749
    th_params: 0.449023514986
    th_params: 0.322433143854
    th_params: 0.206698790193
    th_params: 0.238257035613
    th_params: 0.224643960595
    th_params: 0.421176940203
    th_params: 0.238838285208
    th_params: 0.285451084375
    th_params: 0.285284727812
    th_params: 0.376657932997
    th_params: 0.251540541649
    th_params: 0.232149749994
    th_params: 0.256216585636
    th_params: 0.222945451736
    th_params: 0.250289410353
    th_params: 0.190406426787
    th_params: 0.227994114161
    th_params: 0.265583068132
    th_params: 0.23255828023
    th_params: 0.26850888133
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce"
}
layer {
  name: "inception_3a/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2314.35693359
    th_layer_out: 2312.09326172
    th_params: 0.1924803406
    th_params: 0.14625197649
    th_params: 0.236472159624
    th_params: 0.305318713188
    th_params: 0.195465788245
    th_params: 0.16547358036
    th_params: 0.168344154954
    th_params: 0.189345210791
    th_params: 0.175782218575
    th_params: 0.145901724696
    th_params: 0.155487298965
    th_params: 0.177734360099
    th_params: 0.216547176242
    th_params: 0.133721977472
    th_params: 0.21883648634
    th_params: 0.0678952634335
    th_params: 0.23712310195
    th_params: 0.319449096918
    th_params: 0.133607193828
    th_params: 0.215714886785
    th_params: 0.249027878046
    th_params: 0.144603520632
    th_params: 0.137896180153
    th_params: 0.291861176491
    th_params: 0.181290060282
    th_params: 0.140888914466
    th_params: 0.253774106503
    th_params: 0.151669576764
    th_params: 0.159588873386
    th_params: 0.0921742320061
    th_params: 0.156130090356
    th_params: 0.158149376512
    th_params: 0.201019302011
    th_params: 0.228187516332
    th_params: 0.240164875984
    th_params: 0.477010130882
    th_params: 0.232246890664
    th_params: 0.157839134336
    th_params: 0.171931996942
    th_params: 0.13410744071
    th_params: 0.198667615652
    th_params: 0.0605952627957
    th_params: 0.158730253577
    th_params: 0.173090338707
    th_params: 0.140611499548
    th_params: 0.125310525298
    th_params: 0.173826828599
    th_params: 0.213417202234
    th_params: 0.168646514416
    th_params: 0.421335011721
    th_params: 0.179355323315
    th_params: 0.322796821594
    th_params: 0.151339545846
    th_params: 0.209697067738
    th_params: 0.662514567375
    th_params: 0.197001889348
    th_params: 0.149855613708
    th_params: 0.171495586634
    th_params: 0.152311488986
    th_params: 0.163186818361
    th_params: 0.373521387577
    th_params: 0.156848102808
    th_params: 0.166417717934
    th_params: 0.272812575102
    th_params: 0.203975766897
    th_params: 0.109647594392
    th_params: 0.122953876853
    th_params: 0.168349698186
    th_params: 0.237881347537
    th_params: 0.223079308867
    th_params: 0.120994053781
    th_params: 0.151065185666
    th_params: 0.214903444052
    th_params: 0.166809380054
    th_params: 0.216329053044
    th_params: 0.287619531155
    th_params: 0.169994041324
    th_params: 0.61001855135
    th_params: 0.155062481761
    th_params: 0.146077886224
    th_params: 0.197619885206
    th_params: 0.142750322819
    th_params: 0.230422183871
    th_params: 0.1490188241
    th_params: 0.126584395766
    th_params: 0.0227139424533
    th_params: 0.264478743076
    th_params: 0.149043321609
    th_params: 0.179264172912
    th_params: 0.22611784935
    th_params: 0.158254310489
    th_params: 0.108123891056
    th_params: 0.174814477563
    th_params: 0.236263439059
    th_params: 0.178778961301
    th_params: 0.266077250242
    th_params: 0.149059891701
    th_params: 0.249185502529
    th_params: 0.298504501581
    th_params: 0.191257223487
    th_params: 0.16474352777
    th_params: 0.183528289199
    th_params: 0.139216408134
    th_params: 0.19912712276
    th_params: 0.167426496744
    th_params: 0.12921436131
    th_params: 0.190048381686
    th_params: 0.227250084281
    th_params: 0.168076694012
    th_params: 0.149273410439
    th_params: 0.145670711994
    th_params: 0.142189994454
    th_params: 0.137542441487
    th_params: 0.155247360468
    th_params: 0.142963379622
    th_params: 0.156473398209
    th_params: 0.319500148296
    th_params: 0.146430641413
    th_params: 0.130423352122
    th_params: 0.208962142467
    th_params: 0.239707961679
    th_params: 0.22026515007
    th_params: 0.172569230199
    th_params: 0.150651589036
    th_params: 0.126422733068
    th_params: 0.00717262830585
    th_params: 0.222714215517
    th_params: 0.17550599575
  }
}
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3"
}
layer {
  name: "inception_3a/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2871.73828125
    th_layer_out: 1260.50109863
    th_params: 0.238297984004
    th_params: 0.214841365814
    th_params: 0.18064238131
    th_params: 0.196903988719
    th_params: 0.231777310371
    th_params: 0.193319275975
    th_params: 0.290193468332
    th_params: 0.274146258831
    th_params: 0.175281763077
    th_params: 0.212378263474
    th_params: 0.229806125164
    th_params: 0.197298035026
    th_params: 0.177110344172
    th_params: 0.189482927322
    th_params: 0.344487339258
    th_params: 0.175451353192
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5_reduce"
}
layer {
  name: "inception_3a/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 1260.50109863
    th_layer_out: 2312.09326172
    th_params: 0.318477362394
    th_params: 0.22584939003
    th_params: 0.258158117533
    th_params: 0.224026858807
    th_params: 0.170221507549
    th_params: 0.150055453181
    th_params: 0.186849310994
    th_params: 0.221863463521
    th_params: 0.130851298571
    th_params: 0.214955344796
    th_params: 0.249536916614
    th_params: 0.18180334568
    th_params: 0.276736795902
    th_params: 0.323023736477
    th_params: 0.21280837059
    th_params: 0.177830442786
    th_params: 0.165511906147
    th_params: 0.304855257273
    th_params: 0.202038750052
    th_params: 0.199445068836
    th_params: 0.217343494296
    th_params: 0.149820163846
    th_params: 0.150405555964
    th_params: 0.212958484888
    th_params: 0.203325733542
    th_params: 0.184404373169
    th_params: 0.308917909861
    th_params: 0.274772316217
    th_params: 0.194665148854
    th_params: 0.170711487532
    th_params: 0.255796968937
    th_params: 0.152998223901
  }
}
layer {
  name: "inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inception_3a/5x5"
  top: "inception_3a/5x5"
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2871.73828125
    th_layer_out: 2871.73828125
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2871.73828125
    th_layer_out: 2312.09326172
    th_params: 0.224175333977
    th_params: 0.301073253155
    th_params: 0.251669436693
    th_params: 0.310075998306
    th_params: 0.285841822624
    th_params: 0.26276025176
    th_params: 0.223167017102
    th_params: 0.487145006657
    th_params: 0.234275072813
    th_params: 0.286627233028
    th_params: 0.217808380723
    th_params: 0.287480562925
    th_params: 0.3460547328
    th_params: 0.339065045118
    th_params: 0.34425637126
    th_params: 0.239158272743
    th_params: 0.221285358071
    th_params: 0.236677736044
    th_params: 0.250905364752
    th_params: 0.257775634527
    th_params: 0.330480337143
    th_params: 0.290954172611
    th_params: 0.199304834008
    th_params: 0.199371486902
    th_params: 0.316561102867
    th_params: 0.354717314243
    th_params: 0.201943650842
    th_params: 0.265434145927
    th_params: 0.263128906488
    th_params: 0.26309683919
    th_params: 0.30894240737
    th_params: 0.277225464582
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj"
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1"
  bottom: "inception_3a/3x3"
  bottom: "inception_3a/5x5"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/output"
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2312.09326172
    th_layer_out: 2312.09326172
  }
}
layer {
  name: "inception_3b/1x1"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2312.09326172
    th_layer_out: 933.393493652
    th_params: 0.293032586575
    th_params: 0.221598207951
    th_params: 0.254992157221
    th_params: 0.378069937229
    th_params: 0.201217010617
    th_params: 0.175612926483
    th_params: 0.206180289388
    th_params: 0.183172032237
    th_params: 0.231536641717
    th_params: 0.20550711453
    th_params: 0.202049866319
    th_params: 0.250918149948
    th_params: 0.252679288387
    th_params: 0.200806766748
    th_params: 0.224744394422
    th_params: 0.213610708714
    th_params: 0.193372175097
    th_params: 0.261731863022
    th_params: 0.221210747957
    th_params: 0.253866493702
    th_params: 0.159242272377
    th_params: 0.250672191381
    th_params: 0.215533927083
    th_params: 0.189907759428
    th_params: 0.189822390676
    th_params: 0.273069739342
    th_params: 0.270642131567
    th_params: 0.169135689735
    th_params: 0.165109440684
    th_params: 0.176676332951
    th_params: 0.194724977016
    th_params: 0.287079721689
    th_params: 0.17506416142
    th_params: 0.368734061718
    th_params: 0.164079070091
    th_params: 0.443754255772
    th_params: 0.299673825502
    th_params: 0.205412134528
    th_params: 0.162764713168
    th_params: 0.19740858674
    th_params: 0.20607458055
    th_params: 0.300188452005
    th_params: 0.169724002481
    th_params: 0.325946062803
    th_params: 0.173350974917
    th_params: 0.220545560122
    th_params: 0.185195013881
    th_params: 0.172517374158
    th_params: 0.215208396316
    th_params: 0.223219230771
    th_params: 0.229503184557
    th_params: 0.183464258909
    th_params: 0.190744921565
    th_params: 0.182138010859
    th_params: 0.176775664091
    th_params: 0.231090918183
    th_params: 0.174747467041
    th_params: 0.24027864635
    th_params: 0.220946952701
    th_params: 0.272325694561
    th_params: 0.209717586637
    th_params: 0.187358006835
    th_params: 0.193552643061
    th_params: 0.189470514655
    th_params: 0.22509868443
    th_params: 0.221920654178
    th_params: 0.258053869009
    th_params: 0.207068309188
    th_params: 0.17428997159
    th_params: 0.205663233995
    th_params: 0.204580083489
    th_params: 0.180100932717
    th_params: 0.246727973223
    th_params: 0.243620619178
    th_params: 0.222141563892
    th_params: 0.24662989378
    th_params: 0.182622343302
    th_params: 0.200241729617
    th_params: 0.313391178846
    th_params: 0.256010144949
    th_params: 0.164090454578
    th_params: 0.322915792465
    th_params: 0.266699999571
    th_params: 0.193159773946
    th_params: 0.178069859743
    th_params: 0.169275552034
    th_params: 0.229143947363
    th_params: 0.236280202866
    th_params: 0.195930734277
    th_params: 0.244956180453
    th_params: 0.210920661688
    th_params: 0.211138144135
    th_params: 0.263398528099
    th_params: 0.180491283536
    th_params: 0.190502122045
    th_params: 0.231843441725
    th_params: 0.379038959742
    th_params: 0.201115056872
    th_params: 0.21605053544
    th_params: 0.208647742867
    th_params: 0.270571410656
    th_params: 0.213540330529
    th_params: 0.220411792397
    th_params: 0.275203406811
    th_params: 0.219595104456
    th_params: 0.23727619648
    th_params: 0.224407583475
    th_params: 0.182048797607
    th_params: 0.313409388065
    th_params: 0.341870427132
    th_params: 0.195639044046
    th_params: 0.209464102983
    th_params: 0.215484261513
    th_params: 0.227663248777
    th_params: 0.247923135757
    th_params: 0.331857979298
    th_params: 0.225321382284
    th_params: 0.214986637235
    th_params: 0.460610806942
    th_params: 0.189902231097
    th_params: 0.249577358365
    th_params: 0.287633359432
    th_params: 0.196237936616
    th_params: 0.264270722866
    th_params: 0.177604347467
    th_params: 0.302287518978
    th_params: 0.229161113501
    th_params: 0.217714950442
  }
}
layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1"
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2312.09326172
    th_layer_out: 1002.10003662
    th_params: 0.157072395086
    th_params: 0.18718713522
    th_params: 0.356060922146
    th_params: 0.25231564045
    th_params: 0.235420420766
    th_params: 0.193330287933
    th_params: 0.209780216217
    th_params: 0.171295031905
    th_params: 0.25090906024
    th_params: 0.242552578449
    th_params: 0.218615710735
    th_params: 0.213563799858
    th_params: 0.188485473394
    th_params: 0.259123891592
    th_params: 0.245580255985
    th_params: 0.202621370554
    th_params: 0.196411520243
    th_params: 0.162050932646
    th_params: 0.223995387554
    th_params: 0.211909607053
    th_params: 0.263823926449
    th_params: 0.184386268258
    th_params: 0.182605102658
    th_params: 0.158493429422
    th_params: 0.223608896136
    th_params: 0.238330438733
    th_params: 0.303978204727
    th_params: 0.190891414881
    th_params: 0.189473763108
    th_params: 0.251057863235
    th_params: 0.208905875683
    th_params: 0.204515591264
    th_params: 0.159499138594
    th_params: 0.159035846591
    th_params: 0.17867590487
    th_params: 0.162553846836
    th_params: 0.182833015919
    th_params: 0.186227723956
    th_params: 0.260629445314
    th_params: 0.194489270449
    th_params: 0.253774762154
    th_params: 0.202527701855
    th_params: 0.22278290987
    th_params: 0.197992667556
    th_params: 0.247891619802
    th_params: 0.206666111946
    th_params: 0.188694626093
    th_params: 0.190285921097
    th_params: 0.178765326738
    th_params: 0.148461565375
    th_params: 0.198676034808
    th_params: 0.254566043615
    th_params: 0.212181195617
    th_params: 0.243153885007
    th_params: 0.274004995823
    th_params: 0.224291399121
    th_params: 0.185958251357
    th_params: 0.219056859612
    th_params: 0.217100739479
    th_params: 0.187682852149
    th_params: 0.243786275387
    th_params: 0.251841723919
    th_params: 0.177279978991
    th_params: 0.233947247267
    th_params: 0.300621122122
    th_params: 0.218276172876
    th_params: 0.234814301133
    th_params: 0.196444690228
    th_params: 0.188033372164
    th_params: 0.170869112015
    th_params: 0.156666651368
    th_params: 0.201653689146
    th_params: 0.17423838377
    th_params: 0.301342993975
    th_params: 0.197606220841
    th_params: 0.166534245014
    th_params: 0.225606366992
    th_params: 0.213507980108
    th_params: 0.182794943452
    th_params: 0.201316192746
    th_params: 0.2080334723
    th_params: 0.17494751513
    th_params: 0.248870059848
    th_params: 0.19556003809
    th_params: 0.212794169784
    th_params: 0.162255868316
    th_params: 0.254906058311
    th_params: 0.149947479367
    th_params: 0.219784513116
    th_params: 0.220118954778
    th_params: 0.212411627173
    th_params: 0.276887148619
    th_params: 0.26524412632
    th_params: 0.202553659678
    th_params: 0.280686676502
    th_params: 0.252181142569
    th_params: 0.312407642603
    th_params: 0.20284666121
    th_params: 0.163620084524
    th_params: 0.256594479084
    th_params: 0.21580940485
    th_params: 0.21706058085
    th_params: 0.234390214086
    th_params: 0.174245506525
    th_params: 0.233317986131
    th_params: 0.17541565001
    th_params: 0.21653085947
    th_params: 0.194704130292
    th_params: 0.231123611331
    th_params: 0.197878539562
    th_params: 0.187860041857
    th_params: 0.204234004021
    th_params: 0.197458311915
    th_params: 0.164744466543
    th_params: 0.203196510673
    th_params: 0.196165114641
    th_params: 0.299535095692
    th_params: 0.231572061777
    th_params: 0.208465531468
    th_params: 0.27110439539
    th_params: 0.245921909809
    th_params: 0.224864825606
    th_params: 0.245910778642
    th_params: 0.182254508138
    th_params: 0.148295402527
    th_params: 0.216549992561
    th_params: 0.248606383801
    th_params: 0.193289548159
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce"
}
layer {
  name: "inception_3b/3x3"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 1002.10003662
    th_layer_out: 933.393493652
    th_params: 0.195835247636
    th_params: 0.111853033304
    th_params: 0.11772608757
    th_params: 0.134551107883
    th_params: 0.162200778723
    th_params: 0.187301963568
    th_params: 0.128238230944
    th_params: 0.124217428267
    th_params: 0.144766509533
    th_params: 0.131574839354
    th_params: 0.138864189386
    th_params: 0.174790814519
    th_params: 0.166116282344
    th_params: 0.134000778198
    th_params: 0.182532310486
    th_params: 0.125172913074
    th_params: 0.146545320749
    th_params: 0.108800791204
    th_params: 0.068837583065
    th_params: 0.166961252689
    th_params: 0.255185037851
    th_params: 0.235981911421
    th_params: 0.149518370628
    th_params: 0.111625954509
    th_params: 0.16403581202
    th_params: 0.150565013289
    th_params: 0.297759264708
    th_params: 0.156030356884
    th_params: 0.17450684309
    th_params: 0.250013560057
    th_params: 0.217260852456
    th_params: 0.15618288517
    th_params: 0.197798639536
    th_params: 0.116098955274
    th_params: 0.145404830575
    th_params: 0.148779854178
    th_params: 0.172904849052
    th_params: 0.141822621226
    th_params: 0.135036677122
    th_params: 0.298016965389
    th_params: 0.156768471003
    th_params: 0.129530832171
    th_params: 0.170483142138
    th_params: 0.168846949935
    th_params: 0.146673798561
    th_params: 0.180085062981
    th_params: 0.166612237692
    th_params: 0.258414596319
    th_params: 0.174484074116
    th_params: 0.156803309917
    th_params: 0.131956085563
    th_params: 0.131341710687
    th_params: 0.224412515759
    th_params: 0.135693237185
    th_params: 0.199197903275
    th_params: 0.161515399814
    th_params: 0.197606191039
    th_params: 0.154527261853
    th_params: 0.123129852116
    th_params: 0.169687628746
    th_params: 0.134716317058
    th_params: 0.163898259401
    th_params: 0.136465787888
    th_params: 0.174237862229
    th_params: 0.139988452196
    th_params: 0.184276685119
    th_params: 0.112997360528
    th_params: 0.194529101253
    th_params: 0.125476643443
    th_params: 0.137612521648
    th_params: 0.125809386373
    th_params: 0.133132025599
    th_params: 0.136176392436
    th_params: 0.14093093574
    th_params: 0.15023124218
    th_params: 0.15476153791
    th_params: 0.152334883809
    th_params: 0.133361890912
    th_params: 0.135255843401
    th_params: 0.140927106142
    th_params: 0.189803719521
    th_params: 0.159573480487
    th_params: 0.208086833358
    th_params: 0.108027495444
    th_params: 0.11179702729
    th_params: 0.135690659285
    th_params: 0.229508593678
    th_params: 0.193858131766
    th_params: 0.117563121021
    th_params: 0.150014489889
    th_params: 0.13611754775
    th_params: 0.185049816966
    th_params: 0.101928085089
    th_params: 0.144508972764
    th_params: 0.154871821404
    th_params: 0.13954128325
    th_params: 0.159502118826
    th_params: 0.11953175813
    th_params: 0.16512618959
    th_params: 0.118445076048
    th_params: 0.173077404499
    th_params: 0.14423237741
    th_params: 0.136324882507
    th_params: 0.139479205012
    th_params: 0.298293858767
    th_params: 0.165318340063
    th_params: 0.184737458825
    th_params: 0.153235092759
    th_params: 0.0773814618587
    th_params: 0.145658120513
    th_params: 0.346679925919
    th_params: 0.138500019908
    th_params: 0.1215518713
    th_params: 0.163715824485
    th_params: 0.1780243963
    th_params: 0.184391632676
    th_params: 0.166887134314
    th_params: 0.105847373605
    th_params: 0.220049500465
    th_params: 0.228734880686
    th_params: 0.14285106957
    th_params: 0.185251459479
    th_params: 0.15139272809
    th_params: 0.16371782124
    th_params: 0.168138414621
    th_params: 0.164268016815
    th_params: 0.234619051218
    th_params: 0.137266367674
    th_params: 0.205149233341
    th_params: 0.164007633924
    th_params: 0.167826712132
    th_params: 0.0667453482747
    th_params: 0.124831132591
    th_params: 0.158901110291
    th_params: 0.129788264632
    th_params: 0.139056488872
    th_params: 0.129308059812
    th_params: 0.139597505331
    th_params: 0.148268520832
    th_params: 0.286733597517
    th_params: 0.204991579056
    th_params: 0.244165629148
    th_params: 0.151088610291
    th_params: 0.190760016441
    th_params: 0.155700191855
    th_params: 0.178242757916
    th_params: 0.165797889233
    th_params: 0.136308968067
    th_params: 0.153111726046
    th_params: 0.155594795942
    th_params: 0.141020998359
    th_params: 0.120628118515
    th_params: 0.174585267901
    th_params: 0.184356912971
    th_params: 0.148539483547
    th_params: 0.12633857131
    th_params: 0.144151985645
    th_params: 0.110063247383
    th_params: 0.158926725388
    th_params: 0.124272085726
    th_params: 0.148428931832
    th_params: 0.195605799556
    th_params: 0.164894133806
    th_params: 0.196504473686
    th_params: 0.129026427865
    th_params: 0.125287815928
    th_params: 0.291299909353
    th_params: 0.15686032176
    th_params: 0.114948675036
    th_params: 0.107580855489
    th_params: 0.150737762451
    th_params: 0.183553218842
    th_params: 0.184384033084
    th_params: 0.171634882689
    th_params: 0.169683218002
    th_params: 0.155667468905
    th_params: 0.147951290011
    th_params: 0.177202254534
    th_params: 0.149997860193
    th_params: 0.163583159447
    th_params: 0.318718731403
    th_params: 0.139142274857
    th_params: 0.171311125159
    th_params: 0.201128900051
    th_params: 0.14896415174
    th_params: 0.176611602306
    th_params: 0.128274977207
    th_params: 0.208294093609
    th_params: 0.165834873915
    th_params: 0.203188732266
    th_params: 0.224691987038
    th_params: 0.143370509148
  }
}
layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3"
}
layer {
  name: "inception_3b/5x5_reduce"
  type: "ConvolutionRistretto"
  bottom: "inception_3a/output"
  top: "inception_3b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 2312.09326172
    th_layer_out: 979.93182373
    th_params: 0.411987930536
    th_params: 0.216299965978
    th_params: 0.331899255514
    th_params: 0.20094846189
    th_params: 0.196838274598
    th_params: 0.354818195105
    th_params: 0.208613410592
    th_params: 0.318041056395
    th_params: 0.226486518979
    th_params: 0.382069200277
    th_params: 0.226297721267
    th_params: 0.230519413948
    th_params: 0.200033381581
    th_params: 0.212661400437
    th_params: 0.394865840673
    th_params: 0.254623323679
    th_params: 0.190110489726
    th_params: 0.223099410534
    th_params: 0.29831725359
    th_params: 0.283565223217
    th_params: 0.211132854223
    th_params: 0.239653527737
    th_params: 0.189578905702
    th_params: 0.240888208151
    th_params: 0.175415083766
    th_params: 0.193000018597
    th_params: 0.185579061508
    th_params: 0.373340606689
    th_params: 0.212270453572
    th_params: 0.215608656406
    th_params: 0.335657536983
    th_params: 0.282046854496
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5_reduce"
}
layer {
  name: "inception_3b/5x5"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    bw_params: 16
    th_layer_in: 979.93182373
    th_layer_out: 933.393493652
    th_params: 0.136520460248
    th_params: 0.226904511452
    th_params: 0.153409078717
    th_params: 0.237566873431
    th_params: 0.140758574009
    th_params: 0.180195838213
    th_params: 0.256165504456
    th_params: 0.18004719913
    th_params: 0.14280423522
    th_params: 0.355879485607
    th_params: 0.136410847306
    th_params: 0.168480008841
    th_params: 0.207559838891
    th_params: 0.161237627268
    th_params: 0.280367493629
    th_params: 0.192528292537
    th_params: 0.267598986626
    th_params: 0.130098223686
    th_params: 0.160454288125
    th_params: 0.153820440173
    th_params: 0.193032473326
    th_params: 0.173806428909
    th_params: 0.182648107409
    th_params: 0.142361223698
    th_params: 0.288679808378
    th_params: 0.138899534941
    th_params: 0.184709504247
    th_params: 0.294954866171
    th_params: 0.120728805661
    th_params: 0.193592309952
    th_params: 0.202173009515
    th_params: 0.195582762361
    th_params: 0.168610721827
    th_params: 0.153507381678
    th_params: 0.216486662626
    th_params: 0.210544794798
    th_params: 0.139994725585
    th_params: 0.130368173122
    th_params: 0.188824087381
    th_params: 0.124415948987
    th_params: 0.157752633095
    th_params: 0.134993806481
    th_params: 0.144250825047
    th_params: 0.222925156355
    th_params: 0.168010443449
    th_params: 0.168512851
    th_params: 0.144731462002
    th_params: 0.19428730011
    th_params: 0.205510139465
    th_params: 0.160576701164
    th_params: 0.20147100091
    th_params: 0.110433839262
    th_params: 0.267580866814
    th_params: 0.195073589683
    th_params: 0.298387140036
    th_params: 0.175032258034
    th_params: 0.403296083212
    th_params: 0.137925058603
    th_params: 0.158829659224
    th_params: 0.179214835167
    th_params: 0.2656211555
    th_params: 0.177771136165
    th_params: 0.14025631547
    th_params: 0.166395187378
    th_params: 0.121877916157
    th_params: 0.119300119579
    th_params: 0.15525521338
    th_params: 0.150020122528
    th_params: 0.150955453515
    th_params: 0.154437124729
    th_params: 0.143139183521
    th_params: 0.120942175388
    th_params: 0.16432711482
    th_params: 0.10227598995
    th_params: 0.155024141073
    th_params: 0.172385960817
    th_params: 0.265034019947
    th_params: 0.107725791633
    th_params: 0.177073255181
    th_params: 0.166954010725
    th_params: 0.267487794161
    th_params: 0.18793348968
    th_params: 0.177974820137
    th_params: 0.178526386619
    th_params: 0.18439514935
    th_params: 0.226160690188
    th_params: 0.138293847442
    th_params: 0.129284918308
    th_params: 0.122772529721
    th_params: 0.23560667038
    th_params: 0.202658936381
    th_params: 0.155632317066
    th_params: 0.15470468998
    th_params: 0.755417704582
    th_params: 0.219024762511
    th_params: 0.194876357913
  }
}
layer {
  name: "inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inception_3b/5x5"
  top: "inception_3b/5x5"
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
  quantization_param {
    bw_layer_in: 16
    bw_layer_out: 16
    th_layer_in: 2312.09326172
    th_layer_out: 2312.09326172
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "ConvolutionRistretto"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
