layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 100
      dim: 3
      dim: 32
      dim: 32
    }
  }
}
layer {
  name: "ResNetnConv2dnconv1n108"
  type: "Convolution"
  bottom: "data"
  top: "ResNetnConv2dnconv1n108"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnBatchNorm2dnbn1n109"
  type: "BatchNorm"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnConv2dnconv1n108"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnBatchNorm2dnbn1n109_scale"
  type: "Scale"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnConv2dnconv1n108"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnReLUnrelun110"
  type: "ReLU"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnConv2dnconv1n108"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  type: "Convolution"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n112"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn1n112_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun113"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n115"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnBatchNorm2dnbn2n115_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun117"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n119"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn1n119_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun120"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n122"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnBatchNorm2dnbn2n122_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun124"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n126"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn1n126_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun127"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n129"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnBatchNorm2dnbn2n129_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun131"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n133"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn1n133_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n138"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n138_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun134"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n136"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnBatchNorm2dnbn2n136_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun140"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n142"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn1n142_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun143"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n145"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnBatchNorm2dnbn2n145_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun147"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n149"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn1n149_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun150"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n152"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnBatchNorm2dnbn2n152_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun154"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 2
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n156"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn1n156_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n161"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennBatchNorm2dn1n161_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun157"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n159"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnBatchNorm2dnbn2n159_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun163"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n165"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn1n165_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun166"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n168"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnBatchNorm2dnbn2n168_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun170"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n172"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn1n172_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun173"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n175"
  type: "BatchNorm"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  batch_norm_param {
    use_global_stats: true
    eps: 9.99999974738e-06
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnBatchNorm2dnbn2n175_scale"
  type: "Scale"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun177"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
}
layer {
  name: "ResNetnAvgPool2dnavgpooln178"
  type: "Pooling"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  top: "ResNetnAvgPool2dnavgpooln178"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 8
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "ResNetnLinearnfcn180"
  type: "InnerProduct"
  bottom: "ResNetnAvgPool2dnavgpooln178"
  top: "ResNetnLinearnfcn180"
  inner_product_param {
    num_output: 10
    bias_term: true
  }
}

