layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 100
      dim: 3
      dim: 32
      dim: 32
    }
  }
}
layer {
  name: "ResNetnConv2dnconv1n108"
  type: "Convolution"
  bottom: "data"
  top: "ResNetnConv2dnconv1n108"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnReLUnrelun110"
  type: "ReLU"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnConv2dnconv1n108"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  type: "Convolution"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun113"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv1n111"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0nnConv2dnconv2n114"
  bottom: "ResNetnConv2dnconv1n108"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn0nnReLUnrelun117"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun120"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv1n118"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1nnConv2dnconv2n121"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn0n116"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn1nnReLUnrelun124"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun127"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv1n125"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2nnConv2dnconv2n128"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn1n123"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer1nnBasicBlockn2nnReLUnrelun131"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer1nnBasicBlockn2n130"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    engine: CAFFE
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun134"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv1n132"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnConv2dnconv2n135"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0nnSequentialndownsamplennConv2dn0n137"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn0nnReLUnrelun140"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun143"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv1n141"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1nnConv2dnconv2n144"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn0n139"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn1nnReLUnrelun147"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun150"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv1n148"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2nnConv2dnconv2n151"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn1n146"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer2nnBasicBlockn2nnReLUnrelun154"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer2nnBasicBlockn2n153"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    engine: CAFFE
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun157"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv1n155"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnConv2dnconv2n158"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0nnSequentialndownsamplennConv2dn0n160"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn0nnReLUnrelun163"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun166"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv1n164"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1nnConv2dnconv2n167"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn0n162"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn1nnReLUnrelun170"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun173"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  type: "Convolution"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv1n171"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  type: "Eltwise"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2nnConv2dnconv2n174"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn1n169"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "ResNetnSequentialnlayer3nnBasicBlockn2nnReLUnrelun177"
  type: "ReLU"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  top: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
}
layer {
  name: "ResNetnAvgPool2dnavgpooln178"
  type: "Pooling"
  bottom: "ResNetnSequentialnlayer3nnBasicBlockn2n176"
  top: "ResNetnAvgPool2dnavgpooln178"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 8
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "ResNetnLinearnfcn180"
  type: "InnerProduct"
  bottom: "ResNetnAvgPool2dnavgpooln178"
  top: "ResNetnLinearnfcn180"
  inner_product_param {
    num_output: 10
    bias_term: true
  }
}
