name: "VGG_ILSVRC_16_layers"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 8
    th_layer_out: 150.845214844
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "conv1_1"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 150.845214844
    th_layer_out: 430.794403076
    th_params: 0.55037945509
    th_params: 0.20229844749
    th_params: 0.240750551224
    th_params: 0.51541697979
    th_params: 0.336890220642
    th_params: 0.267666608095
    th_params: 0.228956848383
    th_params: 0.282425582409
    th_params: 0.335548251867
    th_params: 0.279697060585
    th_params: 0.608515918255
    th_params: 0.294810146093
    th_params: 0.437669992447
    th_params: 0.30508556962
    th_params: 0.459023654461
    th_params: 0.329839289188
    th_params: 0.237850174308
    th_params: 0.214898407459
    th_params: 0.335441887379
    th_params: 0.211305364966
    th_params: 0.36464703083
    th_params: 0.397887289524
    th_params: 0.219329833984
    th_params: 0.487027853727
    th_params: 0.147251933813
    th_params: 0.173798024654
    th_params: 0.495030999184
    th_params: 0.264501214027
    th_params: 0.465058833361
    th_params: 0.278903901577
    th_params: 0.292066574097
    th_params: 0.15973611176
    th_params: 0.123675704002
    th_params: 0.310258120298
    th_params: 0.439276874065
    th_params: 0.444485127926
    th_params: 0.228493019938
    th_params: 0.539468646049
    th_params: 0.329210728407
    th_params: 0.248856917024
    th_params: 0.240234792233
    th_params: 0.55175447464
    th_params: 0.285375356674
    th_params: 0.443641155958
    th_params: 0.279658704996
    th_params: 0.575109660625
    th_params: 0.302002608776
    th_params: 0.484057098627
    th_params: 0.398592233658
    th_params: 0.403994083405
    th_params: 0.162634149194
    th_params: 0.67140007019
    th_params: 0.27801823616
    th_params: 0.338722199202
    th_params: 0.367730200291
    th_params: 0.253587990999
    th_params: 0.309078454971
    th_params: 0.489763706923
    th_params: 0.529540300369
    th_params: 0.286743253469
    th_params: 0.449152290821
    th_params: 0.156839802861
    th_params: 0.505662560463
    th_params: 0.423764467239
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "ConvolutionRistretto"
  bottom: "conv1_1"
  top: "conv1_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 430.794403076
    th_layer_out: 1818.67724609
    th_params: 0.221888110042
    th_params: 0.167453497648
    th_params: 0.161067798734
    th_params: 0.20582267642
    th_params: 0.232272610068
    th_params: 0.247453033924
    th_params: 0.17974562943
    th_params: 0.121478840709
    th_params: 0.0900691971183
    th_params: 0.079802326858
    th_params: 0.247474983335
    th_params: 0.092635884881
    th_params: 0.128944769502
    th_params: 0.229758918285
    th_params: 0.0694253444672
    th_params: 0.206048175693
    th_params: 0.11450946331
    th_params: 0.210004076362
    th_params: 0.289170950651
    th_params: 0.246963903308
    th_params: 0.24758939445
    th_params: 0.141669586301
    th_params: 0.0746469944715
    th_params: 0.0618098117411
    th_params: 0.138680070639
    th_params: 0.210059285164
    th_params: 0.203942760825
    th_params: 0.184965699911
    th_params: 0.207521691918
    th_params: 0.215457588434
    th_params: 0.240544170141
    th_params: 0.142614543438
    th_params: 0.273651003838
    th_params: 0.206326454878
    th_params: 0.207672223449
    th_params: 0.204391673207
    th_params: 0.158718839288
    th_params: 0.200901925564
    th_params: 0.165908187628
    th_params: 0.0877115875483
    th_params: 0.191295266151
    th_params: 0.236362159252
    th_params: 0.159972012043
    th_params: 0.22272503376
    th_params: 0.206615328789
    th_params: 0.214944750071
    th_params: 0.130984395742
    th_params: 0.260293334723
    th_params: 0.175414130092
    th_params: 0.174271583557
    th_params: 0.194455087185
    th_params: 0.142125830054
    th_params: 0.197485506535
    th_params: 0.23503485322
    th_params: 0.0687848776579
    th_params: 0.281760364771
    th_params: 0.138242125511
    th_params: 0.201027065516
    th_params: 0.238190636039
    th_params: 0.205039009452
    th_params: 0.227436512709
    th_params: 0.104040287435
    th_params: 0.218705683947
    th_params: 0.210741132498
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 1818.67724609
    th_layer_out: 1818.67724609
  }
}
layer {
  name: "conv2_1"
  type: "ConvolutionRistretto"
  bottom: "pool1"
  top: "conv2_1"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1818.67724609
    th_layer_out: 2725.04907227
    th_params: 0.0418734066188
    th_params: 0.0934667438269
    th_params: 0.104985669255
    th_params: 0.27167391777
    th_params: 0.189197480679
    th_params: 0.126016646624
    th_params: 0.224812999368
    th_params: 0.172141999006
    th_params: 0.136052101851
    th_params: 0.0879354253411
    th_params: 0.120045728981
    th_params: 0.128784015775
    th_params: 0.261707007885
    th_params: 0.0635648146272
    th_params: 0.131915360689
    th_params: 0.128305524588
    th_params: 0.139329686761
    th_params: 0.186229705811
    th_params: 0.170658111572
    th_params: 0.0958438292146
    th_params: 0.136501640081
    th_params: 0.112712658942
    th_params: 0.169190838933
    th_params: 0.13297110796
    th_params: 0.125182077289
    th_params: 0.153687670827
    th_params: 0.197203978896
    th_params: 0.060856603086
    th_params: 0.0655011609197
    th_params: 0.121357880533
    th_params: 0.215584501624
    th_params: 0.0633847936988
    th_params: 0.293565571308
    th_params: 0.183462530375
    th_params: 0.151753380895
    th_params: 0.0724710822105
    th_params: 0.12590958178
    th_params: 0.118301898241
    th_params: 0.103122539818
    th_params: 0.0506501495838
    th_params: 0.0789849236608
    th_params: 0.144607901573
    th_params: 0.194520831108
    th_params: 0.0130246523768
    th_params: 0.159514501691
    th_params: 0.15696837008
    th_params: 0.13442401588
    th_params: 0.137754887342
    th_params: 0.166874244809
    th_params: 0.037945471704
    th_params: 0.0720070749521
    th_params: 0.0540893226862
    th_params: 0.073587924242
    th_params: 0.0559485293925
    th_params: 0.221935719252
    th_params: 0.131815075874
    th_params: 0.344776749611
    th_params: 0.0811644569039
    th_params: 0.159227222204
    th_params: 0.181619957089
    th_params: 0.066974952817
    th_params: 0.114949703217
    th_params: 0.0699919238687
    th_params: 0.0650624856353
    th_params: 0.139597684145
    th_params: 0.202126890421
    th_params: 0.131426110864
    th_params: 0.161508277059
    th_params: 0.0735449492931
    th_params: 0.038911793381
    th_params: 0.307522684336
    th_params: 0.277237385511
    th_params: 0.416611075401
    th_params: 0.165136605501
    th_params: 0.0574544295669
    th_params: 0.156388685107
    th_params: 0.149862125516
    th_params: 0.038871448487
    th_params: 0.212639704347
    th_params: 0.144051909447
    th_params: 0.275358200073
    th_params: 0.104037962854
    th_params: 0.209756761789
    th_params: 0.133694648743
    th_params: 0.137966871262
    th_params: 0.177499741316
    th_params: 0.24844764173
    th_params: 0.0866219997406
    th_params: 0.224910825491
    th_params: 0.0419800020754
    th_params: 0.100523464382
    th_params: 0.0920279547572
    th_params: 0.057852704078
    th_params: 0.0843127444386
    th_params: 0.075177334249
    th_params: 0.0816614851356
    th_params: 0.137549847364
    th_params: 0.237730354071
    th_params: 0.0882670804858
    th_params: 0.142674297094
    th_params: 0.0791019797325
    th_params: 0.121126584709
    th_params: 0.287223100662
    th_params: 0.178807020187
    th_params: 0.220130205154
    th_params: 0.0578440800309
    th_params: 0.0890607982874
    th_params: 0.273330450058
    th_params: 0.0550603680313
    th_params: 0.259385406971
    th_params: 0.137039199471
    th_params: 0.162003397942
    th_params: 0.0838637426496
    th_params: 0.186085999012
    th_params: 0.26563295722
    th_params: 0.0886750295758
    th_params: 0.161147728562
    th_params: 0.257869750261
    th_params: 0.060329169035
    th_params: 0.0734715014696
    th_params: 0.237794294953
    th_params: 0.0999360382557
    th_params: 0.182470053434
    th_params: 0.0260779019445
    th_params: 0.0676901862025
    th_params: 0.20417419076
    th_params: 0.113690964878
    th_params: 0.111957296729
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "ConvolutionRistretto"
  bottom: "conv2_1"
  top: "conv2_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2725.04907227
    th_layer_out: 4664.72900391
    th_params: 0.146471425891
    th_params: 0.124399021268
    th_params: 0.110960371792
    th_params: 0.0940627008677
    th_params: 0.0622123479843
    th_params: 0.101214520633
    th_params: 0.124582447112
    th_params: 0.108055457473
    th_params: 0.104080691934
    th_params: 0.110490985215
    th_params: 0.162982493639
    th_params: 0.126624986529
    th_params: 0.133511304855
    th_params: 0.159364461899
    th_params: 0.102604880929
    th_params: 0.0976083427668
    th_params: 0.142063170671
    th_params: 0.114586502314
    th_params: 0.1119999066
    th_params: 0.121835395694
    th_params: 0.15690998733
    th_params: 0.106214575469
    th_params: 0.11804202199
    th_params: 0.132415026426
    th_params: 0.118182875216
    th_params: 0.123108275235
    th_params: 0.0999297201633
    th_params: 0.2502617836
    th_params: 0.112861827016
    th_params: 0.147314921021
    th_params: 0.143884688616
    th_params: 0.0993530228734
    th_params: 0.0385303609073
    th_params: 0.108330622315
    th_params: 0.105086617172
    th_params: 0.0613504126668
    th_params: 0.0868151113391
    th_params: 0.0942198261619
    th_params: 0.135343745351
    th_params: 0.139481648803
    th_params: 0.0918749198318
    th_params: 0.124890036881
    th_params: 0.202370002866
    th_params: 0.137278854847
    th_params: 0.137998118997
    th_params: 0.098566673696
    th_params: 0.09089256078
    th_params: 0.13768927753
    th_params: 0.152376279235
    th_params: 0.203245893121
    th_params: 0.156692877412
    th_params: 0.138842046261
    th_params: 0.0824284702539
    th_params: 0.083992652595
    th_params: 0.100515581667
    th_params: 0.130001425743
    th_params: 0.157881319523
    th_params: 0.12089536339
    th_params: 0.116453751922
    th_params: 0.0873878523707
    th_params: 0.0941869094968
    th_params: 0.119637966156
    th_params: 0.143172010779
    th_params: 0.115887589753
    th_params: 0.0653420463204
    th_params: 0.0964603573084
    th_params: 0.087415330112
    th_params: 0.129685923457
    th_params: 0.151446461678
    th_params: 0.23846077919
    th_params: 0.137221485376
    th_params: 0.152360349894
    th_params: 0.0856068283319
    th_params: 0.104335568845
    th_params: 0.0934706702828
    th_params: 0.124851301312
    th_params: 0.166452109814
    th_params: 0.119780957699
    th_params: 0.0843091383576
    th_params: 0.148963183165
    th_params: 0.0822463035583
    th_params: 0.163869172335
    th_params: 0.150269940495
    th_params: 0.0955513641238
    th_params: 0.120964005589
    th_params: 0.277375727892
    th_params: 0.212541386485
    th_params: 0.13739618659
    th_params: 0.109517753124
    th_params: 0.118536740541
    th_params: 0.103164963424
    th_params: 0.0860597640276
    th_params: 0.0874389559031
    th_params: 0.11817971617
    th_params: 0.0724885091186
    th_params: 0.138335853815
    th_params: 0.0903544798493
    th_params: 0.141055271029
    th_params: 0.0939200073481
    th_params: 0.153943315148
    th_params: 0.216142475605
    th_params: 0.150671958923
    th_params: 0.181904375553
    th_params: 0.115654677153
    th_params: 0.109897315502
    th_params: 0.12014953047
    th_params: 0.107006430626
    th_params: 0.0799144357443
    th_params: 0.104865856469
    th_params: 0.0963013097644
    th_params: 0.0954260379076
    th_params: 0.090156249702
    th_params: 0.102166518569
    th_params: 0.192191541195
    th_params: 0.124032862484
    th_params: 0.166527152061
    th_params: 0.114830978215
    th_params: 0.121274523437
    th_params: 0.0867610573769
    th_params: 0.122101172805
    th_params: 0.0779033824801
    th_params: 0.098953537643
    th_params: 0.100406594574
    th_params: 0.100228980184
    th_params: 0.10732383281
    th_params: 0.224655151367
    th_params: 0.114098243415
    th_params: 0.106791548431
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 4664.72900391
    th_layer_out: 4664.72900391
  }
}
layer {
  name: "conv3_1"
  type: "ConvolutionRistretto"
  bottom: "pool2"
  top: "conv3_1"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 4664.72900391
    th_layer_out: 5489.68164062
    th_params: 0.0750598013401
    th_params: 0.0833846703172
    th_params: 0.544410824776
    th_params: 0.211871519685
    th_params: 0.112492635846
    th_params: 0.0749557092786
    th_params: 0.0548993647099
    th_params: 0.0991855412722
    th_params: 0.0617034807801
    th_params: 0.0865826159716
    th_params: 0.0613389089704
    th_params: 0.114603981376
    th_params: 0.116423457861
    th_params: 0.0768655911088
    th_params: 0.107171811163
    th_params: 0.126111805439
    th_params: 0.0680547133088
    th_params: 0.142578199506
    th_params: 0.216842263937
    th_params: 0.0678795725107
    th_params: 0.0717367678881
    th_params: 0.0629628896713
    th_params: 0.0846273079515
    th_params: 0.0798435136676
    th_params: 0.0626068338752
    th_params: 0.0852846652269
    th_params: 0.109854198992
    th_params: 0.132615149021
    th_params: 0.140429019928
    th_params: 0.180756315589
    th_params: 0.0716838985682
    th_params: 0.102612160146
    th_params: 0.0850422531366
    th_params: 0.120907269418
    th_params: 0.212953403592
    th_params: 0.0858045816422
    th_params: 0.0654953345656
    th_params: 0.0568547286093
    th_params: 0.113220475614
    th_params: 0.0776367634535
    th_params: 0.0959260389209
    th_params: 0.124652832747
    th_params: 0.0745607316494
    th_params: 0.13764975965
    th_params: 0.0496892519295
    th_params: 0.103477783501
    th_params: 0.156789213419
    th_params: 0.0589455291629
    th_params: 0.056151881814
    th_params: 0.0576347857714
    th_params: 0.131807535887
    th_params: 0.10342989862
    th_params: 0.0948637202382
    th_params: 0.084272287786
    th_params: 0.0515453405678
    th_params: 0.0688980743289
    th_params: 0.0928396210074
    th_params: 0.0484748035669
    th_params: 0.0574531145394
    th_params: 0.0929229781032
    th_params: 0.144707724452
    th_params: 0.0454040206969
    th_params: 0.0712699368596
    th_params: 0.0663949549198
    th_params: 0.0529143884778
    th_params: 0.0838275030255
    th_params: 0.122930876911
    th_params: 0.0622109547257
    th_params: 0.0949071422219
    th_params: 0.084456846118
    th_params: 0.0801825001836
    th_params: 0.0541274920106
    th_params: 0.113571643829
    th_params: 0.13795042038
    th_params: 0.0701612383127
    th_params: 0.0605986341834
    th_params: 0.102090597153
    th_params: 0.132386952639
    th_params: 0.0657237991691
    th_params: 0.131749168038
    th_params: 0.0777351930737
    th_params: 0.0999882370234
    th_params: 0.0579906255007
    th_params: 0.0957722663879
    th_params: 0.118218749762
    th_params: 0.320704698563
    th_params: 0.159026116133
    th_params: 0.306567966938
    th_params: 0.112670302391
    th_params: 0.0586181804538
    th_params: 0.0716122239828
    th_params: 0.0681992918253
    th_params: 0.0719558447599
    th_params: 0.093245960772
    th_params: 0.0864922180772
    th_params: 0.141477063298
    th_params: 0.0712608844042
    th_params: 0.137867569923
    th_params: 0.114688158035
    th_params: 0.142169415951
    th_params: 0.0687459409237
    th_params: 0.24951210618
    th_params: 0.0770175382495
    th_params: 0.11665122211
    th_params: 0.0992042720318
    th_params: 0.109316550195
    th_params: 0.045090764761
    th_params: 0.104742385447
    th_params: 0.0727929919958
    th_params: 0.0787915885448
    th_params: 0.065298601985
    th_params: 0.1615331918
    th_params: 0.0699584707618
    th_params: 0.0467743054032
    th_params: 0.0568656213582
    th_params: 0.123810388148
    th_params: 0.0866332948208
    th_params: 0.0549333393574
    th_params: 0.100639924407
    th_params: 0.0862888097763
    th_params: 0.0824913159013
    th_params: 0.0387868210673
    th_params: 0.0905882716179
    th_params: 0.0951787829399
    th_params: 0.0726277604699
    th_params: 0.10537686944
    th_params: 0.127655535936
    th_params: 0.140461415052
    th_params: 0.0935816764832
    th_params: 0.114134699106
    th_params: 0.196259990335
    th_params: 0.14768332243
    th_params: 0.148281767964
    th_params: 0.227940425277
    th_params: 0.0722128376365
    th_params: 0.10027564317
    th_params: 0.082026399672
    th_params: 0.101455748081
    th_params: 0.11734021455
    th_params: 0.0690432563424
    th_params: 0.0557390674949
    th_params: 0.131918385625
    th_params: 0.183236286044
    th_params: 0.0921599939466
    th_params: 0.125188022852
    th_params: 0.127785891294
    th_params: 0.121221750975
    th_params: 0.0497897937894
    th_params: 0.0760585144162
    th_params: 0.0575990304351
    th_params: 0.0520221367478
    th_params: 0.0936184152961
    th_params: 0.0530671775341
    th_params: 0.080555409193
    th_params: 0.0723916515708
    th_params: 0.13679933548
    th_params: 0.246968597174
    th_params: 0.154832825065
    th_params: 0.209684565663
    th_params: 0.286583185196
    th_params: 0.118496909738
    th_params: 0.0859059467912
    th_params: 0.0695756673813
    th_params: 0.0836942493916
    th_params: 0.131376355886
    th_params: 0.0596860982478
    th_params: 0.0904557257891
    th_params: 0.0692562684417
    th_params: 0.105432607234
    th_params: 0.120897307992
    th_params: 0.0985663607717
    th_params: 0.0500893034041
    th_params: 0.179261893034
    th_params: 0.0614321045578
    th_params: 0.047134462744
    th_params: 0.0811085030437
    th_params: 0.0705293267965
    th_params: 0.0948718339205
    th_params: 0.0542142242193
    th_params: 0.12912529707
    th_params: 0.0557574369013
    th_params: 0.0563106834888
    th_params: 0.0685009360313
    th_params: 0.0604824796319
    th_params: 0.061942614615
    th_params: 0.0967476740479
    th_params: 0.0662652626634
    th_params: 0.163924708962
    th_params: 0.0753622725606
    th_params: 0.0952039211988
    th_params: 0.0466033518314
    th_params: 0.177746802568
    th_params: 0.100467711687
    th_params: 0.0871909707785
    th_params: 0.0889560580254
    th_params: 0.0975156277418
    th_params: 0.0776697099209
    th_params: 0.0729020237923
    th_params: 0.0657341107726
    th_params: 0.0521044582129
    th_params: 0.0928993970156
    th_params: 0.207196876407
    th_params: 0.0809238255024
    th_params: 0.282662928104
    th_params: 0.0737514570355
    th_params: 0.102547109127
    th_params: 0.141005024314
    th_params: 0.189268276095
    th_params: 0.0859664306045
    th_params: 0.0954351872206
    th_params: 0.103412315249
    th_params: 0.157645270228
    th_params: 0.156414031982
    th_params: 0.061408020556
    th_params: 0.176218956709
    th_params: 0.0703434795141
    th_params: 0.0996184796095
    th_params: 0.0663943439722
    th_params: 0.0646317452192
    th_params: 0.155490860343
    th_params: 0.073394998908
    th_params: 0.0643214061856
    th_params: 0.097427919507
    th_params: 0.111027784646
    th_params: 0.0652701556683
    th_params: 0.0695521011949
    th_params: 0.0667355880141
    th_params: 0.175651669502
    th_params: 0.198154464364
    th_params: 0.0759130939841
    th_params: 0.0711480155587
    th_params: 0.0834164693952
    th_params: 0.0879146978259
    th_params: 0.0563313513994
    th_params: 0.0547719597816
    th_params: 0.069040581584
    th_params: 0.1091222018
    th_params: 0.0816912427545
    th_params: 0.0842738002539
    th_params: 0.0783120989799
    th_params: 0.0719586461782
    th_params: 0.0633555576205
    th_params: 0.0862893164158
    th_params: 0.104853488505
    th_params: 0.0876177996397
    th_params: 0.0974914804101
    th_params: 0.0968119129539
    th_params: 0.0784316435456
    th_params: 0.107065990567
    th_params: 0.0543684400618
    th_params: 0.132930889726
    th_params: 0.080936126411
    th_params: 0.171487540007
    th_params: 0.0511035658419
    th_params: 0.118136510253
    th_params: 0.0587133392692
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "ConvolutionRistretto"
  bottom: "conv3_1"
  top: "conv3_2"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 5489.68164062
    th_layer_out: 5613.63085938
    th_params: 0.0773969069123
    th_params: 0.0502400510013
    th_params: 0.0561800338328
    th_params: 0.0512528344989
    th_params: 0.0519736744463
    th_params: 0.0717992931604
    th_params: 0.0873357802629
    th_params: 0.0881342217326
    th_params: 0.325255066156
    th_params: 0.0815453752875
    th_params: 0.0960764363408
    th_params: 0.0683055818081
    th_params: 0.0552975870669
    th_params: 0.0965171456337
    th_params: 0.109354518354
    th_params: 0.0619420744479
    th_params: 0.0608905442059
    th_params: 0.159171968699
    th_params: 0.360923916101
    th_params: 0.0580862164497
    th_params: 0.0501526817679
    th_params: 0.0894025117159
    th_params: 0.0643442869186
    th_params: 0.0613406598568
    th_params: 0.158946201205
    th_params: 0.0443994104862
    th_params: 0.0903144776821
    th_params: 0.095531642437
    th_params: 0.096916526556
    th_params: 0.0365732647479
    th_params: 0.0564448684454
    th_params: 0.052069325
    th_params: 0.0830238610506
    th_params: 0.118583664298
    th_params: 0.0602526850998
    th_params: 0.0793489590287
    th_params: 0.130920037627
    th_params: 0.0770165771246
    th_params: 0.0426584370434
    th_params: 0.0615655630827
    th_params: 0.0751874670386
    th_params: 0.046663377434
    th_params: 0.0565791204572
    th_params: 0.0922322273254
    th_params: 0.0540998317301
    th_params: 0.078910022974
    th_params: 0.0795785039663
    th_params: 0.0486305058002
    th_params: 0.131834164262
    th_params: 0.0648683607578
    th_params: 0.103603169322
    th_params: 0.0464949309826
    th_params: 0.0481965616345
    th_params: 0.106618575752
    th_params: 0.0793696269393
    th_params: 0.0822998583317
    th_params: 0.0964647009969
    th_params: 0.120486445725
    th_params: 0.0876432135701
    th_params: 0.165106520057
    th_params: 0.104871809483
    th_params: 0.0726835355163
    th_params: 0.0669497475028
    th_params: 0.0783460661769
    th_params: 0.131570890546
    th_params: 0.459316343069
    th_params: 0.0590193085372
    th_params: 0.0676455423236
    th_params: 0.0678427442908
    th_params: 0.0433057621121
    th_params: 0.0667374506593
    th_params: 0.0704573318362
    th_params: 0.0660301297903
    th_params: 0.0495140403509
    th_params: 0.125125512481
    th_params: 0.0628753900528
    th_params: 0.0400232747197
    th_params: 0.0653698071837
    th_params: 0.091330960393
    th_params: 0.120202429593
    th_params: 0.0533956289291
    th_params: 0.0411303676665
    th_params: 0.0554030947387
    th_params: 0.0757964327931
    th_params: 0.0592206604779
    th_params: 0.0883243605494
    th_params: 0.066163122654
    th_params: 0.0410725474358
    th_params: 0.0629401877522
    th_params: 0.0994011536241
    th_params: 0.0830670148134
    th_params: 0.0472789779305
    th_params: 0.0517754070461
    th_params: 0.105473265052
    th_params: 0.0415295884013
    th_params: 0.0773225650191
    th_params: 0.0628404468298
    th_params: 0.1299790591
    th_params: 0.103726200759
    th_params: 0.0604765862226
    th_params: 0.0685233920813
    th_params: 0.0443918406963
    th_params: 0.142393440008
    th_params: 0.041198246181
    th_params: 0.0638812109828
    th_params: 0.132955476642
    th_params: 0.0539858080447
    th_params: 0.0907224789262
    th_params: 0.163489073515
    th_params: 0.0588043406606
    th_params: 0.0508643090725
    th_params: 0.0885718986392
    th_params: 0.0447105579078
    th_params: 0.0721634402871
    th_params: 0.0607406385243
    th_params: 0.0478862859309
    th_params: 0.052414085716
    th_params: 0.0943227782845
    th_params: 0.101043768227
    th_params: 0.0523774139583
    th_params: 0.0570053234696
    th_params: 0.0716575533152
    th_params: 0.0422795601189
    th_params: 0.0480174645782
    th_params: 0.051489777863
    th_params: 0.0627630650997
    th_params: 0.0643336698413
    th_params: 0.121975943446
    th_params: 0.177105024457
    th_params: 0.0609804876149
    th_params: 0.0438800528646
    th_params: 0.0423304326832
    th_params: 0.0969242453575
    th_params: 0.0749155580997
    th_params: 0.0908904224634
    th_params: 0.0740521922708
    th_params: 0.068898037076
    th_params: 0.19859200716
    th_params: 0.228914901614
    th_params: 0.0778383240104
    th_params: 0.093186981976
    th_params: 0.0741344839334
    th_params: 0.22520826757
    th_params: 0.102360904217
    th_params: 0.0820137709379
    th_params: 0.0567736029625
    th_params: 0.130482509732
    th_params: 0.0849868133664
    th_params: 0.0832651481032
    th_params: 0.0636266171932
    th_params: 0.0513586550951
    th_params: 0.0729747638106
    th_params: 0.0502980686724
    th_params: 0.0698565617204
    th_params: 0.0906128957868
    th_params: 0.0457616150379
    th_params: 0.115082859993
    th_params: 0.0952982902527
    th_params: 0.0808748081326
    th_params: 0.0726003199816
    th_params: 0.071822360158
    th_params: 0.108579158783
    th_params: 0.0603525824845
    th_params: 0.058470133692
    th_params: 0.0535763204098
    th_params: 0.185065835714
    th_params: 0.0984490737319
    th_params: 0.107626162469
    th_params: 0.105038121343
    th_params: 0.0662945583463
    th_params: 0.0582555048168
    th_params: 0.0955685824156
    th_params: 0.0781370773911
    th_params: 0.0852831974626
    th_params: 0.142013207078
    th_params: 0.0646732747555
    th_params: 0.0682671144605
    th_params: 0.0451141111553
    th_params: 0.0582657791674
    th_params: 0.0777548924088
    th_params: 0.153715863824
    th_params: 0.0509121753275
    th_params: 0.0838971361518
    th_params: 0.0637895986438
    th_params: 0.0572006925941
    th_params: 0.0796445161104
    th_params: 0.0812728852034
    th_params: 0.0600962415338
    th_params: 0.0560764744878
    th_params: 0.062520749867
    th_params: 0.0613973177969
    th_params: 0.0571368038654
    th_params: 0.0740009993315
    th_params: 0.107286512852
    th_params: 0.137630984187
    th_params: 0.0955114886165
    th_params: 0.0568682402372
    th_params: 0.114304833114
    th_params: 0.0682579353452
    th_params: 0.0923029184341
    th_params: 0.0526944771409
    th_params: 0.0708264485002
    th_params: 0.0518655404449
    th_params: 0.0746170654893
    th_params: 0.0314362049103
    th_params: 0.0662707462907
    th_params: 0.102328062057
    th_params: 0.0826775953174
    th_params: 0.0504190772772
    th_params: 0.0539265349507
    th_params: 0.0693376883864
    th_params: 0.11199080199
    th_params: 0.0428518503904
    th_params: 0.0783272981644
    th_params: 0.0920004621148
    th_params: 0.0597675293684
    th_params: 0.093034029007
    th_params: 0.0484732426703
    th_params: 0.0543884523213
    th_params: 0.0570915304124
    th_params: 0.0533198937774
    th_params: 0.0599830821157
    th_params: 0.169947549701
    th_params: 0.0820240527391
    th_params: 0.0991879105568
    th_params: 0.0510717071593
    th_params: 0.0486376062036
    th_params: 0.0598250813782
    th_params: 0.0965489670634
    th_params: 0.103043116629
    th_params: 0.103086531162
    th_params: 0.061455257237
    th_params: 0.0857843160629
    th_params: 0.100142806768
    th_params: 0.080749630928
    th_params: 0.0527804456651
    th_params: 0.0952357128263
    th_params: 0.073590554297
    th_params: 0.0572532527149
    th_params: 0.0601472295821
    th_params: 0.0737210214138
    th_params: 0.0756693556905
    th_params: 0.0672411397099
    th_params: 0.116647019982
    th_params: 0.141230732203
    th_params: 0.067436799407
    th_params: 0.0728615820408
    th_params: 0.0804225504398
    th_params: 0.0690477341413
    th_params: 0.0750787556171
    th_params: 0.0600427314639
    th_params: 0.0565367676318
    th_params: 0.089980147779
    th_params: 0.0618768706918
    th_params: 0.0459028370678
    th_params: 0.0720842182636
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "ConvolutionRistretto"
  bottom: "conv3_2"
  top: "conv3_3"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 5613.63085938
    th_layer_out: 5814.64941406
    th_params: 0.0722756236792
    th_params: 0.0642979517579
    th_params: 0.146006017923
    th_params: 0.0620319396257
    th_params: 0.0729344338179
    th_params: 0.0579160153866
    th_params: 0.107914529741
    th_params: 0.0857824683189
    th_params: 0.243512585759
    th_params: 0.149399533868
    th_params: 0.0471785962582
    th_params: 0.0691735520959
    th_params: 0.0674566701055
    th_params: 0.100772641599
    th_params: 0.203833431005
    th_params: 0.0837053209543
    th_params: 0.0919663831592
    th_params: 0.0753942653537
    th_params: 0.0601025335491
    th_params: 0.172025218606
    th_params: 0.0969400405884
    th_params: 0.0563578419387
    th_params: 0.0992710664868
    th_params: 0.210276395082
    th_params: 0.0548889562488
    th_params: 0.0906179025769
    th_params: 0.101041041315
    th_params: 0.103705406189
    th_params: 0.0696752294898
    th_params: 0.072240523994
    th_params: 0.0800066962838
    th_params: 0.0432257018983
    th_params: 0.068185724318
    th_params: 0.0568231232464
    th_params: 0.0782535821199
    th_params: 0.111405752599
    th_params: 0.0596877969801
    th_params: 0.31952098012
    th_params: 0.119165971875
    th_params: 0.0884270071983
    th_params: 0.0691788345575
    th_params: 0.0667670443654
    th_params: 0.052696492523
    th_params: 0.0376783907413
    th_params: 0.391537368298
    th_params: 0.106866292655
    th_params: 0.0670272782445
    th_params: 0.1070259884
    th_params: 0.0686025545001
    th_params: 0.0774834156036
    th_params: 0.0701698511839
    th_params: 0.0752906128764
    th_params: 0.123054914176
    th_params: 0.0640231445432
    th_params: 0.293392777443
    th_params: 0.0648285970092
    th_params: 0.158321499825
    th_params: 0.0792452469468
    th_params: 0.0857618749142
    th_params: 0.061378121376
    th_params: 0.0828159153461
    th_params: 0.0540635958314
    th_params: 0.111807949841
    th_params: 0.111274726689
    th_params: 0.104181081057
    th_params: 0.128318846226
    th_params: 0.0641431733966
    th_params: 0.0708569660783
    th_params: 0.0467607416213
    th_params: 0.224581256509
    th_params: 0.0768588259816
    th_params: 0.0439682342112
    th_params: 0.0443278178573
    th_params: 0.0817554816604
    th_params: 0.0810151323676
    th_params: 0.21091106534
    th_params: 0.0965197831392
    th_params: 0.0756894722581
    th_params: 0.0933155789971
    th_params: 0.067315839231
    th_params: 0.079357393086
    th_params: 0.0591878592968
    th_params: 0.0657408758998
    th_params: 0.0818462595344
    th_params: 0.15712569654
    th_params: 0.0781332403421
    th_params: 0.0659539848566
    th_params: 0.071315638721
    th_params: 0.0814039707184
    th_params: 0.0466317422688
    th_params: 0.0796046331525
    th_params: 0.0861747041345
    th_params: 0.108747497201
    th_params: 0.145244076848
    th_params: 0.0553163513541
    th_params: 0.0918947458267
    th_params: 0.129981905222
    th_params: 0.0627472624183
    th_params: 0.0716804414988
    th_params: 0.0508234649897
    th_params: 0.106930941343
    th_params: 0.108087606728
    th_params: 0.0984504446387
    th_params: 0.0624201968312
    th_params: 0.0524874441326
    th_params: 0.072420053184
    th_params: 0.080306276679
    th_params: 0.080490514636
    th_params: 0.0932067260146
    th_params: 0.0722589045763
    th_params: 0.0674985274673
    th_params: 0.0694857686758
    th_params: 0.0854309052229
    th_params: 0.0810516178608
    th_params: 0.0706433728337
    th_params: 0.0898570418358
    th_params: 0.0717280060053
    th_params: 0.107998669147
    th_params: 0.0642032921314
    th_params: 0.056115038693
    th_params: 0.0879602879286
    th_params: 0.0930214077234
    th_params: 0.13574232161
    th_params: 0.102846324444
    th_params: 0.142034724355
    th_params: 0.0801724642515
    th_params: 0.100255154073
    th_params: 0.0588068179786
    th_params: 0.125203832984
    th_params: 0.05418029055
    th_params: 0.0844964906573
    th_params: 0.0659471079707
    th_params: 0.0641279816628
    th_params: 0.0662774369121
    th_params: 0.0529938042164
    th_params: 0.150148272514
    th_params: 0.111922986805
    th_params: 0.082629814744
    th_params: 0.158064812422
    th_params: 0.178108304739
    th_params: 0.0611558929086
    th_params: 0.0879524797201
    th_params: 0.0817972272635
    th_params: 0.0638869255781
    th_params: 0.0876622051001
    th_params: 0.119098618627
    th_params: 0.0803651884198
    th_params: 0.0541821047664
    th_params: 0.0432249717414
    th_params: 0.0566275939345
    th_params: 0.0489660315216
    th_params: 0.125805586576
    th_params: 0.179684266448
    th_params: 0.079955264926
    th_params: 0.103918559849
    th_params: 0.0854915678501
    th_params: 0.0558369867504
    th_params: 0.0888751223683
    th_params: 0.0960356071591
    th_params: 0.141096040606
    th_params: 0.0607067160308
    th_params: 0.102174982429
    th_params: 0.080739185214
    th_params: 0.107740826905
    th_params: 0.101448461413
    th_params: 0.128435149789
    th_params: 0.0734529644251
    th_params: 0.0692452713847
    th_params: 0.196492686868
    th_params: 0.0507708974183
    th_params: 0.107118971646
    th_params: 0.193964853883
    th_params: 0.0839254707098
    th_params: 0.0696700885892
    th_params: 0.148782089353
    th_params: 0.08574013412
    th_params: 0.121641658247
    th_params: 0.107870802283
    th_params: 0.0370931960642
    th_params: 0.0925176888704
    th_params: 0.166134133935
    th_params: 0.0709753856063
    th_params: 0.0883589088917
    th_params: 0.0434001721442
    th_params: 0.0605856962502
    th_params: 0.103709585965
    th_params: 0.098229072988
    th_params: 0.116406470537
    th_params: 0.0705792233348
    th_params: 0.123677052557
    th_params: 0.0589465685189
    th_params: 0.0709533765912
    th_params: 0.071167550981
    th_params: 0.0592361986637
    th_params: 0.0652176365256
    th_params: 0.0789678767323
    th_params: 0.147642999887
    th_params: 0.060448307544
    th_params: 0.0742132514715
    th_params: 0.0904187113047
    th_params: 0.105393327773
    th_params: 0.075222119689
    th_params: 0.0494848899543
    th_params: 0.0591717027128
    th_params: 0.124566979706
    th_params: 0.0602113232017
    th_params: 0.101016506553
    th_params: 0.0565280579031
    th_params: 0.0738285109401
    th_params: 0.0834436118603
    th_params: 0.0550676360726
    th_params: 0.0704646259546
    th_params: 0.0708567947149
    th_params: 0.0830406546593
    th_params: 0.0522354468703
    th_params: 0.131930142641
    th_params: 0.0878989323974
    th_params: 0.101416386664
    th_params: 0.0665304586291
    th_params: 0.0863764211535
    th_params: 0.11147338897
    th_params: 0.136019557714
    th_params: 0.0661207288504
    th_params: 0.0562666095793
    th_params: 0.0649766325951
    th_params: 0.0451425015926
    th_params: 0.104608558118
    th_params: 0.0928946211934
    th_params: 0.130363449454
    th_params: 0.350211918354
    th_params: 0.0556673705578
    th_params: 0.0814340263605
    th_params: 0.140464186668
    th_params: 0.197379380465
    th_params: 0.055890057236
    th_params: 0.0620558857918
    th_params: 0.116860032082
    th_params: 0.044528324157
    th_params: 0.0902275294065
    th_params: 0.153865456581
    th_params: 0.06549795717
    th_params: 0.0936775505543
    th_params: 0.0741234719753
    th_params: 0.0766153037548
    th_params: 0.103570230305
    th_params: 0.181713864207
    th_params: 0.0757663249969
    th_params: 0.0559149608016
    th_params: 0.0588689595461
    th_params: 0.0673037022352
    th_params: 0.0763992518187
    th_params: 0.0777461305261
    th_params: 0.0442281998694
    th_params: 0.0677857771516
    th_params: 0.058758161962
    th_params: 0.0921722874045
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 5814.64941406
    th_layer_out: 5814.64941406
  }
}
layer {
  name: "conv4_1"
  type: "ConvolutionRistretto"
  bottom: "pool3"
  top: "conv4_1"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 5814.64941406
    th_layer_out: 4321.03320312
    th_params: 0.0516097024083
    th_params: 0.0801029875875
    th_params: 0.0628733411431
    th_params: 0.067054130137
    th_params: 0.0367863066494
    th_params: 0.0601271279156
    th_params: 0.0562423244119
    th_params: 0.128131061792
    th_params: 0.0357815250754
    th_params: 0.0368608087301
    th_params: 0.0373120903969
    th_params: 0.055168967694
    th_params: 0.120242998004
    th_params: 0.0348325446248
    th_params: 0.0499349609017
    th_params: 0.0516394563019
    th_params: 0.074781358242
    th_params: 0.0687217786908
    th_params: 0.0520428046584
    th_params: 0.044039580971
    th_params: 0.0411926992238
    th_params: 0.0399484448135
    th_params: 0.112401582301
    th_params: 0.0478529073298
    th_params: 0.0562655478716
    th_params: 0.0603003129363
    th_params: 0.0472213476896
    th_params: 0.0709872543812
    th_params: 0.0528737530112
    th_params: 0.044384714216
    th_params: 0.069197319448
    th_params: 0.0393346212804
    th_params: 0.0412682183087
    th_params: 0.0396675057709
    th_params: 0.0320920497179
    th_params: 0.0463321879506
    th_params: 0.1465151757
    th_params: 0.247792080045
    th_params: 0.0445632822812
    th_params: 0.139550060034
    th_params: 0.0420681573451
    th_params: 0.0745685696602
    th_params: 0.0425429493189
    th_params: 0.0579311288893
    th_params: 0.0657874494791
    th_params: 0.197922438383
    th_params: 0.0590519011021
    th_params: 0.0516194291413
    th_params: 0.0402517020702
    th_params: 0.100517787039
    th_params: 0.046426281333
    th_params: 0.125948086381
    th_params: 0.0874415710568
    th_params: 0.115263298154
    th_params: 0.0308049898595
    th_params: 0.0471090003848
    th_params: 0.0582889430225
    th_params: 0.0402853786945
    th_params: 0.0652265101671
    th_params: 0.183323249221
    th_params: 0.0721314921975
    th_params: 0.057862393558
    th_params: 0.0526587180793
    th_params: 0.0909983664751
    th_params: 0.0786523148417
    th_params: 0.0375071875751
    th_params: 0.0496980287135
    th_params: 0.0662103146315
    th_params: 0.0634808316827
    th_params: 0.0388532616198
    th_params: 0.0401926375926
    th_params: 0.0866602882743
    th_params: 0.0734317600727
    th_params: 0.0354132391512
    th_params: 0.0524437986314
    th_params: 0.153756782413
    th_params: 0.035552740097
    th_params: 0.0428385399282
    th_params: 0.0548828914762
    th_params: 0.0750985369086
    th_params: 0.0549354404211
    th_params: 0.0369963720441
    th_params: 0.062517888844
    th_params: 0.166091114283
    th_params: 0.0432608649135
    th_params: 0.0434130504727
    th_params: 0.0456212423742
    th_params: 0.0718270987272
    th_params: 0.0467738136649
    th_params: 0.0652157440782
    th_params: 0.124450899661
    th_params: 0.0438703708351
    th_params: 0.0320364609361
    th_params: 0.030875235796
    th_params: 0.0356539152563
    th_params: 0.0353759117424
    th_params: 0.0397201292217
    th_params: 0.0435519441962
    th_params: 0.0377418249846
    th_params: 0.0537614673376
    th_params: 0.0440402887762
    th_params: 0.0914052054286
    th_params: 0.092641890049
    th_params: 0.0438099429011
    th_params: 0.0383805446327
    th_params: 0.0879740193486
    th_params: 0.0746711194515
    th_params: 0.0610324703157
    th_params: 0.0734873786569
    th_params: 0.0426982492208
    th_params: 0.0380781963468
    th_params: 0.0414486192167
    th_params: 0.0737265720963
    th_params: 0.069954790175
    th_params: 0.0689250826836
    th_params: 0.0674859210849
    th_params: 0.0667957961559
    th_params: 0.117992520332
    th_params: 0.0448140315711
    th_params: 0.061909917742
    th_params: 0.0392425172031
    th_params: 0.063250079751
    th_params: 0.0375171639025
    th_params: 0.0553039871156
    th_params: 0.0762649998069
    th_params: 0.0722782164812
    th_params: 0.313882261515
    th_params: 0.081717222929
    th_params: 0.0539766401052
    th_params: 0.0394978225231
    th_params: 0.0546231493354
    th_params: 0.0372861325741
    th_params: 0.055875889957
    th_params: 0.0495251640677
    th_params: 0.0430972166359
    th_params: 0.0507369637489
    th_params: 0.043211735785
    th_params: 0.0448877476156
    th_params: 0.0595842525363
    th_params: 0.0367364957929
    th_params: 0.0358158536255
    th_params: 0.120525665581
    th_params: 0.0741693675518
    th_params: 0.0591419041157
    th_params: 0.0482990331948
    th_params: 0.111135751009
    th_params: 0.0446354150772
    th_params: 0.175947129726
    th_params: 0.0464276075363
    th_params: 0.0506594926119
    th_params: 0.0432862639427
    th_params: 0.0526243560016
    th_params: 0.1062919572
    th_params: 0.103719517589
    th_params: 0.0434288643301
    th_params: 0.0497222542763
    th_params: 0.0841309279203
    th_params: 0.0676066949964
    th_params: 0.0472948439419
    th_params: 0.0449247956276
    th_params: 0.0365253351629
    th_params: 0.0433223620057
    th_params: 0.0625396296382
    th_params: 0.0650383010507
    th_params: 0.0437830351293
    th_params: 0.0377730242908
    th_params: 0.073595136404
    th_params: 0.0457289218903
    th_params: 0.045043092221
    th_params: 0.106526128948
    th_params: 0.0464900508523
    th_params: 0.0487247221172
    th_params: 0.0741358026862
    th_params: 0.0472903326154
    th_params: 0.0616899542511
    th_params: 0.0489667467773
    th_params: 0.036664839834
    th_params: 0.0828326046467
    th_params: 0.0483617708087
    th_params: 0.112188614905
    th_params: 0.0468486696482
    th_params: 0.0338201336563
    th_params: 0.0367459468544
    th_params: 0.0977122113109
    th_params: 0.0347678512335
    th_params: 0.0604386031628
    th_params: 0.0457366965711
    th_params: 0.0546679906547
    th_params: 0.0566408708692
    th_params: 0.0809339359403
    th_params: 0.0721868425608
    th_params: 0.10552135855
    th_params: 0.0703910067677
    th_params: 0.0355207771063
    th_params: 0.0340988859534
    th_params: 0.0685569420457
    th_params: 0.0329657457769
    th_params: 0.0422801077366
    th_params: 0.036206420511
    th_params: 0.073369987309
    th_params: 0.0347673296928
    th_params: 0.0561244189739
    th_params: 0.055472753942
    th_params: 0.0706153512001
    th_params: 0.0448235422373
    th_params: 0.0406364239752
    th_params: 0.0601428933442
    th_params: 0.0382316969335
    th_params: 0.0936313420534
    th_params: 0.0455959327519
    th_params: 0.0680250450969
    th_params: 0.0453079305589
    th_params: 0.0421120896935
    th_params: 0.0745822489262
    th_params: 0.0639883205295
    th_params: 0.0364035367966
    th_params: 0.0576847456396
    th_params: 0.0495162978768
    th_params: 0.0393341630697
    th_params: 0.0394116938114
    th_params: 0.0504092089832
    th_params: 0.0983277931809
    th_params: 0.0468354970217
    th_params: 0.0477509945631
    th_params: 0.0586657300591
    th_params: 0.0464205183089
    th_params: 0.0578065142035
    th_params: 0.0462794192135
    th_params: 0.0307123921812
    th_params: 0.0514749363065
    th_params: 0.0983111262321
    th_params: 0.0550243109465
    th_params: 0.0844844803214
    th_params: 0.0279423948377
    th_params: 0.0724106058478
    th_params: 0.0717447921634
    th_params: 0.137481883168
    th_params: 0.0810595303774
    th_params: 0.0594195835292
    th_params: 0.0693739429116
    th_params: 0.102961800992
    th_params: 0.0584432482719
    th_params: 0.0482947863638
    th_params: 0.0435226112604
    th_params: 0.0561930499971
    th_params: 0.0757629573345
    th_params: 0.0563468970358
    th_params: 0.0536291673779
    th_params: 0.0609760731459
    th_params: 0.0465830266476
    th_params: 0.0861422345042
    th_params: 0.0775113850832
    th_params: 0.0408822447062
    th_params: 0.0320601798594
    th_params: 0.0660690590739
    th_params: 0.0323649048805
    th_params: 0.140048965812
    th_params: 0.0446224920452
    th_params: 0.0914764478803
    th_params: 0.052263982594
    th_params: 0.0423776321113
    th_params: 0.0550891831517
    th_params: 0.0611512437463
    th_params: 0.0521732643247
    th_params: 0.0450275018811
    th_params: 0.0435725711286
    th_params: 0.0566704981029
    th_params: 0.0441553257406
    th_params: 0.0674106031656
    th_params: 0.0545023791492
    th_params: 0.0555165968835
    th_params: 0.03141528368
    th_params: 0.0388814136386
    th_params: 0.0505321025848
    th_params: 0.0335098393261
    th_params: 0.0423976145685
    th_params: 0.0432248264551
    th_params: 0.11205778271
    th_params: 0.0442233867943
    th_params: 0.0840423256159
    th_params: 0.0402153283358
    th_params: 0.0577069334686
    th_params: 0.0670687779784
    th_params: 0.0559611804783
    th_params: 0.0332462713122
    th_params: 0.050364010036
    th_params: 0.0644837096334
    th_params: 0.0469391904771
    th_params: 0.0537050701678
    th_params: 0.0470304042101
    th_params: 0.0687381029129
    th_params: 0.0422921329737
    th_params: 0.0460873171687
    th_params: 0.0526922978461
    th_params: 0.0550745353103
    th_params: 0.0434085763991
    th_params: 0.0527864247561
    th_params: 0.0481076389551
    th_params: 0.0407759808004
    th_params: 0.0639667958021
    th_params: 0.0388504341245
    th_params: 0.0471028648317
    th_params: 0.0484833158553
    th_params: 0.0575422570109
    th_params: 0.0421518646181
    th_params: 0.0740942880511
    th_params: 0.055236864835
    th_params: 0.0324635133147
    th_params: 0.0554941110313
    th_params: 0.0410536117852
    th_params: 0.115113154054
    th_params: 0.0571470372379
    th_params: 0.044738791883
    th_params: 0.0555454231799
    th_params: 0.0541224479675
    th_params: 0.0396794229746
    th_params: 0.0570676326752
    th_params: 0.0474852286279
    th_params: 0.044700756669
    th_params: 0.0540342107415
    th_params: 0.0536751896143
    th_params: 0.0533883012831
    th_params: 0.0388076975942
    th_params: 0.0356245115399
    th_params: 0.0513527989388
    th_params: 0.0549224279821
    th_params: 0.0543874949217
    th_params: 0.0392797812819
    th_params: 0.0312109962106
    th_params: 0.0359627045691
    th_params: 0.0453946664929
    th_params: 0.0437993444502
