name: "ResNet-50"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 8
    th_layer_out: 254.0
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 254.0
    th_layer_out: 15.875
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
    th_params: 0.031005859375
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
  }
}
layer {
  name: "res2a_branch1"
  type: "ConvolutionRistretto"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
  }
}
layer {
  name: "res2a_branch2a"
  type: "ConvolutionRistretto"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "ConvolutionRistretto"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2c"
  type: "ConvolutionRistretto"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "ConvolutionRistretto"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "ConvolutionRistretto"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 7.9375
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
}
layer {
  name: "res2b_branch2c"
  type: "ConvolutionRistretto"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 7.9375
    th_layer_out: 15.875
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "ConvolutionRistretto"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 7.9375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "ConvolutionRistretto"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 7.9375
    th_layer_out: 7.9375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
    th_params: 0.49609375
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
}
layer {
  name: "res2c_branch2c"
  type: "ConvolutionRistretto"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 7.9375
    th_layer_out: 15.875
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
    th_params: 1.984375
  }
}
layer {
  name: "res2c"
  type: "Eltwise"
  bottom: "res2b"
  bottom: "res2c_branch2c"
  top: "res2c"
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
  }
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "res3a_branch1"
  type: "ConvolutionRistretto"
  bottom: "res2c"
  top: "res3a_branch1"
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 15.875
    th_layer_out: 15.875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
    th_params: 0.9921875
