name: "MobileNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0170000009239
    mirror: false
    crop_size: 224
    mean_value: 103.940002441
    mean_value: 116.779998779
    mean_value: 123.680000305
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 32
    backend: LMDB
  }
  quantization_param {
    bw_layer_out: 8
    th_layer_out: 2.56860518456
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0170000009239
    mirror: false
    crop_size: 224
    mean_value: 103.940002441
    mean_value: 116.779998779
    mean_value: 123.680000305
  }
  data_param {
    source: "/data/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "ConvolutionRistretto"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2.56860518456
    th_layer_out: 2.29025554657
    th_params: 1.0585493726e-07
    th_params: 0.03360247612
    th_params: 0.263408660889
    th_params: 0.0748583227396
    th_params: 0.111705064774
    th_params: 0.381695985794
    th_params: 0.0374942310154
    th_params: 0.0282727628946
    th_params: 3.00098662365e-07
    th_params: 1.04237085452e-06
    th_params: 8.46531406751e-07
    th_params: 0.0341144166887
    th_params: 0.0307533107698
    th_params: 3.73951763777e-07
    th_params: 1.50295662138e-07
    th_params: 0.190808489919
    th_params: 0.223095297813
    th_params: 0.230555921793
    th_params: 0.0757199600339
    th_params: 0.0178203564137
    th_params: 0.13266608119
    th_params: 0.0579694099724
    th_params: 5.63996067626e-08
    th_params: 0.257118940353
    th_params: 0.0469348654151
    th_params: 1.67178271226e-07
    th_params: 6.54188511362e-07
    th_params: 7.2207831181e-07
    th_params: 0.30911898613
    th_params: 1.59565149715e-06
    th_params: 0.10379909724
    th_params: 0.241647839546
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2_1/dw"
  type: "ConvolutionRistretto"
  bottom: "conv1"
  top: "conv2_1/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2.29025554657
    th_layer_out: 3.446829319
    th_params: 0.000160832030815
    th_params: 2.54034686089
    th_params: 2.31065225601
    th_params: 1.36456871033
    th_params: 0.546223163605
    th_params: 2.22992300987
    th_params: 2.90390181541
    th_params: 1.51116394997
    th_params: 7.70134738559e-06
    th_params: 2.66161441687e-06
    th_params: 0.0
    th_params: 2.69815039635
    th_params: 2.17335939407
    th_params: 9.57143583946e-07
    th_params: 1.7709619442e-06
    th_params: 2.63484096527
    th_params: 2.99549174309
    th_params: 1.80117201805
    th_params: 1.2851742506
    th_params: 0.874150276184
    th_params: 1.46430838108
    th_params: 1.15436708927
    th_params: 2.25507410505e-05
    th_params: 2.36062598228
    th_params: 2.31444263458
    th_params: 8.76717313076e-05
    th_params: 0.00044776397408
    th_params: 1.60347030942e-06
    th_params: 2.28485250473
    th_params: 0.0
    th_params: 0.684450209141
    th_params: 2.86285352707
  }
}
layer {
  name: "relu2_1/dw"
  type: "ReLU"
  bottom: "conv2_1/dw"
  top: "conv2_1/dw"
}
layer {
  name: "conv2_1/sep"
  type: "ConvolutionRistretto"
  bottom: "conv2_1/dw"
  top: "conv2_1/sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 3.446829319
    th_layer_out: 3.1386384964
    th_params: 1.5491758585
    th_params: 0.830694258213
    th_params: 4.14576425101e-06
    th_params: 1.38814032078
    th_params: 1.5815230608
    th_params: 0.852783739567
    th_params: 0.886019647121
    th_params: 0.972245275974
    th_params: 0.604161560535
    th_params: 0.637418031693
    th_params: 0.982028186321
    th_params: 0.75768750906
    th_params: 0.832709372044
    th_params: 0.609562695026
    th_params: 0.925202667713
    th_params: 0.973334789276
    th_params: 0.433423936367
    th_params: 1.23706007004
    th_params: 0.994779825211
    th_params: 0.549722731113
    th_params: 0.0
    th_params: 0.0
    th_params: 8.4764752728e-07
    th_params: 1.16700780392
    th_params: 0.0
    th_params: 0.59033125639
    th_params: 0.195690602064
    th_params: 7.9515092466e-07
    th_params: 0.0
    th_params: 0.578550338745
    th_params: 0.542274236679
    th_params: 0.790332496166
    th_params: 1.01215457916
    th_params: 0.0
    th_params: 0.912580311298
    th_params: 1.62435662746
    th_params: 1.06049108505
    th_params: 0.819095432758
    th_params: 0.620261251926
    th_params: 0.952373683453
    th_params: 1.26099705696
    th_params: 1.02998399734
    th_params: 0.874986469746
    th_params: 1.45088267326
    th_params: 0.238337978721
    th_params: 0.463147640228
    th_params: 0.0
    th_params: 1.65726780891
    th_params: 0.33400452137
    th_params: 0.0
    th_params: 0.468485444784
    th_params: 0.707814157009
    th_params: 0.846886456013
    th_params: 2.45112096309e-06
    th_params: 0.843233466148
    th_params: 1.45455777645
    th_params: 0.6443349123
    th_params: 0.731362342834
    th_params: 1.42619025707
    th_params: 0.493827164173
    th_params: 0.998834908009
    th_params: 0.707848548889
    th_params: 1.48824977875
    th_params: 0.656805753708
  }
}
layer {
  name: "relu2_1/sep"
  type: "ReLU"
  bottom: "conv2_1/sep"
  top: "conv2_1/sep"
}
layer {
  name: "conv2_2/dw"
  type: "ConvolutionRistretto"
  bottom: "conv2_1/sep"
  top: "conv2_2/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 3.1386384964
    th_layer_out: 2.29576086998
    th_params: 0.785235226154
    th_params: 0.554398715496
    th_params: 6.12899975749e-06
    th_params: 0.555048763752
    th_params: 0.826133370399
    th_params: 0.527400970459
    th_params: 0.635436296463
    th_params: 0.558216929436
    th_params: 1.29733490944
    th_params: 1.79517304897
    th_params: 0.404965162277
    th_params: 0.674751520157
    th_params: 0.689504861832
    th_params: 0.863760709763
    th_params: 0.477963656187
    th_params: 0.688702464104
    th_params: 1.48531711102
    th_params: 0.37153673172
    th_params: 0.847019255161
    th_params: 0.58208155632
    th_params: 0.000107356463559
    th_params: 2.05481483135e-05
    th_params: 8.00633915787e-06
    th_params: 0.721221029758
    th_params: 0.000214418716496
    th_params: 1.35042250156
    th_params: 1.40581357479
    th_params: 0.0
    th_params: 7.83001523814e-05
    th_params: 0.524886906147
    th_params: 1.09265828133
    th_params: 0.451067984104
    th_params: 0.566354095936
    th_params: 6.90383694746e-06
    th_params: 0.426943361759
    th_params: 0.426240026951
    th_params: 0.445710510015
    th_params: 1.16337525845
    th_params: 1.46985256672
    th_params: 0.490859031677
    th_params: 0.995453774929
    th_params: 0.780842125416
    th_params: 1.65598344803
    th_params: 0.636163532734
    th_params: 1.14732921124
    th_params: 0.849561095238
    th_params: 1.59242358677e-06
    th_params: 0.614542603493
    th_params: 1.66627085209
    th_params: 6.56640941088e-06
    th_params: 1.22475492954
    th_params: 1.08725440502
    th_params: 1.34226429462
    th_params: 0.0
    th_params: 1.16235101223
    th_params: 0.590739965439
    th_params: 0.730206251144
    th_params: 1.02141749859
    th_params: 0.819052577019
    th_params: 1.40294957161
    th_params: 0.77534288168
    th_params: 0.761960566044
    th_params: 0.707813560963
    th_params: 0.420291215181
  }
}
layer {
  name: "relu2_2/dw"
  type: "ReLU"
  bottom: "conv2_2/dw"
  top: "conv2_2/dw"
}
layer {
  name: "conv2_2/sep"
  type: "ConvolutionRistretto"
  bottom: "conv2_2/dw"
  top: "conv2_2/sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 2.29576086998
    th_layer_out: 1.37633264065
    th_params: 0.718214929104
    th_params: 0.280501514673
    th_params: 0.756915330887
    th_params: 0.0948332622647
    th_params: 0.201860398054
    th_params: 0.284959793091
    th_params: 0.359522372484
    th_params: 0.126208662987
    th_params: 0.148896470666
    th_params: 0.230740502477
    th_params: 0.371837347746
    th_params: 0.271703749895
    th_params: 0.572942018509
    th_params: 0.430554896593
    th_params: 0.1747199893
    th_params: 0.142722591758
    th_params: 0.114166021347
    th_params: 0.43118211627
    th_params: 0.333973169327
    th_params: 0.357035547495
    th_params: 0.492947101593
    th_params: 0.159216850996
    th_params: 0.418575227261
    th_params: 0.223439872265
    th_params: 0.48347184062
    th_params: 0.247132316232
    th_params: 0.161453962326
    th_params: 0.296526700258
    th_params: 0.465558618307
    th_params: 0.22159665823
    th_params: 0.0
    th_params: 0.325459897518
    th_params: 0.133286774158
    th_params: 0.550575554371
    th_params: 0.0796637162566
    th_params: 0.27896669507
    th_params: 0.336108535528
    th_params: 0.248783841729
    th_params: 0.13704906404
    th_params: 0.0712131857872
    th_params: 0.247805520892
    th_params: 0.0690851807594
    th_params: 0.292289853096
    th_params: 0.311247557402
    th_params: 0.335071951151
    th_params: 0.315705120564
    th_params: 0.0646434351802
    th_params: 0.47189578414
    th_params: 0.446920067072
    th_params: 0.274595081806
    th_params: 0.0733566507697
    th_params: 0.31745493412
    th_params: 0.497553259134
    th_params: 0.424277275801
    th_params: 0.561284422874
    th_params: 0.460071563721
    th_params: 0.541577875614
    th_params: 0.328476727009
    th_params: 0.433244556189
    th_params: 0.175724521279
    th_params: 0.57521790266
    th_params: 0.231673628092
    th_params: 1.22849723994e-06
    th_params: 0.616916358471
    th_params: 0.364393353462
    th_params: 0.204047620296
    th_params: 0.259021162987
    th_params: 0.489786416292
    th_params: 0.12841065228
    th_params: 0.105611942708
    th_params: 0.308464050293
    th_params: 0.308096677065
    th_params: 0.417422622442
    th_params: 0.264765590429
    th_params: 0.405369222164
    th_params: 0.264504313469
    th_params: 0.0
    th_params: 0.287228792906
    th_params: 0.21990455687
    th_params: 0.272693634033
    th_params: 0.511766314507
    th_params: 0.264203906059
    th_params: 0.25246950984
    th_params: 0.718172371387
    th_params: 0.0916462093592
    th_params: 0.199055433273
    th_params: 0.0
    th_params: 0.297729760408
    th_params: 0.264283537865
    th_params: 0.46024787426
    th_params: 0.300301790237
    th_params: 0.548245310783
    th_params: 0.169209450483
    th_params: 0.706433713436
    th_params: 0.431343615055
    th_params: 0.218068435788
    th_params: 0.423227936029
    th_params: 0.102341428399
    th_params: 0.573460698128
    th_params: 0.329482406378
    th_params: 0.257307708263
    th_params: 0.217300146818
    th_params: 0.142564699054
    th_params: 0.423274546862
    th_params: 0.41643896699
    th_params: 0.153237044811
    th_params: 0.183914765716
    th_params: 0.0
    th_params: 0.540555715561
    th_params: 0.431319981813
    th_params: 0.733331501484
    th_params: 0.174455747008
    th_params: 0.220895364881
    th_params: 0.338488787413
    th_params: 0.468857884407
    th_params: 0.442635267973
    th_params: 0.0
    th_params: 0.584984600544
    th_params: 0.311265826225
    th_params: 0.39560136199
    th_params: 0.163124158978
    th_params: 0.115172557533
    th_params: 0.368692725897
    th_params: 0.0634345710278
    th_params: 0.243649199605
    th_params: 0.664323210716
    th_params: 0.358554512262
    th_params: 0.360069721937
  }
}
layer {
  name: "relu2_2/sep"
  type: "ReLU"
  bottom: "conv2_2/sep"
  top: "conv2_2/sep"
}
layer {
  name: "conv3_1/dw"
  type: "ConvolutionRistretto"
  bottom: "conv2_2/sep"
  top: "conv3_1/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.37633264065
    th_layer_out: 1.95798039436
    th_params: 2.29918622971
    th_params: 2.71371412277
    th_params: 1.25471305847
    th_params: 3.06200098991
    th_params: 1.98206496239
    th_params: 2.18828415871
    th_params: 3.12725019455
    th_params: 5.25082874298
    th_params: 3.65301156044
    th_params: 0.926863670349
    th_params: 2.40639090538
    th_params: 1.96841907501
    th_params: 2.47884249687
    th_params: 2.29294347763
    th_params: 2.57732176781
    th_params: 1.05459284782
    th_params: 3.97268176079
    th_params: 1.82754051685
    th_params: 1.58762991428
    th_params: 2.01145029068
    th_params: 2.23519897461
    th_params: 1.96274411678
    th_params: 2.09844374657
    th_params: 2.12075042725
    th_params: 2.0499856472
    th_params: 1.95308494568
    th_params: 1.80896735191
    th_params: 1.87585484982
    th_params: 1.18657135963
    th_params: 1.6785504818
    th_params: 0.000121568373288
    th_params: 2.92405605316
    th_params: 2.00398302078
    th_params: 2.03076934814
    th_params: 3.92010450363
    th_params: 3.19396615028
    th_params: 1.8111063242
    th_params: 1.54454481602
    th_params: 5.1754322052
    th_params: 3.25533270836
    th_params: 1.10837090015
    th_params: 4.41652965546
    th_params: 2.84407544136
    th_params: 2.30256390572
    th_params: 2.03544330597
    th_params: 1.17315638065
    th_params: 3.41337323189
    th_params: 0.636931359768
    th_params: 2.13952374458
    th_params: 2.24527215958
    th_params: 1.39751255512
    th_params: 1.50552523136
    th_params: 1.57148778439
    th_params: 1.16391539574
    th_params: 0.949768006802
    th_params: 0.750174641609
    th_params: 0.282881945372
    th_params: 0.376630723476
    th_params: 0.909221708775
    th_params: 2.8156979084
    th_params: 0.570317625999
    th_params: 2.35065293312
    th_params: 0.0
    th_params: 3.12929320335
    th_params: 2.33440113068
    th_params: 3.06591129303
    th_params: 1.96304225922
    th_params: 1.56106436253
    th_params: 2.6990249157
    th_params: 3.31349110603
    th_params: 2.29221582413
    th_params: 1.41765522957
    th_params: 5.52635622025
    th_params: 1.39063537121
    th_params: 2.36371040344
    th_params: 1.63846588135
    th_params: 2.6608187909e-05
    th_params: 0.780166983604
    th_params: 2.43117642403
    th_params: 2.08512949944
    th_params: 0.98531460762
    th_params: 3.21772527695
    th_params: 0.719522833824
    th_params: 0.855771899223
    th_params: 2.89766335487
    th_params: 2.64343142509
    th_params: 2.33796799876e-06
    th_params: 1.51426482201
    th_params: 2.1987054348
    th_params: 0.383678406477
    th_params: 1.06856417656
    th_params: 0.952401220798
    th_params: 3.04367017746
    th_params: 0.65009188652
    th_params: 2.44825363159
    th_params: 1.35645925999
    th_params: 0.451780855656
    th_params: 2.7701086998
    th_params: 0.718499004841
    th_params: 1.10300278664
    th_params: 1.70142006874
    th_params: 1.77206361294
    th_params: 2.136677742
    th_params: 2.19211506844
    th_params: 2.31773114204
    th_params: 3.13961982727
    th_params: 2.085511446
    th_params: 1.69563772943e-05
    th_params: 1.3309725523
    th_params: 1.42050886154
    th_params: 1.13339245319
    th_params: 0.588573873043
    th_params: 2.34683465958
    th_params: 1.96827065945
    th_params: 2.31262969971
    th_params: 1.71550774574
    th_params: 1.74471188075e-05
    th_params: 2.59375977516
    th_params: 2.0092484951
    th_params: 2.40038251877
    th_params: 2.65382814407
    th_params: 3.70025634766
    th_params: 1.79611873627
    th_params: 3.52330780029
    th_params: 2.24444580078
    th_params: 2.2967133522
    th_params: 0.916998624802
    th_params: 0.519651412964
  }
}
layer {
  name: "relu3_1/dw"
  type: "ReLU"
  bottom: "conv3_1/dw"
  top: "conv3_1/dw"
}
layer {
  name: "conv3_1/sep"
  type: "ConvolutionRistretto"
  bottom: "conv3_1/dw"
  top: "conv3_1/sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.95798039436
    th_layer_out: 1.88037407398
    th_params: 0.429916411638
    th_params: 0.240442603827
    th_params: 0.359005957842
    th_params: 0.536599516869
    th_params: 0.244009330869
    th_params: 0.499967128038
    th_params: 0.678963780403
    th_params: 0.354319065809
    th_params: 0.108858406544
    th_params: 0.46370151639
    th_params: 0.735799074173
    th_params: 0.528050005436
    th_params: 0.339672267437
    th_params: 0.280839979649
    th_params: 0.359772443771
    th_params: 0.254020452499
    th_params: 0.344611644745
    th_params: 0.34379580617
    th_params: 0.390944212675
    th_params: 0.371797323227
    th_params: 0.475741267204
    th_params: 0.444777548313
    th_params: 0.358915030956
    th_params: 0.302087843418
    th_params: 0.316653847694
    th_params: 0.0
    th_params: 0.776307463646
    th_params: 0.0526872500777
    th_params: 0.359657675028
    th_params: 0.462980538607
    th_params: 0.461209535599
    th_params: 0.0815348103642
    th_params: 0.127781644464
    th_params: 1.19857573509
    th_params: 0.379217237234
    th_params: 0.300042003393
    th_params: 0.269830107689
    th_params: 0.907201468945
    th_params: 0.0
    th_params: 0.63921970129
    th_params: 0.288293123245
    th_params: 0.329997092485
    th_params: 0.635295569897
    th_params: 0.177071154118
    th_params: 0.288449764252
    th_params: 2.5340391403e-06
    th_params: 0.465926289558
    th_params: 0.484640955925
    th_params: 0.300591319799
    th_params: 0.528931856155
    th_params: 0.456906676292
    th_params: 0.0
    th_params: 0.445886105299
    th_params: 0.589521825314
    th_params: 0.260130524635
    th_params: 1.75936372671e-06
    th_params: 0.375691503286
    th_params: 0.147016748786
    th_params: 0.233777955174
    th_params: 0.311605125666
    th_params: 0.282774627209
    th_params: 0.365957379341
    th_params: 0.383685767651
    th_params: 0.406143188477
    th_params: 0.18762242794
    th_params: 0.369681864977
    th_params: 0.317218184471
    th_params: 2.25962153877e-07
    th_params: 0.548951208591
    th_params: 0.260957449675
    th_params: 0.368448793888
    th_params: 0.236627787352
    th_params: 0.588046371937
    th_params: 0.34852924943
    th_params: 0.359814703465
    th_params: 0.324953407049
    th_params: 0.49914136529
    th_params: 0.141008660197
    th_params: 0.720124542713
    th_params: 0.450037300587
    th_params: 0.434863418341
    th_params: 0.440192937851
    th_params: 0.268506556749
    th_params: 0.169846400619
    th_params: 0.141381919384
    th_params: 0.494677841663
    th_params: 2.12114650822e-06
    th_params: 0.475196570158
    th_params: 0.286046862602
    th_params: 0.448689699173
    th_params: 0.349006921053
    th_params: 0.215442404151
    th_params: 0.553162932396
    th_params: 0.56667971611
    th_params: 0.505645513535
    th_params: 1.31236220113e-06
    th_params: 0.704251766205
    th_params: 7.10297229034e-07
    th_params: 0.443511068821
    th_params: 0.496046751738
    th_params: 0.514107406139
    th_params: 1.38228678703
    th_params: 0.282664120197
    th_params: 0.544543325901
    th_params: 0.359829217196
    th_params: 0.393567323685
    th_params: 0.279888093472
    th_params: 0.294561296701
    th_params: 0.382794946432
    th_params: 0.289823740721
    th_params: 0.180735781789
    th_params: 0.142157480121
    th_params: 4.39509648231e-07
    th_params: 0.167595818639
    th_params: 1.29173517227
    th_params: 0.448878020048
    th_params: 0.746369838715
    th_params: 0.361822158098
    th_params: 0.0
    th_params: 0.314769595861
    th_params: 0.513544499874
    th_params: 0.325866162777
    th_params: 0.167922481894
    th_params: 0.321323305368
    th_params: 0.632985830307
    th_params: 0.184059664607
    th_params: 0.406573474407
    th_params: 0.496654123068
  }
}
layer {
  name: "relu3_1/sep"
  type: "ReLU"
  bottom: "conv3_1/sep"
  top: "conv3_1/sep"
}
layer {
  name: "conv3_2/dw"
  type: "ConvolutionRistretto"
  bottom: "conv3_1/sep"
  top: "conv3_2/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 128
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.88037407398
    th_layer_out: 1.6203546524
    th_params: 0.802915334702
    th_params: 0.572396457195
    th_params: 0.65572142601
    th_params: 0.96470105648
    th_params: 0.72928249836
    th_params: 0.552069604397
    th_params: 0.609586000443
    th_params: 1.06353843212
    th_params: 1.01531493664
    th_params: 0.627030611038
    th_params: 0.638868570328
    th_params: 0.809900522232
    th_params: 0.641129434109
    th_params: 0.82366424799
    th_params: 0.496634930372
    th_params: 0.49883261323
    th_params: 1.07888221741
    th_params: 0.693041026592
    th_params: 0.768328487873
    th_params: 0.884572982788
    th_params: 0.386371552944
    th_params: 0.550221025944
    th_params: 0.745907723904
    th_params: 0.748948395252
    th_params: 0.747666180134
    th_params: 2.54637852777e-05
    th_params: 1.01082849503
    th_params: 1.79384160042
    th_params: 0.421859264374
    th_params: 0.819790840149
    th_params: 0.652376532555
    th_params: 2.5766017437
    th_params: 1.09721672535
    th_params: 1.14984667301
    th_params: 0.892230272293
    th_params: 0.461364716291
    th_params: 1.03468489647
    th_params: 0.329742014408
    th_params: 5.57608545932e-05
    th_params: 0.592229366302
    th_params: 0.757931411266
    th_params: 0.450212538242
    th_params: 0.620923221111
    th_params: 1.51188492775
    th_params: 0.759987056255
    th_params: 0.0
    th_params: 0.508276820183
    th_params: 0.43035748601
    th_params: 0.682529568672
    th_params: 0.589008867741
    th_params: 0.44814479351
    th_params: 4.32909728261e-05
    th_params: 0.721814393997
    th_params: 0.937909185886
    th_params: 1.03810071945
    th_params: 0.0
    th_params: 0.763417422771
    th_params: 0.934551537037
    th_params: 0.97407579422
    th_params: 0.57900172472
    th_params: 0.683751344681
    th_params: 0.465783149004
    th_params: 0.831623196602
    th_params: 0.669828176498
    th_params: 1.20202052593
    th_params: 0.683737337589
    th_params: 0.740023434162
    th_params: 0.0
    th_params: 0.866026103497
    th_params: 0.837950527668
    th_params: 0.649591505527
    th_params: 0.763360142708
    th_params: 0.957068383694
    th_params: 0.761096060276
    th_params: 0.898193657398
    th_params: 0.766371488571
    th_params: 1.03710103035
    th_params: 1.46911180019
    th_params: 0.54102241993
    th_params: 0.482840687037
    th_params: 0.60275375843
    th_params: 0.776429176331
    th_params: 0.845215141773
    th_params: 1.30375361443
    th_params: 1.03269660473
    th_params: 0.785582959652
    th_params: 0.0
    th_params: 0.620525836945
    th_params: 1.19405519962
    th_params: 0.718641161919
    th_params: 0.659713566303
    th_params: 0.77193915844
    th_params: 0.795976519585
    th_params: 0.619037926197
    th_params: 0.664336442947
    th_params: 3.35708386956e-06
    th_params: 0.586103081703
    th_params: 0.0
    th_params: 0.681697487831
    th_params: 0.623370349407
    th_params: 0.695699155331
    th_params: 1.30909466743
    th_params: 0.75038421154
    th_params: 0.541063725948
    th_params: 0.815717101097
    th_params: 0.930544316769
    th_params: 0.794623553753
    th_params: 0.689690589905
    th_params: 0.623040914536
    th_params: 0.487303048372
    th_params: 0.684512257576
    th_params: 0.89460504055
    th_params: 0.0
    th_params: 1.11767315865
    th_params: 0.617828845978
    th_params: 0.800222933292
    th_params: 0.788454771042
    th_params: 0.780528604984
    th_params: 9.91564811557e-05
    th_params: 0.826465010643
    th_params: 0.403798937798
    th_params: 0.678455293179
    th_params: 0.900791049004
    th_params: 0.940219521523
    th_params: 0.945065438747
    th_params: 1.0016605854
    th_params: 0.609816789627
    th_params: 1.19977474213
  }
}
layer {
  name: "relu3_2/dw"
  type: "ReLU"
  bottom: "conv3_2/dw"
  top: "conv3_2/dw"
}
layer {
  name: "conv3_2/sep"
  type: "ConvolutionRistretto"
  bottom: "conv3_2/dw"
  top: "conv3_2/sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.6203546524
    th_layer_out: 1.11266493797
    th_params: 0.283990651369
    th_params: 0.236406669021
    th_params: 0.180373027921
    th_params: 0.0761648491025
    th_params: 0.186108261347
    th_params: 0.227233886719
    th_params: 0.235091879964
    th_params: 0.170071259141
    th_params: 0.197819337249
    th_params: 0.077204734087
    th_params: 0.108719803393
    th_params: 0.0
    th_params: 0.16603499651
    th_params: 0.338469386101
    th_params: 0.256200313568
    th_params: 0.173483595252
    th_params: 0.23894841969
    th_params: 0.273047834635
    th_params: 0.116970650852
    th_params: 0.374837100506
    th_params: 0.208813235164
    th_params: 0.30023175478
    th_params: 0.41876706481
    th_params: 0.0807124525309
    th_params: 0.102981686592
    th_params: 0.286568284035
    th_params: 0.240414351225
    th_params: 1.19374658425e-06
    th_params: 0.229882508516
    th_params: 0.15784522891
    th_params: 0.25953990221
    th_params: 0.255366563797
    th_params: 1.44583918882e-06
    th_params: 0.0947748348117
    th_params: 0.388420730829
    th_params: 0.454784661531
    th_params: 0.250484228134
    th_params: 0.0
    th_params: 0.207550793886
    th_params: 0.228167176247
    th_params: 0.0823090225458
    th_params: 0.243626013398
    th_params: 0.173546776175
    th_params: 0.261587113142
    th_params: 0.267945170403
    th_params: 0.284117609262
    th_params: 0.130372837186
    th_params: 0.136448338628
    th_params: 0.139017701149
    th_params: 0.0
    th_params: 0.26165497303
    th_params: 0.36112639308
    th_params: 0.261305302382
    th_params: 0.32262685895
    th_params: 0.212657228112
    th_params: 0.168164014816
    th_params: 0.375965446234
    th_params: 0.0
    th_params: 0.306461334229
    th_params: 0.0
    th_params: 0.33438000083
    th_params: 0.0
    th_params: 0.151009693742
    th_params: 0.173971310258
    th_params: 0.182683199644
    th_params: 0.0931788310409
    th_params: 0.343525111675
    th_params: 0.103301420808
    th_params: 0.190380185843
    th_params: 0.208017155528
    th_params: 0.227528810501
    th_params: 0.0
    th_params: 0.242036059499
    th_params: 0.111631549895
    th_params: 0.262482941151
    th_params: 0.131241649389
    th_params: 0.111966609955
    th_params: 0.467812299728
    th_params: 0.19437520206
    th_params: 0.216737866402
    th_params: 1.2728372667e-06
    th_params: 0.611779868603
    th_params: 0.148247554898
    th_params: 0.127022519708
    th_params: 0.0
    th_params: 0.167534276843
    th_params: 0.248311236501
    th_params: 0.228069663048
    th_params: 0.119362026453
    th_params: 0.110418766737
    th_params: 0.0978967100382
    th_params: 0.219410255551
    th_params: 0.197761565447
    th_params: 0.465220421553
    th_params: 0.125859260559
    th_params: 0.0873955488205
    th_params: 0.266742795706
    th_params: 0.332042306662
    th_params: 0.0816859081388
    th_params: 0.119968377054
    th_params: 0.237148761749
    th_params: 0.162539079785
    th_params: 0.147233352065
    th_params: 0.219258412719
    th_params: 0.124488778412
    th_params: 0.366074353456
    th_params: 0.202127128839
    th_params: 0.159399196506
    th_params: 0.26207062602
    th_params: 0.307235479355
    th_params: 0.390451312065
    th_params: 0.0
    th_params: 0.614873588085
    th_params: 0.130326420069
    th_params: 0.280982464552
    th_params: 0.0987878963351
    th_params: 0.231536597013
    th_params: 0.0717641413212
    th_params: 0.386291980743
    th_params: 0.223178178072
    th_params: 0.163925617933
    th_params: 0.156311452389
    th_params: 0.190890461206
    th_params: 0.173489406705
    th_params: 0.368715405464
    th_params: 0.3028627038
    th_params: 0.0
    th_params: 0.166241332889
    th_params: 0.0707749128342
    th_params: 0.271354436874
    th_params: 0.24571980536
    th_params: 0.175318524241
    th_params: 0.155448272824
    th_params: 0.230337262154
    th_params: 0.243228375912
    th_params: 0.104072697461
    th_params: 0.257057398558
    th_params: 0.335540831089
    th_params: 0.257497757673
    th_params: 0.417942672968
    th_params: 0.180684030056
    th_params: 0.196552693844
    th_params: 0.0
    th_params: 0.499057501554
    th_params: 0.507686138153
    th_params: 0.0716920420527
    th_params: 0.191267192364
    th_params: 0.211033865809
    th_params: 0.518939554691
    th_params: 0.184632748365
    th_params: 0.696981787682
    th_params: 0.190156459808
    th_params: 0.152357622981
    th_params: 0.181344270706
    th_params: 0.267026156187
    th_params: 0.113556623459
    th_params: 0.217594116926
    th_params: 0.212010502815
    th_params: 0.13466489315
    th_params: 0.128996297717
    th_params: 0.319660872221
    th_params: 0.266214311123
    th_params: 0.347791165113
    th_params: 0.186512887478
    th_params: 0.272884011269
    th_params: 0.332941234112
    th_params: 0.297934889793
    th_params: 0.198253899813
    th_params: 0.0
    th_params: 0.345551133156
    th_params: 0.26863771677
    th_params: 0.361445695162
    th_params: 0.0843054056168
    th_params: 0.252144873142
    th_params: 0.225013777614
    th_params: 0.209833741188
    th_params: 0.284795194864
    th_params: 0.147186145186
    th_params: 0.144395157695
    th_params: 0.0
    th_params: 7.15531257356e-07
    th_params: 0.116012267768
    th_params: 0.118870005012
    th_params: 0.154024526477
    th_params: 0.0666560232639
    th_params: 0.212702766061
    th_params: 0.179311513901
    th_params: 0.196693569422
    th_params: 0.264760255814
    th_params: 2.14479268834e-06
    th_params: 0.206689372659
    th_params: 0.135168045759
    th_params: 0.418342024088
    th_params: 0.315117686987
    th_params: 0.560312390327
    th_params: 0.0924247279763
    th_params: 5.7956992805e-07
    th_params: 0.269502729177
    th_params: 0.308918178082
    th_params: 0.116379141808
    th_params: 0.434461116791
    th_params: 0.203601121902
    th_params: 0.194198474288
    th_params: 0.100344218314
    th_params: 0.289270043373
    th_params: 0.228456348181
    th_params: 0.430996268988
    th_params: 0.103473506868
    th_params: 0.0817295536399
    th_params: 0.390322804451
    th_params: 0.193604156375
    th_params: 0.90516602993
    th_params: 0.190869912505
    th_params: 0.18619723618
    th_params: 0.179197862744
    th_params: 0.150040924549
    th_params: 0.220317959785
    th_params: 0.423263281584
    th_params: 0.241533204913
    th_params: 0.426729232073
    th_params: 0.118378974497
    th_params: 0.141874030232
    th_params: 0.174387767911
    th_params: 0.16712859273
    th_params: 0.125440344214
    th_params: 0.218008935452
    th_params: 0.282758980989
    th_params: 0.248441874981
    th_params: 0.265593916178
    th_params: 0.243848219514
    th_params: 0.186182826757
    th_params: 0.209052413702
    th_params: 0.189520433545
    th_params: 0.183124363422
    th_params: 0.181035503745
    th_params: 0.331991761923
    th_params: 0.317564308643
    th_params: 0.287456572056
    th_params: 0.150661468506
    th_params: 0.199119240046
    th_params: 0.253680348396
    th_params: 0.0918701216578
    th_params: 1.84387795343e-06
    th_params: 0.141203999519
    th_params: 0.281845957041
    th_params: 0.107946023345
    th_params: 0.0957456082106
    th_params: 0.260356932878
    th_params: 0.135498940945
    th_params: 0.307220548391
    th_params: 0.20212559402
    th_params: 0.234505757689
    th_params: 0.240992262959
    th_params: 0.184129670262
    th_params: 0.225688785315
    th_params: 0.293384075165
  }
}
layer {
  name: "relu3_2/sep"
  type: "ReLU"
  bottom: "conv3_2/sep"
  top: "conv3_2/sep"
}
layer {
  name: "conv4_1/dw"
  type: "ConvolutionRistretto"
  bottom: "conv3_2/sep"
  top: "conv4_1/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.11266493797
    th_layer_out: 1.64746928215
    th_params: 1.6940690279
    th_params: 2.22859215736
    th_params: 3.87460803986
    th_params: 4.47581100464
    th_params: 2.94814252853
    th_params: 1.68515348434
    th_params: 2.31078577042
    th_params: 2.30042719841
    th_params: 2.5827293396
    th_params: 2.92494988441
    th_params: 3.12681913376
    th_params: 5.21571892023e-05
    th_params: 2.26422691345
    th_params: 0.562235474586
    th_params: 1.99101209641
    th_params: 3.08937907219
    th_params: 1.2477915287
    th_params: 1.36487948895
    th_params: 2.50823307037
    th_params: 3.13554239273
    th_params: 2.40281319618
    th_params: 1.43493366241
    th_params: 0.848162889481
    th_params: 4.01802062988
    th_params: 2.01735639572
    th_params: 2.15243124962
    th_params: 0.688171207905
    th_params: 0.0
    th_params: 1.33035266399
    th_params: 0.967792928219
    th_params: 1.27861523628
    th_params: 0.837786257267
    th_params: 2.15310546992e-06
    th_params: 2.75472521782
    th_params: 0.53835606575
    th_params: 0.612042665482
    th_params: 3.18078041077
    th_params: 6.05672357779e-06
    th_params: 2.3918902874
    th_params: 0.498686611652
    th_params: 3.78723788261
    th_params: 0.841289639473
    th_params: 1.35348165035
    th_params: 1.74873805046
    th_params: 1.73944759369
    th_params: 1.32220029831
    th_params: 2.54163575172
    th_params: 1.26952075958
    th_params: 1.60563910007
    th_params: 2.56060575339e-05
    th_params: 1.55916690826
    th_params: 0.580693483353
    th_params: 0.454388201237
    th_params: 2.95031046867
    th_params: 1.87296879292
    th_params: 1.63717317581
    th_params: 2.20656752586
    th_params: 2.00119902729e-05
    th_params: 0.620177149773
    th_params: 2.90060634143e-05
    th_params: 1.07425308228
    th_params: 5.61875458516e-05
    th_params: 2.56098866463
    th_params: 2.56392073631
    th_params: 1.76520109177
    th_params: 2.35780930519
    th_params: 1.41476690769
    th_params: 2.14558696747
    th_params: 3.34938979149
    th_params: 1.43848347664
    th_params: 2.37978100777
    th_params: 4.47422935395e-05
    th_params: 3.96486663818
    th_params: 2.61136937141
    th_params: 2.39334058762
    th_params: 1.5868679285
    th_params: 2.84646081924
    th_params: 0.93353253603
    th_params: 1.480879426
    th_params: 1.47029483318
    th_params: 0.0
    th_params: 2.00815320015
    th_params: 1.4825129509
    th_params: 1.98825716972
    th_params: 7.36671936465e-05
    th_params: 2.13605833054
    th_params: 1.8950586319
    th_params: 1.07963645458
    th_params: 3.5327527523
    th_params: 1.36082470417
    th_params: 1.01461136341
    th_params: 0.680532932281
    th_params: 0.988324761391
    th_params: 0.496956110001
    th_params: 3.48914551735
    th_params: 2.38807725906
    th_params: 2.6113922596
    th_params: 4.35829973221
    th_params: 2.54176497459
    th_params: 2.69582700729
    th_params: 1.78151094913
    th_params: 2.65435314178
    th_params: 2.7325553894
    th_params: 1.65918600559
    th_params: 3.8214609623
    th_params: 1.4880168438
    th_params: 2.06190037727
    th_params: 2.5148358345
    th_params: 1.97876620293
    th_params: 1.30659425259
    th_params: 1.36577558517
    th_params: 6.55795338389e-06
    th_params: 0.486630618572
    th_params: 2.640666008
    th_params: 0.641820907593
    th_params: 2.76321554184
    th_params: 2.52984905243
    th_params: 4.60957956314
    th_params: 0.431073606014
    th_params: 2.75059342384
    th_params: 1.07948720455
    th_params: 2.83297085762
    th_params: 2.28317141533
    th_params: 1.4324631691
    th_params: 4.2590265274
    th_params: 0.446006953716
    th_params: 1.3807493815e-05
    th_params: 2.2497959137
    th_params: 4.48417568207
    th_params: 2.39841222763
    th_params: 1.07015275955
    th_params: 1.34844470024
    th_params: 2.0227367878
    th_params: 2.56813144684
    th_params: 0.584568023682
    th_params: 3.34627485275
    th_params: 2.06654477119
    th_params: 2.14476013184
    th_params: 1.74602735043
    th_params: 1.54199659824
    th_params: 2.27512741089
    th_params: 0.326070696115
    th_params: 2.71402495855e-06
    th_params: 2.32486820221
    th_params: 0.528247416019
    th_params: 5.44928836823
    th_params: 1.81803202629
    th_params: 1.16826248169
    th_params: 1.48491632938
    th_params: 2.98627495766
    th_params: 0.325054347515
    th_params: 2.40287184715
    th_params: 5.39798307419
    th_params: 2.46134543419
    th_params: 2.39315080643
    th_params: 3.57470774651
    th_params: 1.76335310936
    th_params: 2.57283806801
    th_params: 1.34082388878
    th_params: 2.67271208763
    th_params: 1.1348118782
    th_params: 1.73730242252
    th_params: 1.69252467155
    th_params: 1.72638404369
    th_params: 2.34058785439
    th_params: 0.749820113182
    th_params: 0.69742590189
    th_params: 2.64111399651
    th_params: 1.02910562418e-05
    th_params: 1.59587907791
    th_params: 0.780092000961
    th_params: 0.987747967243
    th_params: 4.37092018127
    th_params: 0.902907073498
    th_params: 1.25286614895
    th_params: 1.19528210163
    th_params: 2.21660280228
    th_params: 1.77422475815
    th_params: 4.03006839752
    th_params: 2.097280003e-06
    th_params: 0.0
    th_params: 2.6117374897
    th_params: 3.95062828064
    th_params: 1.67500567436
    th_params: 1.94770765305
    th_params: 1.15867507458
    th_params: 3.09801411629
    th_params: 1.60559511185
    th_params: 1.287976861
    th_params: 0.0
    th_params: 1.83943235874
    th_params: 2.19444084167
    th_params: 1.06333553791
    th_params: 1.08372354507
    th_params: 0.516726493835
    th_params: 5.38670444489
    th_params: 0.0
    th_params: 2.37546396255
    th_params: 2.2257065773
    th_params: 2.04560279846
    th_params: 2.55891799927
    th_params: 2.15092086792
    th_params: 1.63117468357
    th_params: 3.71954226494
    th_params: 1.4370123148
    th_params: 1.65520846844
    th_params: 2.04703021049
    th_params: 1.45066964626
    th_params: 2.30627155304
    th_params: 1.76261389256
    th_params: 1.34189581871
    th_params: 0.814667224884
    th_params: 1.55248939991
    th_params: 0.63765078783
    th_params: 1.58511590958
    th_params: 2.44097304344
    th_params: 1.46359348297
    th_params: 2.89484977722
    th_params: 1.4599186182
    th_params: 1.24992966652
    th_params: 2.81144332886
    th_params: 2.31528687477
    th_params: 2.87979006767
    th_params: 4.06767129898
    th_params: 1.59523427486
    th_params: 1.84451270103
    th_params: 2.74539732933
    th_params: 2.20374774933
    th_params: 2.18486595154
    th_params: 2.17087745667
    th_params: 3.46574831009
    th_params: 2.78194117546
    th_params: 1.67298257351
    th_params: 2.06918430328
    th_params: 0.902532577515
    th_params: 0.49753472209
    th_params: 0.550528824329
    th_params: 2.68183469772
    th_params: 2.28988480568
    th_params: 2.45034623146
    th_params: 0.352102339268
    th_params: 3.0741417408
    th_params: 0.0
    th_params: 3.92487287521
    th_params: 2.07181334496
    th_params: 1.49707269669
    th_params: 2.07086324692
    th_params: 1.39555931091
    th_params: 1.86869227886
    th_params: 0.97756934166
    th_params: 3.88268280029
    th_params: 1.67268192768
    th_params: 2.03382349014
    th_params: 2.60235905647
    th_params: 2.67433810234
    th_params: 1.61987864971
  }
}
layer {
  name: "relu4_1/dw"
  type: "ReLU"
  bottom: "conv4_1/dw"
  top: "conv4_1/dw"
}
layer {
  name: "conv4_1/sep"
  type: "ConvolutionRistretto"
  bottom: "conv4_1/dw"
  top: "conv4_1/sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    th_layer_in: 1.64746928215
    th_layer_out: 1.06465995312
    th_params: 0.275797873735
    th_params: 0.122065916657
    th_params: 0.264858990908
    th_params: 0.271000862122
    th_params: 0.429183155298
    th_params: 0.357491642237
    th_params: 0.116628907621
    th_params: 1.05157482722e-07
    th_params: 0.000222140355618
    th_params: 0.186733543873
    th_params: 5.87087640724e-07
    th_params: 0.241635739803
    th_params: 0.110269345343
    th_params: 0.380111396313
    th_params: 0.210520416498
    th_params: 0.198160424829
    th_params: 0.23331668973
    th_params: 0.19140702486
    th_params: 0.256991058588
    th_params: 0.160799399018
    th_params: 0.229498639703
    th_params: 0.279086887836
    th_params: 0.185498744249
    th_params: 0.317596316338
    th_params: 0.22291123867
    th_params: 0.21335349977
    th_params: 0.323212474585
    th_params: 0.209315508604
    th_params: 0.119993396103
    th_params: 0.197567433119
    th_params: 0.161962717772
    th_params: 0.216569304466
    th_params: 0.18010763824
    th_params: 0.272520065308
    th_params: 0.234446227551
    th_params: 0.269894897938
    th_params: 0.294932872057
    th_params: 0.170801982284
    th_params: 0.150243535638
    th_params: 0.196906968951
    th_params: 0.313760191202
    th_params: 0.326182335615
    th_params: 0.230270013213
    th_params: 0.277206748724
    th_params: 0.205390259624
    th_params: 0.201835542917
    th_params: 0.136753499508
    th_params: 0.180790930986
    th_params: 0.122017890215
    th_params: 0.206509098411
    th_params: 0.281728476286
    th_params: 0.578749775887
    th_params: 0.335166931152
    th_params: 0.210057526827
    th_params: 0.0957928150892
    th_params: 9.67519753203e-08
    th_params: 0.196506664157
    th_params: 0.0941299274564
    th_params: 0.211081027985
    th_params: 0.282373785973
    th_params: 0.381423324347
    th_params: 0.0861997008324
    th_params: 0.0
    th_params: 0.114231191576
    th_params: 0.269064813852
    th_params: 0.124873042107
    th_params: 0.124059125781
    th_params: 0.37961101532
    th_params: 0.115794673562
    th_params: 0.208584442735
    th_params: 0.249302372336
    th_params: 0.329029560089
    th_params: 0.138235479593
    th_params: 0.240126624703
    th_params: 0.101004302502
    th_params: 0.29753446579
    th_params: 0.416943430901
    th_params: 0.272607177496
    th_params: 0.101211771369
    th_params: 0.121054261923
    th_params: 0.239053040743
    th_params: 0.0985849946737
    th_params: 0.199421212077
    th_params: 0.0
    th_params: 0.224008217454
    th_params: 0.093466758728
    th_params: 0.0967599377036
    th_params: 0.135257318616
    th_params: 0.0
    th_params: 0.0
    th_params: 0.130848631263
    th_params: 0.159020856023
    th_params: 0.229668021202
    th_params: 0.243519157171
    th_params: 0.242421671748
    th_params: 0.391345411539
    th_params: 0.237390339375
    th_params: 0.204799994826
    th_params: 0.243147656322
    th_params: 0.237663522363
    th_params: 0.199347525835
    th_params: 0.229171261191
    th_params: 0.256514400244
    th_params: 0.130207687616
    th_params: 0.343475759029
    th_params: 0.196457341313
    th_params: 0.18939499557
    th_params: 0.350017994642
    th_params: 0.225023567677
    th_params: 0.0932095497847
    th_params: 0.148260891438
    th_params: 0.238983169198
    th_params: 0.137698471546
    th_params: 0.259488195181
    th_params: 0.0458743423223
    th_params: 0.126682013273
    th_params: 0.219329163432
    th_params: 0.190849676728
    th_params: 0.290278941393
    th_params: 0.134178072214
    th_params: 0.0831087455153
    th_params: 0.210655719042
    th_params: 0.0289155188948
    th_params: 0.105198182166
    th_params: 0.195149078965
    th_params: 0.38215726614
    th_params: 0.160932198167
    th_params: 0.216401427984
    th_params: 0.126121819019
    th_params: 0.208788350224
    th_params: 0.352916866541
    th_params: 0.198790311813
    th_params: 0.247586339712
    th_params: 0.287377625704
    th_params: 0.207169368863
    th_params: 0.34889754653
    th_params: 0.208097308874
    th_params: 0.0
    th_params: 2.25348671279e-07
    th_params: 0.383792936802
    th_params: 0.143286839128
    th_params: 0.137351542711
    th_params: 0.225112557411
    th_params: 0.27254447341
    th_params: 0.212126925588
    th_params: 0.121631242335
    th_params: 0.0940791070461
    th_params: 0.112469106913
    th_params: 0.276014208794
    th_params: 0.160597130656
    th_params: 0.107940517366
    th_params: 0.313438415527
    th_params: 0.230531617999
    th_params: 0.122953347862
    th_params: 0.0753077790141
    th_params: 0.225877970457
    th_params: 0.26229006052
    th_params: 0.0
    th_params: 0.075761243701
    th_params: 0.28671169281
    th_params: 0.1416657269
    th_params: 0.0928093791008
    th_params: 0.219803959131
    th_params: 0.17791287601
    th_params: 0.193285614252
    th_params: 0.281092315912
    th_params: 0.130920484662
    th_params: 0.304631412029
    th_params: 0.217496082187
    th_params: 0.244183823466
    th_params: 7.58720261729e-07
    th_params: 0.0975951105356
    th_params: 0.19110019505
    th_params: 7.64465823977e-07
    th_params: 0.0938521027565
    th_params: 0.25151181221
    th_params: 0.0
    th_params: 0.109372422099
    th_params: 0.13991971314
    th_params: 0.319599896669
    th_params: 0.162759616971
    th_params: 0.214006707072
    th_params: 0.450019478798
    th_params: 0.261899650097
    th_params: 0.207080736756
    th_params: 0.112811848521
    th_params: 0.232557594776
    th_params: 0.175929576159
    th_params: 0.154236316681
    th_params: 0.16806550324
    th_params: 0.000112736001029
    th_params: 0.492540329695
    th_params: 0.41227132082
    th_params: 0.224280834198
    th_params: 0.295050680637
    th_params: 0.0
    th_params: 0.210725411773
    th_params: 0.156812146306
    th_params: 0.13939756155
    th_params: 0.156736075878
    th_params: 0.237300798297
    th_params: 0.196547687054
    th_params: 0.502195179462
    th_params: 0.184180915356
    th_params: 0.150695383549
    th_params: 1.73482385435e-06
    th_params: 0.178471431136
    th_params: 0.260625571012
    th_params: 0.230127155781
    th_params: 0.135494336486
    th_params: 0.173116758466
    th_params: 0.150256231427
    th_params: 0.140037342906
    th_params: 0.381571650505
    th_params: 0.23172070086
    th_params: 0.270883381367
    th_params: 0.0940457955003
    th_params: 2.48417421744e-07
    th_params: 0.134467169642
    th_params: 0.244726762176
    th_params: 0.209853008389
    th_params: 0.12322165072
    th_params: 0.166532725096
    th_params: 0.113241739571
    th_params: 0.473533391953
    th_params: 0.200509250164
